Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Discusses the definition, classification, and types of simple sentences.
ru: Обсуждает определение, классификацию и типы простых предложений.

source: Explains compound and complex sentences, including conditional sentences.
ru: Объясняет сложносочиненные и сложноподчиненные предложения, включая условные предложения.
