Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Follow same rules as fractions:
ru: Следуют тем же правилам, что и дроби:
uk: Дотримуйтесь тих самих правил, що й для дробів:

source: Money and Measurements
ru: Деньги и измерения
uk: Гроші та вимірювання

source: Treat amounts as singular:
ru: Относитесь к суммам как к единственному числу:
uk: Розглядайте суми як однину:

source: Reason
ru: Причина
uk: Причина

source: Plural countable noun
ru: Исчисляемое существительное во множественном числе
uk: Злічуваний іменник у множині

source: Fraction >1 requires plural
ru: Дробь >1 требует множественного числа
uk: Дріб >1 вимагає множини

source: Uncountable noun
ru: Неисчисляемое существительное
uk: Незлічуваний іменник

source: Numerals: Ordinal Numerals as Nouns
ru: Числительные: Порядковые числительные как существительные
uk: Числівники: Порядкові числівники як іменники

source: Numerals: Ordinal Numerals - Definition and Formation
ru: Числительные: Порядковые числительные - Определение и образование
uk: Числівники: Порядкові числівники - Визначення та утворення

source: Ordinal Numerals
ru: Порядковые числительные
uk: Порядкові числівники

source: Ordinal Numerals: Definition and Formation
ru: Порядковые числительные: Определение и образование
uk: Порядкові числівники: Визначення та утворення

source: Ordinal numerals indicate position or order in a sequence, answering the question '<span class="
uk: Порядкові числівники вказують на позицію або порядок у послідовності, відповідаючи на запитання '<span class="

source: 1. Key Characteristics
ru: 1. Основные характеристики
uk: 1. Основні характеристики

source: Always modify nouns (function as adjectives)
ru: Всегда определяют существительные (функционируют как прилагательные)
uk: Завжди модифікують іменники (функціонують як прикметники)

source: Can be written as words (third) or numerals with suffixes (3rd)
ru: Могут быть написаны словами (third) или цифрами с суффиксами (3rd)
uk: Можуть бути записані словами (third) або цифрами із суфіксами (3rd)

source: Often used with definite articles (the first, the second)
ru: Часто используются с определенными артиклями (the first, the second)
uk: Часто використовуються з означеними артиклями (the first, the second)

source: Formed differently from cardinal numbers
ru: Образуются иначе, чем количественные числительные
uk: Утворюються інакше, ніж кількісні числівники

source: 2. Formation Rules
ru: 2. Правила образования
uk: 2. Правила утворення

source: Number Range
ru: Диапазон чисел
uk: Діапазон чисел

source: Irregular
ru: Нерегулярные
uk: Нерегулярні

source: Note: fifth (not fiveth), twelfth (not twelveth)
ru: Примечание: fifth (не fiveth), twelfth (не twelveth)
uk: Примітка: fifth (а не fiveth), twelfth (а не twelveth)

source: Tens + ordinal unit
ru: Десятки + порядковая единица
uk: Десятки + порядкова одиниця

source: Hyphenate between tens and unit
ru: Ставьте дефис между десятками и единицей
uk: Використовуйте дефіс між десятками та одиницею

source: Cardinal + ordinal
ru: Количественное + порядковое
uk: Кількісний + порядковий числівник

source: No hyphen after hundred
ru: Нет дефиса после 'hundred' (сотни)
uk: Без дефіса після hundred

source: Special Spelling Cases
ru: Особые случаи написания
uk: Особливі випадки написання

source: 3. Written Forms
ru: 3. Письменные формы
uk: 3. Письмові форми

source: Numerical Representation
ru: Числовое представление
uk: Числове представлення

source: Use last two letters of written word:
ru: Используйте последние две буквы написанного слова:
uk: Використовуйте останні дві літери написаного слова:

source: In dates, always use this form:
ru: В датах всегда используйте эту форму:
uk: У датах завжди використовуйте цю форму:

source: In formal writing, often spelled out:
ru: В формальном письме часто записываются словами:
uk: У формальному письмі часто пишуться словами:

source: When to Spell Out vs. Use Numerals
ru: Когда писать словами, а когда использовать цифры
uk: Коли писати словами, а коли використовувати цифри

source: Spell out in formal writing and at sentence beginnings
ru: Пишите словами в формальном письме и в начале предложения
uk: Пишіть словами у формальному письмі та на початку речень

source: Use numerals in dates, addresses, and footnotes
ru: Используйте цифры в датах, адресах и сносках
uk: Використовуйте цифри у датах, адресах та виносках

source: Use numerals for large ordinals
ru: Используйте цифры для больших порядковых числительных
uk: Використовуйте цифри для великих порядкових числівників

source: 4. Common Usage Patterns
ru: 4. Общие модели использования
uk: 4. Поширені моделі використання

source: Both forms acceptable
ru: Обе формы приемлемы
uk: Обидві форми прийнятні

source: Floors
ru: Этажи
uk: Поверхи

source: American: first floor = ground<br>British: first floor = above ground
ru: Американский: first floor = ground (первый этаж)<br>Британский: first floor = above ground (второй этаж)
uk: Американська: first floor = ground<br>Британська: first floor = над землею

source: Monarchs
ru: Монархи
uk: Монархи

source: Read as 'the Second'
ru: Читается как 'the Second' (Второй)
uk: Читається як 'the Second'

source: School grades
ru: Школьные классы
uk: Шкільні класи

source: US: cardinal for grades<br>UK: ordinal for years
ru: США: количественные для классов<br>Великобритания: порядковые для годов
uk: США: кількісний числівник для класів<br>Велика Британія: порядковий числівник для років

source: Anniversaries
ru: Годовщины
uk: Річниці

source: Special names for milestones
ru: Специальные названия для значимых дат
uk: Спеціальні назви для важливих подій

source: Special Ordinal Terms
ru: Особые порядковые термины
uk: Спеціальні порядкові терміни

source: last in a series
ru: последний в серии
uk: останній у серії

source: second to last
ru: предпоследний
uk: другий з кінця

source: third from last
ru: третий с конца
uk: третій з кінця

source: first in a series
ru: первый в серии
uk: перший у серії

source: Numerals: Other Numerical Data
ru: Числительные: Другие числовые данные
uk: Числівники: Інші числові дані

source: Other Numerical Data
ru: Другие числовые данные
uk: Інші числові дані

source: Numerical Data in Special Contexts
ru: Числовые данные в особых контекстах
uk: Числові дані в особливих контекстах

source: Numbers appear in various specialized formats across different contexts, each with its own reading conventions. Mastering these will help you communicate numerical information clearly and naturally.
ru: Числа появляются в различных специализированных форматах в разных контекстах, каждый из которых имеет свои правила чтения. Освоение этих правил поможет вам четко и естественно передавать числовую информацию.
uk: Числа з'являються в різних спеціалізованих форматах у різних контекстах, кожен з яких має свої власні правила читання. Опанування цих правил допоможе вам чітко та природно передавати числову інформацію.

source: 1. Phone Numbers
ru: 1. Номера телефонов
uk: 1. Номери телефонів

source: Phone numbers follow specific pronunciation patterns that differ by country and context.
ru: Номера телефонов следуют определенным правилам произношения, которые различаются в зависимости от страны и контекста.
uk: Номери телефонів дотримуються специфічних моделей вимови, які відрізняються залежно від країни та контексту.

source: Standard Phone Number Reading
ru: Стандартное чтение номера телефона
uk: Стандартне читання номерів телефонів

source: UK format
ru: Формат Великобритании
uk: Формат Великої Британії

source: Repeated digits:
ru: Повторяющиеся цифры:
uk: Повторювані цифри:

source: Emergency numbers:
ru: Номера экстренных служб:
uk: Екстрені номери:

source: Toll-free numbers:
ru: Бесплатные номера:
uk: Безкоштовні номери:

source: International Phone Number Tips
ru: Советы по международным телефонным номерам
uk: Поради щодо міжнародних номерів телефонів

source: Country codes are read as separate digits: <span class="
uk: Коди країн читаються як окремі цифри: <span class="

source: In business contexts, numbers are often read in groups of 2-3 digits
ru: В деловых контекстах номера часто читаются группами по 2–3 цифры
uk: У ділових контекстах номери часто читаються групами по 2-3 цифри

source: The digit '0' is always read as 'oh' in phone numbers
ru: Цифра '0' всегда читается как 'oh' в номерах телефонов
uk: Цифра '0' завжди читається як 'oh' у номерах телефонів

source: 2. Addresses and Building Numbers
ru: 2. Адреса и номера зданий
uk: 2. Адреси та номери будівель

source: Address numbering follows different conventions depending on the number's size and format.
ru: Нумерация адресов следует разным правилам в зависимости от размера и формата числа.
uk: Нумерація адрес дотримується різних конвенцій залежно від розміру та формату числа.

source: Written
ru: Написано
uk: Письмово

source: Spoken
ru: Произносится
uk: Усно

source: Standard address
ru: Стандартный адрес
uk: Стандартна адреса

source: Hundred format
ru: Формат с сотнями
uk: Формат сотень

source: Zero-containing
ru: Содержащий ноль
uk: Містить нуль

source: Apartment/Unit
ru: Квартира/Блок
uk: Квартира/Одиниця

source: Special Address Formats
ru: Особые форматы адресов
uk: Спеціальні формати адрес

source: Floor numbers:
ru: Номера этажей:
uk: Номери поверхів:

source: Room numbers:
ru: Номера комнат:
uk: Номери кімнат:

source: Building complexes:
ru: Строительные комплексы:
uk: Будівельні комплекси:

source: 3. Financial and Measurement Data
ru: 3. Финансовые данные и данные измерений
uk: 3. Фінансові та вимірювальні дані

source: Monetary Amounts
ru: Денежные суммы
uk: Грошові суми

source: no decimal in Japanese currency
ru: нет десятичных знаков в японской валюте
uk: немає десяткової частини в японській валюті

source: Measurements and Statistics
ru: Измерения и статистика
uk: Вимірювання та статистика

source: 4. Special Numerical Formats
ru: 4. Специальные числовые форматы
uk: 4. Спеціальні числові формати

source: Identification Numbers
ru: Идентификационные номера
uk: Ідентифікаційні номери

source: Credit cards:
uk: Кредитні картки:

source: read in groups of 4 digits
uk: читаються групами по 4 цифри

source: Passport numbers:
uk: Номери паспортів:

source: letters then digits
uk: літери, потім цифри

source: Serial numbers:
uk: Серійні номери:

source: read each character separately
uk: кожен символ читається окремо

source: Technical Codes
ru: Технические коды
uk: Технічні коди

source: IP addresses:
ru: IP-адреса:
uk: IP-адреси:

source: Version numbers:
ru: Номера версий:
uk: Номери версій:

source: Model numbers:
ru: Номера моделей:
uk: Номери моделей:

source: Important General Rules
ru: Важные общие правила
uk: Важливі загальні правила

source: Numbers in codes and identifiers are always read digit by digit
ru: Числа в кодах и идентификаторах всегда читаются по цифрам
uk: Числа в кодах та ідентифікаторах завжди читаються по одній цифрі

source: For decimal points, use 'point' not 'dot' in formal contexts
ru: Для десятичных знаков используйте 'point', а не 'dot' в формальных контекстах
uk: Для десяткових точок використовуйте 'point', а не 'dot' у формальних контекстах

source: In measurements, units can be singular or plural based on the number
ru: В измерениях единицы могут быть в единственном или множественном числе в зависимости от числа
uk: У вимірюваннях одиниці можуть бути в однині або множині залежно від числа

source: For currency, the symbol comes before the number but is read after
ru: Для валюты символ ставится перед числом, но читается после него
uk: Для валюти символ ставиться перед числом, але читається після нього

source: In technical contexts, confirm the preferred reading format
ru: В технических контекстах уточните предпочтительный формат чтения
uk: У технічних контекстах уточніть бажаний формат читання

source: Numerical Data Reading Guide
ru: Руководство по чтению числовых данных
uk: Посібник із читання числових даних

source: Written Form
ru: Письменная форма
uk: Письмова форма

source: Spoken Form
ru: Произносимая форма
uk: Усна форма

source: International phone
ru: Международный телефон
uk: Міжнародний телефон

source: Bank account
ru: Банковский счет
uk: Банківський рахунок

source: Reading Mixed Numbers
ru: Чтение смешанных чисел
uk: Читання мішаних чисел

source: Mixed numbers combine whole numbers with fractions, requiring specific reading conventions. Mastering these patterns is essential for clear communication in mathematics, cooking, construction, and other practical fields.
ru: Смешанные числа сочетают целые числа с дробями, требуя особых правил чтения. Освоение этих правил необходимо для четкого общения в математике, кулинарии, строительстве и других практических областях.
uk: Мішані числа поєднують цілі числа з дробами, що вимагає специфічних правил читання. Опанування цих закономірностей є важливим для чіткого спілкування в математиці, кулінарії, будівництві та інших практичних сферах.

source: 1. Fundamental Reading Rules
ru: 1. Основные правила чтения
uk: 1. Основні правила читання

source: Standard Format
ru: Стандартный формат
uk: Стандартний формат

source: Read the whole number first
ru: Сначала прочитайте целое число
uk: Спочатку прочитайте ціле число

source: Say '<span class="
uk: Скажіть '<span class="

source: Read the fraction following simple fraction rules
ru: Прочитайте дробь, следуя правилам простых дробей
uk: Прочитайте дріб, дотримуючись правил читання простих дробів

source: For halves/quarters, use special terms when available
ru: Для половин/четвертей используйте специальные термины, если они доступны
uk: Для половин/чвертей використовуйте спеціальні терміни, якщо вони доступні

source: Special term for half
ru: Специальный термин для половины
uk: Спеціальний термін для половини

source: Quarter preferred over fourth
ru: Предпочтительнее 'quarter' (четверть), чем 'fourth' (четвертая)
uk: Quarter краще, ніж fourth

source: Regular fraction form
ru: Обычная форма дроби
uk: Звичайна дробова форма

source: Hyphen optional
ru: Дефис необязателен
uk: Дефіс необов'язковий

source: 2. Practical Applications
ru: 2. Практическое применение
uk: 2. Практичне застосування

source: Common Usage Contexts
ru: Общие контексты использования
uk: Поширені контексти використання

source: Reading
ru: Чтение
uk: Читання

source: Variations
ru: Вариации
uk: Варіації

source: Cooking/Recipes
ru: Кулинария/Рецепты
uk: Кулінарія/Рецепти

source: also acceptable
ru: также приемлемо
uk: також прийнятно

source: Construction
ru: Строительство
uk: Будівництво

source: No 's' on quarter
ru: Нет 's' на 'quarter'
uk: Немає 's' на quarter

source: alternative
ru: альтернатива
uk: альтернатива

source: Sports
ru: Спорт
uk: Спорт

source: Formal reporting only
ru: Только для официальных отчетов
uk: Тільки для офіційних звітів

source: Written vs. Spoken Forms
ru: Письменные и устные формы
uk: Письмові vs. усні форми

source: Written with space:
ru: Пишется с пробелом:
uk: Написано з пробілом:

source: Written with special characters:
ru: Пишется со специальными символами:
uk: Написано зі спеціальними символами:

source: Spoken contractions:
ru: Разговорные сокращения:
uk: Вимовляються скорочення:

source: When 'and' is Omitted
ru: Когда 'and' опускается
uk: Коли 'and' опускається

source: In some British English traditions:
ru: В некоторых традициях британского английского:
uk: У деяких традиціях британської англійської:

source: In rapid speech, 'and' may be reduced:
ru: В быстрой речи 'and' может быть сокращено:
uk: У швидкій мові 'and' може бути скорочено:

source: Never omitted in formal writing or American English
ru: Никогда не опускается в официальном письме или американском английском
uk: Ніколи не опускається у формальному письмі чи американській англійській

source: Decimal vs. Fractional Mixed Numbers
ru: Десятичные vs. Дробные смешанные числа
uk: Десяткові vs. дробові мішані числа

source: Decimals use 'point', not 'and':
ru: Десятичные дроби используют 'point' (точка), а не 'and' (и):
uk: Десяткові числа використовують 'point', а не 'and':

source: Place value method uses 'and':
ru: Метод разряда использует 'and' (и):
uk: Метод розряду використовує 'and':

source: Mistake
ru: Ошибка
uk: Помилка

source: Correction
ru: Исправление
uk: Виправлення

source: Use 'and', not 'an'
ru: Используйте 'and' (и), а не 'an'
uk: Використовуйте 'and', а не 'an'

source: Include article 'a'
ru: Включите артикль 'a'
uk: Включіть артикль 'a'

source: Pluralize denominator
ru: Оформите знаменатель во множественном числе
uk: Зробіть знаменник у множині

source: Special term for 1/2
ru: Специальный термин для 1/2
uk: Спеціальний термін для 1/2

source: Numerals: Reading Years and Dates
ru: Числительные: Чтение годов и дат
uk: Числівники: Читання років та дат

source: Reading Years and Dates
ru: Чтение годов и дат
uk: Читання років та дат

source: Reading Years and Dates in English
ru: Чтение годов и дат в английском языке
uk: Читання років та дат в англійській мові

source: Understanding how to properly read years and dates is essential for clear communication in English. This guide covers all the conventions and special cases you need to know.
ru: Понимание того, как правильно читать годы и даты, имеет важное значение для четкого общения на английском языке. Это руководство охватывает все конвенции и особые случаи, которые вам необходимо знать.
uk: Розуміння того, як правильно читати роки та дати, є важливим для чіткого спілкування англійською мовою. Цей посібник охоплює всі конвенції та особливі випадки, які вам потрібно знати.

source: 1. Reading Years
ru: 1. Чтение годов
uk: 1. Читання років

source: English has specific patterns for reading years that vary depending on the century and digit configuration.
ru: В английском языке существуют определенные шаблоны для чтения годов, которые различаются в зависимости от века и конфигурации цифр.
uk: В англійській мові існують специфічні моделі для читання років, які варіюються залежно від століття та конфігурації цифр.

source: Four-Digit Years
ru: Четырехзначные годы
uk: Чотиризначні роки

source: Most four-digit years are read as two two-digit numbers:
ru: Большинство четырехзначных годов читаются как два двузначных числа:
uk: Більшість чотиризначних років читаються як два двозначні числа:

source: Battle of Hastings
ru: Битва при Гастингсе
uk: Битва при Гастінгсі

source: 21st Century Years
ru: Годы 21-го века
uk: Роки 21-го століття

source: Years from 2000-2099 have two common reading patterns:
ru: Годы с 2000 по 2099 имеют два распространенных шаблона чтения:
uk: Роки з 2000 по 2099 мають дві поширені моделі читання:

source: more common
ru: более распространенный
uk: більш поширений

source: Special Year Cases
ru: Особые случаи годов
uk: Особливі випадки років

source: Years ending in 00:
ru: Годы, оканчивающиеся на 00:
uk: Роки, що закінчуються на 00:

source: The year 2000:
ru: Год 2000:
uk: Рік 2000:

source: Years before 1000:
ru: Годы до 1000:
uk: Роки до 1000:

source: 2. Reading Full Dates
ru: 2. Чтение полных дат
uk: 2. Читання повних дат

source: Date formats differ between American and British English, affecting how they're read aloud.
ru: Форматы дат различаются между американским и британским английским, что влияет на то, как они читаются вслух.
uk: Формати дат відрізняються між американською та британською англійською, що впливає на те, як вони читаються вголос.

source: Format
ru: Формат
uk: Формат

source: American English (Month-Day-Year)
ru: Американский английский (Месяц-День-Год)
uk: Американська англійська (Місяць-День-Рік)

source: British English (Day-Month-Year)
ru: Британский английский (День-Месяц-Год)
uk: Британська англійська (День-Місяць-Рік)

source: Ordinal Numbers in Dates
ru: Порядковые числительные в датах
uk: Порядкові числівники у датах

source: Days are always read as ordinal numbers, even when written as cardinals:
ru: Дни всегда читаются как порядковые числительные, даже если они написаны количественными:
uk: Дні завжди читаються як порядкові числівники, навіть якщо вони написані як кількісні:

source: not \
uk: не \

source: 3. Special Date Formats
ru: 3. Особые форматы дат
uk: 3. Спеціальні формати дат

source: Decades
ru: Десятилетия
uk: Десятиліття

source: Decades are typically referred to in these patterns:
ru: Десятилетия обычно упоминаются в следующих формах:
uk: Десятиліття зазвичай позначаються за такими моделями:

source: Centuries
ru: Века
uk: Століття

source: Centuries are ordinal numbers one higher than the year's first digits:
ru: Века — это порядковые числительные, на единицу больше первых цифр года:
uk: Століття — це порядкові числівники, на одиницю більші, ніж перші цифри року:

source: Historical Events
ru: Исторические события
uk: Історичні події

source: Some historical events have special names:
ru: Некоторые исторические события имеют специальные названия:
uk: Деякі історичні події мають спеціальні назви:

source: September 11 attacks
ru: Атаки 11 сентября
uk: Теракти 11 вересня

source: London bombings
ru: Лондонские взрывы
uk: Лондонські теракти

source: Never use \
uk: Ніколи не використовуйте \

source: For years 2001-2009, \
uk: Для років 2001-2009, \

source: In formal writing, always write dates with the year: <span class="
uk: У формальному письмі завжди пишіть дати з роком: <span class="

source: When writing dates numerically, remember the format differences: <span class="
uk: Коли пишете дати цифрами, пам’ятайте про відмінності у форматі: <span class="

source: Common Date Reading Patterns
ru: Общие шаблоны чтения дат
uk: Поширені моделі читання дат

source: Full Date (US)
ru: Полная дата (США)
uk: Повна дата (США)

source: Full Date (UK)
ru: Полная дата (Великобритания)
uk: Повна дата (ВК)

source: Year Only
ru: Только год
uk: Тільки рік

source: Decade
ru: Десятилетие
uk: Десятиліття

source: Numerals: Simple Fractions
ru: Числительные: Простые дроби
uk: Числівники: Прості дроби

source: Simple Fractions (Common Fractions)
ru: Простые дроби (Обыкновенные дроби)
uk: Прості дроби (звичайні дроби)

source: Simple fractions represent parts of a whole and are essential for precise communication in mathematics, measurements, and everyday situations. Mastering their correct usage improves both written and spoken English.
ru: Простые дроби представляют части целого и необходимы для точного общения в математике, измерениях и повседневных ситуациях. Освоение их правильного использования улучшает как письменный, так и устный английский.
uk: Прості дроби представляють частини цілого і є важливими для точного спілкування в математиці, вимірюваннях та повсякденних ситуаціях. Опанування їх правильного використання покращує як письмову, так і розмовну англійську мову.

source: 1. Formation and Reading Rules
ru: 1. Правила образования и чтения
uk: 1. Правила утворення та читання

source: Basic Structure
ru: Базовая структура
uk: Базова структура

source: Special cases:
ru: Особые случаи:
uk: Особливі випадки:

source: not second
ru: не second (второй)
uk: не second

source: common alternative to fourth
ru: распространенная альтернатива fourth (четвертой)
uk: поширена альтернатива fourth

source: Fraction
ru: Дробь
uk: Дріб

source: Rule Applied
ru: Примененное правило
uk: Застосоване правило

source: Special case (never \
uk: Особливий випадок (ніколи не \

source: Standard formation
ru: Стандартное образование
uk: Стандартне утворення

source: Plural denominator
ru: Знаменатель во множественном числе
uk: Знаменник у множині

source: Alternative forms
ru: Альтернативные формы
uk: Альтернативні форми

source: Plural alternatives
ru: Альтернативы во множественном числе
uk: Альтернативи у множині

source: Irregular plural
ru: Нерегулярное множественное число
uk: Нерегулярна множина

source: 2. Special Fraction Forms
ru: 2. Особые формы дробей
uk: 2. Спеціальні форми дробів

source: Common Fraction Names
ru: Общие названия дробей
uk: Поширені назви дробів
