Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: In the second example, the pronoun <span class="text-primary">her</span> replaces the antecedent <span class="text-success">Mary</span>, making the sentence sound more natural and concise.
ru: Во втором примере местоимение <span class="text-primary">her</span> заменяет антецедент <span class="text-success">Mary</span>, делая предложение более естественным и лаконичным.

source: Distance and Number
ru: Расстояние и число

source: This: used for a singular noun that is near.
ru: This: используется для существительного в единственном числе, которое находится близко.

source: That: used for a singular noun that is far.
ru: That: используется для существительного в единственном числе, которое находится далеко.

source: These: used for plural nouns that are near.
ru: These: используется для существительных во множественном числе, которые находятся близко.

source: Those: used for plural nouns that are far.
ru: Those: используется для существительных во множественном числе, которые находятся далеко.

source: In the first example, <span class="text-primary">That</span> replaces the noun <span class="text-success">car</span>, so it is a pronoun. In the second, it describes <span class="text-success">car</span>, so it is an adjective.
ru: В первом примере <span class="text-primary">That</span> заменяет существительное <span class="text-success">car</span>, поэтому это местоимение. Во втором оно описывает <span class="text-success">car</span>, поэтому это прилагательное.

source: Subjective Case: Used when the pronoun is the subject of the sentence (the one performing the action).
ru: Субъектный падеж: Используется, когда местоимение является подлежащим предложения (тот, кто выполняет действие).

source: Objective Case: Used when the pronoun is the object of the sentence (the one receiving the action).
ru: Объектный падеж: Используется, когда местоимение является дополнением предложения (тот, кто получает действие).

source: First Person: The speaker (I, we).
ru: Первое лицо: Говорящий (I, we).

source: Second Person: The person or people being spoken to (you).
ru: Второе лицо: Человек или люди, к которым обращаются (you).

source: Third Person: The person or thing being spoken about (he, she, it, they).
ru: Третье лицо: Человек или вещь, о которых говорят (he, she, it, they).

source: He, him, his: Masculine gender.
ru: He, him, his: Мужской род.

source: She, her, hers: Feminine gender.
ru: She, her, hers: Женский род.

source: It, its: Neutral or inanimate objects.
ru: It, its: Нейтральные или неодушевленные предметы.

source: The most common function is as the subject, the noun or pronoun that performs the action of the verb. In this role, a pronoun must be in the subjective case (e.g., <span class="text-success">I, he, she, they</span>).
ru: Самая распространенная функция — это подлежащее, существительное или местоимение, которое выполняет действие глагола. В этой роли местоимение должно быть в субъектном падеже (например, <span class="text-success">I, he, she, they</span>).

source: In these examples, <span class="text-primary">She</span> and <span class="text-primary">They</span> are the subjects performing the actions.
ru: В этих примерах <span class="text-primary">She</span> (Она) и <span class="text-primary">They</span> (Они) являются подлежащими, выполняющими действия.

source: A pronoun can also be the direct object, receiving the action of the verb. In this case, it must be in the objective case (e.g., <span class="text-success">me, him, her, them</span>).
ru: Местоимение также может быть прямым дополнением, принимающим действие глагола. В этом случае оно должно быть в объектном падеже (например, <span class="text-success">me, him, her, them</span>).

source: Here, <span class="text-primary">him</span> and <span class="text-primary">us</span> are the direct objects receiving the action (saw and helped).
ru: Здесь <span class="text-primary">him</span> (его) и <span class="text-primary">us</span> (нам/нас) являются прямыми дополнениями, принимающими действие (saw и helped).

source: Pronouns that follow prepositions (e.g., <span class="text-success">to, for, with, about</span>) must also be in the objective case.
ru: Местоимения, следующие за предлогами (например, <span class="text-success">to, for, with, about</span>), также должны быть в объектном падеже.

source: A subject complement follows a linking verb (e.g., <span class="text-success">is, was, seems, becomes</span>) and renames or describes the subject. It is best to use the subjective case here.
ru: Именная часть составного сказуемого следует за глаголом-связкой (например, <span class="text-success">is, was, seems, becomes</span>) и переименовывает или описывает подлежащее. Здесь лучше всего использовать субъектный падеж.

source: Meaning/Reference
ru: Значение/Ссылка

source: Most indefinite pronouns that end in <span class="text-success">-one</span>, <span class="text-success">-body</span>, or <span class="text-success">-thing</span> are always singular and therefore require a singular verb.
ru: Большинство неопределенных местоимений, оканчивающихся на <span class="text-success">-one</span>, <span class="text-success">-body</span> или <span class="text-success">-thing</span>, всегда находятся в единственном числе и, следовательно, требуют глагола в единственном числе.

source: Pronouns like <span class="text-success">both</span>, <span class="text-success">few</span>, <span class="text-success">many</span>, and <span class="text-success">several</span> are always plural and require a plural verb.
ru: Местоимения, такие как <span class="text-success">both</span> (оба), <span class="text-success">few</span> (немногие), <span class="text-success">many</span> (многие) и <span class="text-success">several</span> (несколько), всегда во множественном числе и требуют глагола во множественном числе.

source: Interrogative and relative pronouns are two distinct types of pronouns that often use the same words (e.g., <span class="text-primary">who</span>, <span class="text-primary">which</span>, <span class="text-primary">what</span>). Understanding their function in a sentence is key to telling them apart.
ru: Вопросительные и относительные местоимения — это два разных типа местоимений, которые часто используют одни и те же слова (например, <span class="text-primary">who</span>, <span class="text-primary">which</span>, <span class="text-primary">what</span>). Понимание их функции в предложении является ключом к их различению.

source: Who: Refers to a person (subject).
ru: Who: Относится к человеку (подлежащее).

source: Whom: Refers to a person (object).
ru: Whom: Относится к человеку (дополнение).

source: Whose: Asks about possession.
ru: Whose: Спрашивает о принадлежности.

source: Which: Refers to a choice between a limited number of things or people.
ru: Which: Относится к выбору между ограниченным числом вещей или людей.

source: What: Refers to things or ideas in a general sense.
ru: What: Относится к вещам или идеям в общем смысле.

source: Who/Whom/Whose: Refer to people.
ru: Who/Whom/Whose: Относятся к людям.

source: Which: Refers to things or animals.
ru: Which: Относится к вещам или животным.

source: That: Can refer to people, things, or animals.
ru: That: Может относиться к людям, вещам или животным.

source: If the pronoun is asking a question, it's <span class="text-primary">interrogative</span>.
ru: Если местоимение задает вопрос, оно <span class="text-primary">вопросительное</span>.

source: If the pronoun is connecting a clause and referring to a noun, it's <span class="text-primary">relative</span>.
ru: Если местоимение связывает придаточное предложение и относится к существительному, оно <span class="text-primary">относительное</span>.

source: Personal pronouns refer to the speaker, the person being spoken to, or the person/thing being spoken about. They have two cases: <span class="text-success">Subjective</span> (used as the subject) and <span class="text-success">Objective</span> (used as the object).
ru: Личные местоимения относятся к говорящему, человеку, к которому обращаются, или человеку/вещи, о которых говорят. У них есть два падежа: <span class="text-success">Субъектный</span> (используется как подлежащее) и <span class="text-success">Объектный</span> (используется как дополнение).

source: Possessive pronouns show ownership and stand alone as a noun. They are different from possessive adjectives (e.g., <span class="text-success">my</span>, <span class="text-success">your</span>), which modify a noun.
ru: Притяжательные местоимения показывают принадлежность и выступают в предложении как существительное. Они отличаются от притяжательных прилагательных (например, <span class="text-success">my</span>, <span class="text-success">your</span>), которые определяют существительное.

source: Note that <span class="text-success">it's</span> is a contraction of <span class="text-primary">it is</span> or <span class="text-primary">it has</span> and is NOT the possessive form. The possessive form of <span class="text-success">it</span> is <span class="text-primary">its</span> (no apostrophe).
ru: Обратите внимание, что <span class="text-success">it's</span> — это сокращение от <span class="text-primary">it is</span> (это есть) или <span class="text-primary">it has</span> (это имеет) и НЕ является притяжательной формой. Притяжательная форма <span class="text-success">it</span> — это <span class="text-primary">its</span> (без апострофа).

source: Pronoun-antecedent agreement is a fundamental rule in English grammar. It means that a pronoun must agree with the noun or noun phrase it refers to (its <span class="text-success">antecedent</span>) in number (singular/plural) and gender (masculine/feminine/neuter).
ru: Согласование местоимения с антецедентом — фундаментальное правило в английской грамматике. Оно означает, что местоимение должно согласовываться с существительным или именной фразой, к которой оно относится (своим <span class="text-success">антецедентом</span>), в числе (единственное/множественное) и роде (мужской/женский/средний).

source: This is a common source of confusion. Many indefinite pronouns (e.g., <span class="text-success">everyone, nobody, everything</span>) are grammatically singular, even though they imply many people or things, and thus require singular pronouns (he, she, it).
ru: Это распространенный источник путаницы. Многие неопределенные местоимения (например, <span class="text-success">everyone, nobody, everything</span>) грамматически единственного числа, хотя подразумевают много людей или вещей, и, следовательно, требуют местоимений в единственном числе (he, she, it).

source: Using <span class="text-success">they/their</span> with singular indefinite pronouns (e.g., <span class="text-primary">Everyone took **their** seat</span>) is increasingly common in modern, informal English to avoid gender bias, but should be avoided in formal writing.
ru: Использование <span class="text-success">they/their</span> с неопределенными местоимениями в единственном числе (например, <span class="text-primary">Everyone took **their** seat</span> — Каждый занял **свое** место) становится все более распространенным в современном, неформальном английском, чтобы избежать гендерной предвзятости, но его следует избегать в формальном письме.

source: A collective noun (e.g., <span class="text-success">team, family, committee</span>) is usually treated as singular if the group acts as a single unit, and plural if the individuals in the group act separately.
ru: Собирательное существительное (например, <span class="text-success">team, family, committee</span>) обычно рассматривается как единственное число, если группа действует как единое целое, и как множественное, если отдельные лица в группе действуют по отдельности.

source: A reflexive pronoun is used as a direct or indirect object when the object is the same person or thing as the subject of the verb. It 'reflects' the action back to the subject. They are formed by adding <span class="text-success">-self</span> (singular) or <span class="text-success">-selves</span> (plural) to a personal or possessive pronoun.
ru: Возвратное местоимение используется в качестве прямого или косвенного дополнения, когда дополнение является тем же лицом или вещью, что и подлежащее глагола. Оно 'отражает' действие обратно на подлежащее. Они образуются путем добавления <span class="text-success">-self</span> (единственное число) или <span class="text-success">-selves</span> (множественное число) к личному или притяжательному местоимению.

source: <strong>Example:</strong> <span class="text-primary">She taught herself to code.</span>
ru: <strong>Пример:</strong> <span class="text-primary">She taught herself to code (Она научила себя программировать).</span>

source: In this sentence, <span class="text-primary">herself</span> is the direct object and refers back to the subject <span class="text-success">She</span>.
ru: В этом предложении <span class="text-primary">herself</span> является прямым дополнением и отсылает обратно к подлежащему <span class="text-success">She</span>.

source: A common error is using intensive pronouns in place of personal pronouns, for example, <strike>My friend and myself went to the store.</strike> The correct form is <span class="text-success">My friend and I went to the store.</span>
ru: Распространенная ошибка — использование усилительных местоимений вместо личных местоимений, например, <strike>My friend and myself went to the store</strike> (Мой друг и я сам пошли в магазин). Правильная форма: <span class="text-success">My friend and I went to the store</span> (Мой друг и я пошли в магазин).

source: Each other: Used for two people or things.
ru: Each other: Используется для двух людей или вещей.

source: One another: Used for more than two people or things.
ru: One another: Используется для более чем двух людей или вещей.

source: A contraction is a shortened form of one or two words, where letters have been omitted and replaced by an apostrophe (<span class="text-primary">’</span>). Contractions are primarily used to simplify spoken language and non-formal writing.
ru: Сокращение — это укороченная форма одного или двух слов, в которой пропущенные буквы заменены апострофом (<span class="text-primary">’</span>). Сокращения используются в основном для упрощения устной речи и неформального письма.

source: Contraction
ru: Сокращение

source: Use contractions when:
ru: Используйте сокращения, когда:

source: Avoid contractions when:
ru: Избегайте сокращений, когда:

source: Informal Writing (emails, social media, notes)
ru: Неформальное письмо (электронные письма, социальные сети, заметки)

source: Formal Writing (academic papers, legal documents, professional reports)
ru: Формальное письмо (академические работы, юридические документы, профессиональные отчеты)

source: Dialogue (to represent natural speech)
ru: Диалог (для воспроизведения естественной речи)

source: The apostrophe (<span class="text-primary">’</span>) is used with a noun to indicate ownership or possession. This is distinct from its use in contractions.
ru: Апостроф (<span class="text-primary">’</span>) используется с существительным для обозначения владения или принадлежности. Это отличается от его использования в сокращениях.

source: Compound/Joint Possession
ru: Сложное/Совместное владение

source: When two or more people share ownership, add 's only to the last owner:
ru: Когда два или более человека делят право собственности, добавьте 's только к последнему владельцу:

source: Individual Possession
ru: Индивидуальное владение

source: When items are owned separately, add 's to each owner:
ru: Когда предметы принадлежат отдельно, добавьте 's к каждому владельцу:

source: Generally, treat singular proper nouns ending in 's' the same as other singular nouns (e.g., <span class="text-primary">James’s car</span>). However, some style guides prefer just the apostrophe (e.g., <span class="text-primary">James' car</span>).
ru: Обычно единственные имена собственные, оканчивающиеся на 's', обрабатываются так же, как и другие существительные в единственном числе (например, <span class="text-primary">James’s car</span>). Однако некоторые стилевые руководства предпочитают только апостроф (например, <span class="text-primary">James' car</span>).

source: Treat time periods as possessors (e.g., <span class="text-primary">a week’s pay</span>, <span class="text-primary">ten years’ experience</span>).
ru: Рассматривайте периоды времени как владельцев (например, <span class="text-primary">a week’s pay</span> — зарплата за неделю, <span class="text-primary">ten years’ experience</span> — десятилетний опыт).

source: <span class="term-highlight">Its vs. It's:</span> <span class="text-primary">Its</span> shows possession (The dog chased <span class="text-primary">its</span> tail). <span class="text-primary">It's</span> is a contraction for <span class="text-primary">it is</span>.
ru: <span class="term-highlight">Its vs. It's:</span> <span class="text-primary">Its</span> показывает принадлежность (The dog chased <span class="text-primary">its</span> tail). <span class="text-primary">It's</span> — это сокращение от <span class="text-primary">it is</span>.

source: <span class="term-highlight">Plural Nouns:</span> Don't use an apostrophe to make a noun plural. The plural of <span class="text-primary">apple</span> is <span class="text-primary">apples</span>, not <span class="text-primary">apple's</span>.
ru: <span class="term-highlight">Существительные во множественном числе:</span> Не используйте апостроф для образования множественного числа существительного. Множественное число от <span class="text-primary">apple</span> — это <span class="text-primary">apples</span>, а не <span class="text-primary">apple's</span>.

source: <span class="term-highlight">Pronouns:</span> Possessive pronouns (yours, hers, theirs) don't use an apostrophe.
ru: <span class="term-highlight">Местоимения:</span> Притяжательные местоимения (yours, hers, theirs) не используют апостроф.

source: Square brackets [ ] are primarily used in formal writing, especially when quoting, to enclose material added by someone other than the original author.
ru: Квадратные скобки [ ] в основном используются в формальном письме, особенно при цитировании, для заключения материала, добавленного кем-то, кроме первоначального автора.

source: The colon (<span class="text-primary">:</span>) is a punctuation mark used to introduce, explain, or elaborate on the preceding statement.
ru: Двоеточие (<span class="text-primary">:</span>) — это знак препинания, используемый для введения, объяснения или детализации предшествующего утверждения.

source: Informal, dramatic introduction of explanation
ru: Неформальное, драматическое представление объяснения

source: <span class="term-highlight">Lists:</span> Don't use a colon after an incomplete sentence or a verb/preposition introducing the list
ru: <span class="term-highlight">Списки:</span> Не используйте двоеточие после неполного предложения или глагола/предлога, вводящего список

source: A colon can effectively link two independent clauses when the second clause functions to explain, illustrate, or expand upon the first.
ru: Двоеточие может эффективно связывать два независимых предложения, когда второе предложение служит для объяснения, иллюстрации или развития первого.

source: <span class="term-highlight">No colon:</span> Don't use a colon after an incomplete sentence or if the second clause doesn't directly explain the first
ru: <span class="term-highlight">Без двоеточия:</span> Не используйте двоеточие после неполного предложения или если второе предложение напрямую не объясняет первое

source: 3. Comma with Dependent Clauses
ru: 3. Запятая с зависимыми предложениями

source: Oxford Comma
ru: Оксфордская запятая

source: No Oxford Comma
ru: Без оксфордской запятой

source: Commas play a crucial role in setting off information that adds extra details to a sentence but isn't necessary for its core meaning. This is called <span class="term-highlight">non-essential</span> or <span class="term-highlight">non-restrictive</span> information.
ru: Запятые играют ключевую роль в выделении информации, которая добавляет дополнительные детали к предложению, но не является необходимой для его основного смысла. Это называется <span class="term-highlight">несущественной</span> или <span class="term-highlight">неограничительной</span> информацией.

source: The information is <span class="term-highlight">additional detail</span>, not required for identification.
ru: Информация является <span class="term-highlight">дополнительной деталью</span>, не требуемой для идентификации.

source: The clause often begins with <span class="term-highlight">which</span>, <span class="term-highlight">who</span>, or <span class="term-highlight">whose</span>.
ru: Придаточное предложение часто начинается с <span class="term-highlight">which</span>, <span class="term-highlight">who</span> или <span class="term-highlight">whose</span>.

source: I am
ru: Я есть

source: Focuses on the <b>completion of an action before a specific future point.</b>
ru: Сосредоточен на <b>завершении действия до определенного момента в будущем.</b>

source: Describes an action that will be <b>in progress</b> at a specific future point.
ru: Описывает действие, которое будет <b>в процессе</b> в определенный момент в будущем.

source: Emphasizes the <b>duration</b> or the <b>process</b> of an activity leading up to a future point.
ru: Подчеркивает <b>длительность</b> или <b>процесс</b> деятельности, ведущий к будущему моменту.

source: Focus on the <i>process</i> and <i>length</i> of studying.
ru: Акцент на <i>процессе</i> и <i>продолжительности</i> обучения.

source: Emphasizes the <b>completion</b> of an action before a future point or the <i>result</i> of the action.
ru: Подчеркивает <b>завершение</b> действия до будущего момента или <i>результат</i> действия.

source: Focus on the <i>completion</i> of learning French.
ru: Акцент на <i>завершении</i> изучения французского.

source: Describes an action that will be <b>in progress</b> at a specific future moment.
ru: Описывает действие, которое будет <b>в процессе</b> в определенный момент в будущем.

source: Plans or intentions decided <i>before</i> the moment of speaking.
ru: Планы или намерения, решенные <i>до</i> момента речи.

source: Predictions based on <b>strong present evidence</b>.
ru: Предсказания, основанные на <b>веских доказательствах в настоящем</b>.

source: The <b>Imperative Mood</b> is used to give <b>commands, instructions, requests, advice, or express prohibitions</b>. It's the mood you use when you want someone to <i>do</i> something.
ru: <b>Повелительное наклонение (Imperative Mood)</b> используется для выражения <b>команд, инструкций, просьб, советов или запретов</b>. Это наклонение, которое вы используете, когда хотите, чтобы кто-то что-то <i>сделал</i>.

source: May / Might
ru: May / Might (Мочь, иметь возможность)

source: Must / Have to
ru: Must / Have to (Должен, необходимо)

source: Need
ru: Need (Нуждаться, быть должным)

source: Ought to
ru: Ought to (Следует, должно)

source: This past form is used to express that something was expected or desirable in the past but did not happen. It often implies **regret, criticism, or disappointment**.
ru: Эта форма прошедшего времени используется для выражения того, что что-то ожидалось или было желательно в прошлом, но не произошло. Она часто подразумевает **сожаление, критику или разочарование**.

source: Shall / Will
ru: Shall / Will (Должен, буду)

source: Should
ru: Should (Следует, должен)

source: Used to
ru: Used to (Раньше)

source: Would
ru: Would (Бы, хотел бы)

source: Past Perfect Simple:
ru: Past Perfect Simple (Прошедшее совершенное):

source: Log in
ru: Войти
