Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: It indicates that an action will be ongoing or incomplete at a particular future moment.
ru: Оно указывает, что действие будет продолжаться или будет незавершенным в определенный будущий момент.
uk: Він вказує, що дія буде тривалою або незавершеною в певний момент у майбутньому.

source: At 10 AM, the working will be in progress.
ru: В 10 утра работа будет продолжаться.
uk: О 10 ранку робота буде в процесі виконання.

source: Parallel Actions in the Future:
ru: Параллельные действия в будущем:
uk: Паралельні дії в майбутньому:

source: Two or more actions that will be happening simultaneously in the future.
ru: Два или более действий, которые будут происходить одновременно в будущем.
uk: Дві або більше дії, які відбуватимуться одночасно в майбутньому.

source: Future Actions that are Part of a Routine or Expected Course of Events:
ru: Будущие действия, которые являются частью рутины или ожидаемого хода событий:
uk: Майбутніх дій, які є частиною рутини або очікуваного ходу подій:

source: Actions that are planned or expected to happen regularly.
ru: Действия, которые запланированы или, как ожидается, будут происходить регулярно.
uk: Дії, які заплановані або очікується, що відбудуться регулярно.

source: It's a scheduled event.
ru: Это запланированное событие.
uk: Це запланована подія.

source: To Ask Politely about Someone's Plans:
ru: Чтобы вежливо спросить о чьих-либо планах:
uk: Для ввічливого запитання про чиїсь плани:

source: Often used to inquire about someone's future plans without sounding demanding.
ru: Часто используется, чтобы узнать о чьих-либо будущих планах, не звуча при этом требовательно.
uk: Часто використовується для запиту про чиїсь майбутні плани, не виглядаючи вимогливим.

source: Asking if the car is free for use.
ru: Спрашиваем, свободна ли машина для использования.
uk: Запитуємо, чи вільна машина для використання.

source: Polite invitation.
ru: Вежливое приглашение.
uk: Ввічливе запрошення.

source: Actions Interrupted by Another Action in the Future:
ru: Действия, прерванные другим действием в будущем:
uk: Дій, перерваних іншою дією в майбутньому:

source: A longer action in the future continuous is interrupted by a shorter action in the future simple (or present simple if it's a time clause).
ru: Более длительное действие в Future Continuous прерывается более коротким действием в Future Simple (или Present Simple, если это временное придаточное предложение).
uk: Довша дія в Future Continuous переривається коротшою дією в Future Simple (або Present Simple, якщо це підрядне речення часу).

source: Future Continuous vs. Future Simple vs. \
uk: Future Continuous (Майбутній тривалий) vs. Future Simple (Майбутній простий) vs. \

source: The main difference lies in the emphasis:
ru: Основное различие заключается в акценте:
uk: Основна відмінність полягає в акценті:

source: Future Continuous:
uk: Future Continuous (Майбутній тривалий):

source: Focuses on an action <b>in progress</b> at a specific future time. It describes what will be happening.
ru: Сосредоточен на действии, <b>находящемся в процессе</b> в определенное будущее время. Оно описывает то, что будет происходить.
uk: Фокусується на дії, що перебуває **в процесі** у певний момент у майбутньому. Описує, що саме відбуватиметься.

source: The act of eating will be ongoing.
ru: Процесс еды будет продолжаться.
uk: Процес поїдання буде тривалим.

source: Used for spontaneous decisions, predictions (opinion-based), promises, and future facts. It often describes a single, complete action.
ru: Используется для спонтанных решений, предсказаний (основанных на мнении), обещаний и будущих фактов. Оно часто описывает одно, завершенное действие.
uk: Використовується для спонтанних рішень, прогнозів (заснованих на думці), обіцянок і майбутніх фактів. Часто описує єдину, завершену дію.

source: A simple statement of future action.
ru: Простое утверждение о будущем действии.
uk: Просте твердження про майбутню дію.

source: Used for pre-planned intentions or predictions based on current evidence.
ru: Используется для заранее спланированных намерений или предсказаний, основанных на текущих доказательствах.
uk: Використовується для заздалегідь запланованих намірів або прогнозів, що ґрунтуються на поточних доказах.

source: This is my plan/intention.
ru: Это мой план/намерение.
uk: Це мій план/намір.

source: The Future Continuous adds a layer of detail to future events, emphasizing their ongoing nature and context.
ru: Future Continuous добавляет уровень детализации к будущим событиям, подчеркивая их продолжительный характер и контекст.
uk: Future Continuous додає шар деталізації до майбутніх подій, підкреслюючи їх тривалий характер і контекст.

source: The Future Perfect
ru: Будущее совершенное время (Future Perfect)
uk: Майбутній доконаний час (Future Perfect)

source: Formation of the Future Perfect
ru: Образование Future Perfect
uk: Утворення Майбутнього доконаного часу (Future Perfect)

source: The Future Perfect is formed using the auxiliary verbs <span class=\
ru: Future Perfect образуется с помощью вспомогательных глаголов <span class=\
uk: Майбутній доконаний час утворюється за допомогою допоміжних дієслів <span class=\

source: Past Participle V3
ru: Причастие прошедшего времени V3
uk: Дієприкметник минулого часу V3

source: Uses of the Future Perfect
ru: Использование Future Perfect
uk: Використання Майбутнього доконаного часу (Future Perfect)

source: The Future Perfect is primarily used for:
ru: Future Perfect в основном используется для:
uk: Future Perfect головним чином використовується для:

source: Actions that Will Be Completed Before a Specific Time or Another Action in the Future:
ru: Действия, которые будут завершены до определенного времени или другого действия в будущем:
uk: Дій, які будуть завершені до певного часу або іншої дії в майбутньому:

source: This is its main use. It highlights the completion of one action before a future deadline or another future event.
ru: Это его основное использование. Оно подчеркивает завершение одного действия до наступления крайнего срока в будущем или другого будущего события.
uk: Це його основне використання. Він підкреслює завершення однієї дії до майбутнього терміну або іншої майбутньої події.

source: The degree will be finished before next year arrives.
ru: Степень будет получена до наступления следующего года.
uk: Ступінь буде завершено до того, як настане наступний рік.

source: The cooking will be completed before your arrival.
ru: Приготовление пищи будет завершено до вашего приезда.
uk: Готування буде завершено до вашого прибуття.

source: The signing will be done by Friday.
ru: Подписание будет завершено к пятнице.
uk: Підписання буде зроблено до п'ятниці.

source: To Express an Assumption or Opinion about a Past Action from a Future Perspective:
ru: Для выражения предположения или мнения о прошлом действии с точки зрения будущего:
uk: Для вираження припущення або думки про минулу дію з погляду майбутнього:

source: Less common, but it can be used to guess about something that has probably already happened.
ru: Менее распространено, но может использоваться для предположения о чем-то, что, вероятно, уже произошло.
uk: Менш поширено, але може використовуватися для припущення про щось, що, ймовірно, вже сталося.

source: Assuming he has already arrived, looking from the present moment.
ru: Предполагаем, что он уже прибыл, глядя из настоящего момента.
uk: Припускаючи, що він уже прибув, дивлячись із теперішнього моменту.

source: Assuming they have already received the news.
ru: Предполагаем, что они уже получили новости.
uk: Припускаючи, що вони вже отримали новини.

source: Time Expressions Used with the Future Perfect
ru: Временные выражения, используемые с Future Perfect
uk: Вирази часу, що використовуються з Future Perfect

source: Common time expressions often used with the Future Perfect include:
ru: Общие временные выражения, часто используемые с Future Perfect, включают:
uk: Поширені вирази часу, які часто використовуються з Future Perfect, включають:

source: by next week, by 2030, by then, by the time...
ru: к следующей неделе, к 2030 году, к тому времени, к тому моменту, как...
uk: by next week (до наступного тижня), by 2030 (до 2030 року), by then (до того часу), by the time... (до того моменту, як...)

source: when something else happens
ru: когда произойдет что-то еще
uk: коли щось інше відбудеться

source: used with negative sentences
ru: используется с отрицательными предложениями
uk: використовується із заперечними реченнями

source: Future Perfect vs. Other Future Tenses
ru: Future Perfect против других будущих времен
uk: Future Perfect (Майбутній доконаний) vs. Інші майбутні часи

source: Future Perfect:
uk: Future Perfect (Майбутній доконаний):

source: Focuses on the **completion of an action before a specific future point.**
uk: Фокусується на **завершенні дії до певного моменту в майбутньому.**

source: The report will be done by 5 PM.
ru: Отчет будет готов к 5 вечера.
uk: Звіт буде зроблено до 17:00.

source: Describes a single action or a prediction in the future.
ru: Описывает единичное действие или предсказание в будущем.
uk: Описує єдину дію або передбачення в майбутньому.

source: The action itself happens at 5 PM.
ru: Само действие происходит в 5 вечера.
uk: Сама дія відбувається о 17:00.

source: Describes an action that will be **in progress** at a specific future point.
uk: Описує дію, яка буде **в процесі** в певний момент у майбутньому.

source: I'll be in the process of finishing.
ru: Я буду в процессе завершения.
uk: Я буду в процесі завершення.

source: The Future Perfect is crucial for showing sequence and completion in future timelines.
ru: Future Perfect имеет решающее значение для демонстрации последовательности и завершенности в будущих временных рамках.
uk: Future Perfect є вирішальним для показу послідовності та завершення в майбутніх часових рамках.

source: The Future Perfect Continuous
ru: Будущее совершенное длительное время (Future Perfect Continuous)
uk: Майбутній доконано-тривалий час (Future Perfect Continuous)

source: The Future Perfect Continuous (Future Perfect Progressive)
ru: Будущее совершенное длительное время (Future Perfect Continuous/Progressive)
uk: Майбутній доконано-тривалий час (Future Perfect Continuous / Future Perfect Progressive)

source: Formation of the Future Perfect Continuous
ru: Образование Future Perfect Continuous
uk: Утворення Майбутнього доконано-тривалого часу (Future Perfect Continuous)

source: The Future Perfect Continuous is formed using the auxiliary verbs <span class=\
ru: Future Perfect Continuous образуется с помощью вспомогательных глаголов <span class=\
uk: Майбутній доконано-тривалий час утворюється за допомогою допоміжних дієслів <span class=\

source: Auxiliary 3
ru: Вспомогательный 3
uk: Допоміжне дієслово 3

source: Uses of the Future Perfect Continuous
ru: Использование Future Perfect Continuous
uk: Використання Майбутнього доконано-тривалого часу (Future Perfect Continuous)

source: The Future Perfect Continuous is used to express:
ru: Future Perfect Continuous используется для выражения:
uk: Future Perfect Continuous використовується для вираження:

source: Actions that Will Be in Progress for a Duration Up to a Specific Time in the Future:
ru: Действия, которые будут продолжаться в течение определенного периода времени до конкретного момента в будущем:
uk: Дій, які будуть у процесі протягом певного періоду аж до конкретного часу в майбутньому:

source: This is its main use. It highlights the duration of an ongoing action that will culminate at a future point.
ru: Это его основное использование. Оно подчеркивает продолжительность продолжающегося действия, которое завершится в будущий момент.
uk: Це його основне використання. Він підкреслює тривалість безперервної дії, яка завершиться в майбутній момент.

source: The writing starts at 2 PM and continues until 5 PM.
ru: Письмо начинается в 14:00 и продолжается до 17:00.
uk: Писання починається о 14:00 і триває до 17:00.

source: To Show the Cause of a Future Event or Situation:
ru: Чтобы показать причину будущего события или ситуации:
uk: Щоб показати причину майбутньої події чи ситуації:

source: The ongoing action in the Future Perfect Continuous explains the reason for a state or event that will occur in the future.
ru: Продолжающееся действие в Future Perfect Continuous объясняет причину состояния или события, которое произойдет в будущем.
uk: Тривала дія у Future Perfect Continuous пояснює причину стану чи події, яка відбудеться в майбутньому.

source: The cleaning causes the future tiredness.
ru: Уборка вызывает будущую усталость.
uk: Прибирання спричиняє майбутню втому.

source: Time Expressions Used with the Future Perfect Continuous
ru: Временные выражения, используемые с Future Perfect Continuous
uk: Вирази часу, що використовуються з Future Perfect Continuous

source: Common time expressions often used with the Future Perfect Continuous include:
ru: Общие временные выражения, часто используемые с Future Perfect Continuous, включают:
uk: Поширені вирази часу, які часто використовуються з Future Perfect Continuous, включають:

source: e.g.,
ru: напр.,
uk: наприклад,

source: Future Perfect Continuous vs. Other Future Tenses
ru: Future Perfect Continuous против других будущих времен
uk: Future Perfect Continuous (Майбутній доконано-тривалий) vs. Інші майбутні часи

source: The Future Perfect Continuous is often confused with the Future Perfect Simple. The key distinction is emphasis:
ru: Future Perfect Continuous часто путают с Future Perfect Simple. Ключевое различие — в акценте:
uk: Future Perfect Continuous часто плутають із Future Perfect Simple. Ключова відмінність – це акцент:

source: Emphasizes the **duration** or the **process** of an activity leading up to a future point.
uk: Наголошує на **тривалості** або **процесі** діяльності, що триває аж до моменту в майбутньому.

source: Focus on the *process* and *length* of studying.
uk: Фокус на *процесі* та *тривалості* навчання.

source: Future Perfect Simple:
uk: Future Perfect Simple (Майбутній доконаний):

source: Emphasizes the **completion** of an action before a future point or the *result* of the action.
uk: Наголошує на **завершенні** дії до моменту в майбутньому або на *результаті* дії.

source: Focus on the *completion* of learning French.
uk: Фокус на *завершенні* вивчення французької мови.

source: Describes an action that will be **in progress** at a specific future moment.
uk: Описує дію, яка буде **в процесі** у певний момент у майбутньому.

source: I will be in the middle of studying.
ru: Я буду в процессе обучения.
uk: Я буду посеред навчання.

source: Future Simple:
uk: Future Simple (Майбутній простий):

source: A simple future action.
ru: Простое будущее действие.
uk: Проста майбутня дія.

source: The Future Perfect Continuous allows for a nuanced description of future events, highlighting the ongoing nature of actions and their duration.
ru: Future Perfect Continuous позволяет дать нюансированное описание будущих событий, подчеркивая продолжительный характер действий и их длительность.
uk: Future Perfect Continuous дозволяє детально описати майбутні події, підкреслюючи тривалий характер дій та їхню тривалість.

source: The Future Simple
ru: Простое будущее время (Future Simple)
uk: Майбутній простий час (Future Simple)

source: The Future Simple (Will)
ru: Простое будущее время (Will)
uk: Майбутній простий час (Will)

source: Formation of the Future Simple
ru: Образование Future Simple
uk: Утворення Майбутнього простого часу (Future Simple)

source: The Future Simple is formed using the auxiliary verb <span class=\
ru: Future Simple образуется с помощью вспомогательного глагола <span class=\
uk: Майбутній простий час утворюється за допомогою допоміжного дієслова <span class=\

source: Auxiliary
ru: Вспомогательный глагол
uk: Допоміжне дієслово

source: Base Form
ru: Базовая форма
uk: Базова форма

source: In everyday speech and informal writing, contractions are very common:
ru: В повседневной речи и неформальном письме сокращения очень распространены:
uk: У щоденному мовленні та неформальному письмі скорочення є дуже поширеними:

source: To form questions, we invert the subject and the auxiliary verb \
ru: Чтобы образовать вопросы, мы инвертируем подлежащее и вспомогательный глагол \
uk: Для утворення питань ми інвертуємо підмет і допоміжне дієслово \

source: Uses of the Future Simple
ru: Использование Future Simple
uk: Використання Майбутнього простого часу (Future Simple)

source: The Future Simple is used for various purposes related to the future:
ru: Future Simple используется для различных целей, связанных с будущим:
uk: Future Simple використовується для різних цілей, пов'язаних із майбутнім:

source: Predictions / Opinions about the Future (without strong evidence):
ru: Предсказания / Мнения о будущем (без веских доказательств):
uk: Прогнози / Думки про майбутнє (без вагомих доказів):

source: Based on personal opinion, belief, or general knowledge. Often used with verbs like
ru: Основано на личном мнении, убеждении или общих знаниях. Часто используется с глаголами, такими как
uk: Базується на особистій думці, переконанні або загальних знаннях. Часто використовується з дієсловами, як-от

source: Spontaneous Decisions / Decisions Made at the Moment of Speaking:
ru: Спонтанные решения / Решения, принятые в момент речи:
uk: Спонтанні рішення / Рішення, прийняті в момент мовлення:

source: For actions decided upon at the time of speaking, not pre-planned.
ru: Для действий, о которых решено в момент речи, а не заранее запланированных.
uk: Для дій, вирішених у момент мовлення, а не запланованих заздалегідь.

source: Promises, Offers, Requests, Threats, Warnings:
ru: Обещания, предложения, просьбы, угрозы, предупреждения:
uk: Обіцянки, пропозиції, прохання, погрози, попередження:

source: Promises:
ru: Обещания:
uk: Обіцянки:

source: Offers:
ru: Предложения:
uk: Пропозиції:

source: Requests:
ru: Просьбы:
uk: Прохання:

source: Threats:
ru: Угрозы:
uk: Погрози:

source: Warnings:
ru: Предупреждения:
uk: Попередження:

source: Future Facts:
ru: Будущие факты:
uk: Майбутні факти:

source: Things that are certain to happen in the future.
ru: Вещи, которые обязательно произойдут в будущем.
uk: Речі, які неодмінно відбудуться в майбутньому.

source: In Type 1 Conditional Sentences (Real Conditionals):
ru: В условных предложениях 1-го типа (реальные условия):
uk: Умовні речення Типу 1 (Реальні умовні речення):

source: To describe a likely future result if a present condition is met.
ru: Для описания вероятного будущего результата, если выполняется настоящее условие.
uk: Для опису ймовірного майбутнього результату, якщо виконана умова в теперішньому.

source: Future Simple vs. \
ru: Future Simple против \
uk: Future Simple (Майбутній простий) vs. \

source: While both can refer to the future, they have distinct uses:
ru: Хотя оба могут относиться к будущему, у них есть четкие области применения:
uk: Хоча обидва можуть стосуватися майбутнього, вони мають чітко відмінні використання:

source: Spontaneous decisions
ru: Спонтанные решения
uk: Спонтанні рішення

source: Predictions (often based on opinion, less on evidence)
ru: Предсказания (часто основанные на мнении, меньше на доказательствах)
uk: Прогнози (часто засновані на думці, менше на доказах)

source: Promises, offers, requests, threats, facts
ru: Обещания, предложения, просьбы, угрозы, факты
uk: Обіцянки, пропозиції, прохання, погрози, факти

source: Less certain or immediate plans
ru: Менее определенные или немедленные планы
uk: Менш певні або негайні плани

source: Plans or intentions decided *before* the moment of speaking.
uk: Плани або наміри, вирішені *до* моменту мовлення.

source: Predictions based on **strong present evidence**.
uk: Прогнози, засновані на **вагомих теперішніх доказах**.

source: Clear evidence
ru: Четкие доказательства
uk: Чіткі докази

source: Compare:
ru: Сравните:
uk: Порівняйте:

source: A thought, maybe a loose plan.
ru: Мысль, возможно, нечеткий план.
uk: Думка, можливо, приблизний план.

source: A definite plan, already decided.
ru: Определенный план, уже решенный.
uk: Конкретний план, уже вирішений.

source: The Future Simple is a fundamental tense for communicating a wide range of future scenarios and intentions.
ru: Future Simple — это основное время для передачи широкого спектра будущих сценариев и намерений.
uk: Future Simple — це основний час для повідомлення про широкий спектр майбутніх сценаріїв і намірів.

source: The Gerund
ru: Герундий
uk: Герундій (The Gerund)

source: Formation of the Gerund
ru: Образование герундия
uk: Утворення Герундія

source: The gerund is formed by adding <span class=\
ru: Герундий образуется путем добавления <span class=\
uk: Герундій утворюється шляхом додавання <span class=\

source: doubling consonant
ru: удвоение согласной
uk: подвоєння приголосної

source: dropping 'e'
ru: отбрасывание 'e'
uk: викидання 'e'

source: Uses of the Gerund
ru: Использование герундия
uk: Використання Герундія

source: As a verb-noun, the gerund can take on various roles in a sentence:
ru: Как глагольное существительное, герундий может выполнять различные роли в предложении:
uk: Як дієслово-іменник, герундій може виконувати різні ролі в реченні:

source: As the Subject of a Sentence:
ru: В качестве подлежащего предложения:
uk: Як Підмет речення:

source: The gerund can perform the action of the main verb.
ru: Герундий может выполнять действие основного глагола.
uk: Герундій може виконувати дію головного дієслова.

source: As the Object of a Verb:
ru: В качестве дополнения глагола:
uk: Як Додаток дієслова:

source: Many verbs are typically followed by a gerund. There's no simple rule; these verbs usually need to be learned.
ru: За многими глаголами обычно следует герундий. Здесь нет простого правила; эти глаголы обычно нужно заучивать.
uk: Багато дієслів типово супроводжуються герундієм. Немає простого правила; ці дієслова зазвичай потрібно запам'ятовувати.

source: Common verbs followed by gerunds:
ru: Общие глаголы, за которыми следует герундий:
uk: Поширені дієслова, після яких іде герундій:

source: etc.
ru: и т. д.
uk: тощо.

source: As the Object of a Preposition:
ru: В качестве дополнения предлога:
uk: Як Додаток прийменника:

source: A gerund must be used after prepositions.
ru: Герундий должен использоваться после предлогов.
uk: Герундій обов'язково використовується після прийменників.

source: After Certain Expressions:
ru: После определенных выражений:
uk: Після певних виразів:

source: Some common expressions are followed by a gerund.
ru: За некоторыми общими выражениями следует герундий.
uk: Деякі поширені вирази супроводжуються герундієм.

source: Note: 'to' here is a preposition, not part of an infinitive
ru: Примечание: 'to' здесь является предлогом, а не частью инфинитива
uk: Примітка: 'to' тут є прийменником, а не частиною інфінітива

source: After Phrasal Verbs:
ru: После фразовых глаголов:
uk: Після Фразових дієслів:

source: If a phrasal verb's preposition/adverb is followed by another verb, that verb takes the gerund form.
ru: Если за предлогом/наречием фразового глагола следует другой глагол, этот глагол принимает форму герундия.
uk: Якщо за прийменником/прислівником фразового дієслова йде інше дієслово, це дієслово приймає форму герундія.

source: Gerund vs. Infinitive
ru: Герундий против инфинитива
uk: Герундій vs. Інфінітив
