Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Semicolon: Independent Clauses
ru: Точка с запятой: Независимые предложения
uk: Крапка з комою: Незалежні речення

source: The Semicolon in English
ru: Точка с запятой в английском языке
uk: Крапка з комою в англійській мові

source: Semicolons join two independent clauses that are closely related in thought:
ru: Точки с запятой соединяют два независимых предложения, тесно связанных по смыслу:
uk: Крапка з комою з'єднує два незалежні речення, тісно пов'язані за змістом:

source: independent clause
ru: независимое предложение
uk: незалежне речення

source: Special Uses
ru: Особое использование
uk: Спеціальне використання

source: With Conjunctive Adverbs
ru: С соединительными наречиями
uk: Зі сполучниковими прислівниками

source: When joining clauses with transitional words (however, therefore, moreover, etc.):
ru: При соединении предложений с переходными словами (however, therefore, moreover и т. д.):
uk: При з'єднанні речень за допомогою перехідних слів (однак, тому, крім того, тощо):

source: When list items contain commas, semicolons clarify the separation:
ru: Когда элементы списка содержат запятые, точки с запятой уточняют разделение:
uk: Коли елементи переліку містять коми, крапка з комою уточнює розділення:

source: Balanced Contrast
ru: Сбалансированный контраст
uk: Збалансований контраст

source: For direct opposition between clauses:
ru: Для прямого противопоставления между предложениями:
uk: Для прямого протиставлення між реченнями:

source: Semicolon vs Other Punctuation
ru: Точка с запятой против других знаков препинания
uk: Крапка з комою vs Інші знаки пунктуації

source: Closely related independent clauses
ru: Тесно связанные независимые предложения
uk: Тісно пов'язані незалежні речення

source: Comma + Conjunction
ru: Запятая + Союз
uk: Кома + Сполучник

source: With coordinating conjunctions (and, but, etc.)
ru: С сочинительными союзами (and, but и т. д.)
uk: З сурядними сполучниками (and, but, тощо)

source: When second clause explains first
ru: Когда второе предложение объясняет первое
uk: Коли друге речення пояснює перше

source: Add semicolons where appropriate:
ru: Добавьте точки с запятой, где это уместно:
uk: Додайте крапку з комою, де це доречно:

source: Semicolon - Complex Lists
ru: Точка с запятой - Сложные списки
uk: Крапка з комою - Складні переліки

source: Semicolon: Complex Lists
ru: Точка с запятой: Сложные списки
uk: Крапка з комою: Складні переліки

source: Semicolons in Complex Lists
ru: Точки с запятой в сложных списках
uk: Крапка з комою у складних переліках

source: Use semicolons to separate list items when:
ru: Используйте точки с запятой для разделения элементов списка, когда:
uk: Використовуйте крапку з комою для розділення елементів переліку, коли:

source: Items contain commas internally
ru: Элементы содержат запятые внутри себя
uk: Елементи містять внутрішні коми

source: Items are long and complex
ru: Элементы длинные и сложные
uk: Елементи довгі та складні

source: Clarity would be compromised with regular commas
ru: Ясность была бы нарушена обычными запятыми
uk: Чіткість була б порушена звичайними комами

source: Types of Complex Lists
ru: Типы сложных списков
uk: Типи складних переліків

source: Geographical Lists
ru: Географические списки
uk: Географічні переліки

source: Cities with their countries or states:
ru: Города с их странами или штатами:
uk: Міста з їхніми країнами чи штатами:

source: Professional Titles
ru: Профессиональные звания
uk: Професійні звання

source: Names with titles or positions:
ru: Имена со званиями или должностями:
uk: Імена зі званнями чи посадами:

source: Complex Descriptions
ru: Сложные описания
uk: Складні описи

source: Items with multiple descriptors:
ru: Элементы с несколькими дескрипторами:
uk: Елементи з кількома дескрипторами:

source: Comparison: Simple vs Complex Lists
ru: Сравнение: Простые и сложные списки
uk: Порівняння: Прості vs Складні переліки

source: List Type
ru: Тип списка
uk: Тип переліку

source: Complex
ru: Сложный
uk: Складний

source: Semicolons
ru: Точки с запятой
uk: Крапка з комою

source: Mixed
ru: Смешанный
uk: Змішаний

source: Semicolons when needed
ru: Точки с запятой, когда необходимо
uk: Крапка з комою, коли необхідно

source: Add semicolons to these complex lists:
ru: Добавьте точки с запятой в эти сложные списки:
uk: Додайте крапку з комою до цих складних переліків:

source: Punctuation in English
ru: Знаки препинания в английском языке
uk: Пунктуація в англійській мові

source: Punctuation marks are essential symbols in written English that help to structure sentences, clarify meaning, and convey the intended rhythm and tone of the text. Correct punctuation is crucial for clear and effective communication.
ru: Знаки препинания - это важные символы в письменном английском языке, которые помогают структурировать предложения, уточнять смысл и передавать предполагаемый ритм и тон текста. Правильная пунктуация имеет решающее значение для ясного и эффективного общения.
uk: Розділові знаки є важливими символами в письмовій англійській мові, які допомагають структурувати речення, прояснювати значення та передавати передбачуваний ритм і тон тексту. Правильна пунктуація має вирішальне значення для чіткого та ефективного спілкування.

source: Punctuation Marks
ru: Знаки препинания
uk: Розділові знаки

source: Full Stop (Period)
ru: Точка (Full Stop/Period)
uk: Крапка

source: Usage in Declarative Sentences
ru: Использование в повествовательных предложениях
uk: Використання у розповідних реченнях

source: Abbreviations and Acronyms
ru: Сокращения и акронимы
uk: Скорочення та акроніми

source: Separating Items in a List
ru: Разделение элементов в списке
uk: Розділення елементів у переліку

source: Joining Independent Clauses
ru: Соединение независимых предложений
uk: З'єднання незалежних речень

source: Separating Introductory Elements
ru: Выделение вводных элементов
uk: Відокремлення вступних елементів

source: Setting Off Non-Essential Information
ru: Выделение несущественной информации
uk: Виділення другорядної інформації

source: Question Mark
ru: Вопросительный знак
uk: Знак питання

source: Usage in Interrogative Sentences
ru: Использование в вопросительных предложениях
uk: Використання у питальних реченнях

source: Exclamation Mark
ru: Восклицательный знак
uk: Знак оклику

source: Expressing Strong Emotion
ru: Выражение сильной эмоции
uk: Вираження сильних емоцій

source: Commands and Exclamatory Sentences
ru: Приказы и восклицательные предложения
uk: Команди та окличні речення

source: Connecting Independent Clauses
ru: Соединение независимых предложений
uk: З'єднання незалежних речень

source: Complex Lists
ru: Сложные списки
uk: Складні переліки

source: Introducing a List or Explanation
ru: Введение списка или объяснения
uk: Введення переліку чи пояснення

source: Separating Clauses
ru: Разделение предложений
uk: Розділення речень

source: Apostrophe
ru: Апостроф
uk: Апостроф

source: Showing Possession
ru: Выражение принадлежности
uk: Позначення присвійності

source: Contractions
ru: Сокращения
uk: Скорочення

source: Quotation Marks
ru: Кавычки
uk: Лапки

source: Direct Speech and Quotations
ru: Прямая речь и цитаты
uk: Пряма мова та цитати

source: Titles of Short Works
ru: Названия коротких произведений
uk: Назви невеликих творів

source: Parentheses and Brackets
ru: Круглые и квадратные скобки
uk: Круглі та квадратні дужки

source: Parentheses for Extra Information
ru: Круглые скобки для дополнительной информации
uk: Круглі дужки для додаткової інформації

source: Brackets for Editorial Clarification
ru: Квадратные скобки для редакторских пояснений
uk: Квадратні дужки для редакторського уточнення

source: Hyphen and Dash
ru: Дефис и тире
uk: Дефіс та тире

source: Hyphen for Compound Words
ru: Дефис для составных слов
uk: Дефіс для складних слів

source: Dash for Emphasis or Interruption
ru: Тире для выделения или прерывания
uk: Тире для наголосу або переривання

source: Simple Sentences by Purpose
ru: Простые предложения по цели
uk: Прості речення за метою висловлювання

source: Simple Sentences
ru: Простые предложения
uk: Прості речення

source: By Purpose
ru: По цели
uk: За метою висловлювання

source: Simple Sentences Classified by Purpose
ru: Классификация простых предложений по цели
uk: Прості речення, класифіковані за метою висловлювання

source: Every simple sentence serves a specific communicative purpose, shaping how we express statements, questions, commands, and emotions.
ru: Каждое простое предложение служит определенной коммуникативной цели, определяя, как мы выражаем утверждения, вопросы, команды и эмоции.
uk: Кожне просте речення служить певній комунікативній меті, формуючи те, як ми виражаємо твердження, питання, команди та емоції.

source: Declarative Sentences
ru: Повествовательные предложения
uk: Розповідні речення

source: Make statements or express facts, opinions, or observations. They represent the most common sentence type in English.
ru: Делают утверждения или выражают факты, мнения или наблюдения. Они представляют собой наиболее распространенный тип предложений в английском языке.
uk: Висловлюють твердження або виражають факти, думки чи спостереження. Вони є найпоширенішим типом речень в англійській мові.

source: Always end with a period
ru: Всегда заканчиваются точкой
uk: Завжди закінчуються крапкою

source: Subject typically comes before the verb
ru: Подлежащее обычно стоит перед сказуемым
uk: Підмет зазвичай стоїть перед присудком

source: Can be affirmative or negative
ru: Могут быть утвердительными или отрицательными
uk: Можуть бути стверджувальними або заперечними

source: Convey information objectively
ru: Передают информацию объективно
uk: Передають інформацію об'єктивно

source: Interrogative Sentences
ru: Вопросительные предложения
uk: Питальні речення

source: Ask questions to request information or clarification. They often require a response from the listener.
ru: Задают вопросы, запрашивая информацию или пояснения. Они часто требуют ответа от слушателя.
uk: Ставлять запитання, щоб отримати інформацію або роз'яснення. Вони часто вимагають відповіді від слухача.

source: Types:
ru: Типы:
uk: Типи:

source: Can be answered with yes or no
ru: На них можно ответить 'да' или 'нет'
uk: На них можна відповісти 'так' або 'ні'

source: Begin with question words (who, what, when, etc.)
ru: Начинаются с вопросительных слов (who, what, when и т. д.)
uk: Починаються з питальних слів (who, what, when, тощо)

source: Statement + question tag
ru: Утверждение + вопросительный 'хвостик'
uk: Твердження + питальний хвостик

source: Punctuation:
ru: Пунктуация:
uk: Пунктуація:

source: All interrogative sentences end with a question mark (?).
ru: Все вопросительные предложения заканчиваются вопросительным знаком (?).
uk: Усі питальні речення закінчуються знаком питання (?).

source: Imperative Sentences
ru: Повелительные предложения
uk: Спонукальні речення

source: Give commands, make requests, or offer instructions. The subject (you) is often implied rather than stated.
ru: Отдают приказы, делают запросы или предлагают инструкции. Подлежащее (you) часто подразумевается, а не произносится.
uk: Виражають накази, прохання або пропонують інструкції. Підмет (you) часто мається на увазі, а не вказується.

source: Forms:
ru: Формы:
uk: Форми:

source: Can end with a period (.) or exclamation mark (!) for emphasis.
ru: Могут заканчиваться точкой (.) или восклицательным знаком (!) для выделения.
uk: Можуть закінчуватися крапкою (.) або знаком оклику (!) для підкреслення.

source: Express strong emotions such as surprise, excitement, anger, or joy. Often begin with 'what' or 'how'.
ru: Выражают сильные эмоции, такие как удивление, волнение, гнев или радость. Часто начинаются со слов 'what' или 'how'.
uk: Виражають сильні емоції, такі як здивування, захоплення, гнів або радість. Часто починаються з 'what' або 'how'.

source: Convey intense emotion
ru: Передают сильные эмоции
uk: Передають сильні емоції

source: Often use interjections
ru: Часто используют междометия
uk: Часто використовують вигуки

source: Can be short and emphatic
ru: Могут быть короткими и выразительными
uk: Можуть бути короткими та виразними

source: Word order may differ from declarative sentences
ru: Порядок слов может отличаться от повествовательных предложений
uk: Порядок слів може відрізнятися від розповідних речень

source: Always end with an exclamation mark (!).
ru: Всегда заканчиваются восклицательным знаком (!).
uk: Завжди закінчуються знаком оклику (!).

source: State facts/opinions
ru: Излагают факты/мнения
uk: Висловлюють факти/думки

source: Ask questions
ru: Задают вопросы
uk: Ставлять питання

source: Give commands
ru: Отдают команды
uk: Дають команди

source: Express emotion
ru: Выражают эмоции
uk: Виражають емоції

source: Back to Simple Sentences
ru: Вернуться к простым предложениям
uk: Назад до Простих речень

source: Simple Sentences by Structure
ru: Простые предложения по структуре
uk: Прості речення за структурою

source: By Structure
ru: По структуре
uk: За структурою

source: Structural Variations of Simple Sentences
ru: Структурные вариации простых предложений
uk: Структурні варіації простих речень

source: While all simple sentences contain one independent clause, their internal structure can vary significantly in complexity.
ru: Хотя все простые предложения содержат одну независимую часть, их внутренняя структура может значительно различаться по сложности.
uk: Хоча всі прості речення містять одне незалежне речення, їхня внутрішня структура може значно відрізнятися за складністю.

source: 1. Simple Subject + Simple Predicate
ru: 1. Простое подлежащее + Простое сказуемое
uk: 1. Простий підмет + Простий присудок

source: The most basic sentence structure with one subject and one predicate.
ru: Самая базовая структура предложения с одним подлежащим и одним сказуемым.
uk: Найбільш базова структура речення з одним підметом та одним присудком.

source: Minimal grammatical elements
ru: Минимальные грамматические элементы
uk: Мінімальні граматичні елементи

source: Often used in instructions or commands
ru: Часто используется в инструкциях или командах
uk: Часто використовується в інструкціях або командах

source: Common in children's early speech
ru: Распространено в ранней речи детей
uk: Поширено в ранньому мовленні дітей

source: 2. Compound Subject + Simple Predicate
ru: 2. Составное подлежащее + Простое сказуемое
uk: 2. Складений підмет + Простий присудок

source: Multiple subjects performing the same action.
ru: Несколько подлежащих, выполняющих одно и то же действие.
uk: Кілька підметів, що виконують одну й ту ж дію.

source: Use 'and' for additive relationships
ru: Используйте 'and' для отношений сложения
uk: Використовуйте 'and' для додаткових зв'язків

source: Use 'or' for alternative relationships
ru: Используйте 'or' для альтернативных отношений
uk: Використовуйте 'or' для альтернативних зв'язків

source: Verb agrees with compound subject (plural usually)
ru: Сказуемое согласуется с составным подлежащим (обычно во множественном числе)
uk: Дієслово узгоджується зі складеним підметом (зазвичай у множині)

source: 3. Simple Subject + Compound Predicate
ru: 3. Простое подлежащее + Составное сказуемое
uk: 3. Простий підмет + Складений присудок

source: One subject performing multiple actions.
ru: Одно подлежащее, выполняющее несколько действий.
uk: Один підмет, що виконує кілька дій.

source: Verb Forms:
ru: Формы глагола:
uk: Форми дієслова:

source: Can use coordinating conjunctions (and, but, or)
ru: Могут использоваться сочинительные союзы (and, but, or)
uk: Може використовувати сурядні сполучники (and, but, or)

source: Verbs can be in different tenses if logical
ru: Глаголы могут быть в разных временах, если это логично
uk: Дієслова можуть бути в різних часах, якщо це логічно

source: 4. Compound Subject + Compound Predicate
ru: 4. Составное подлежащее + Составное сказуемое
uk: 4. Складений підмет + Складений присудок

source: Multiple subjects performing multiple actions.
ru: Несколько подлежащих, выполняющих несколько действий.
uk: Кілька підметів, що виконують кілька дій.

source: Complexity Considerations:
ru: Соображения по сложности:
uk: Міркування щодо складності:

source: Longest possible simple sentence structure
ru: Самая длинная возможная структура простого предложения
uk: Найдовша можлива структура простого речення

source: Risk of becoming confusing if too extended
ru: Риск стать запутанным, если слишком расширено
uk: Ризик стати заплутаним, якщо надто розширений

source: Often better divided into separate sentences
ru: Часто лучше разделить на отдельные предложения
uk: Часто краще розділити на окремі речення

source: Structural Comparison
ru: Сравнение структур
uk: Порівняння структур

source: Predicate
ru: Сказуемое
uk: Присудок

source: Basic
ru: Базовое
uk: Базовий

source: Compound Subject
ru: Составное подлежащее
uk: Складений підмет

source: Compound Predicate
ru: Составное сказуемое
uk: Складений присудок

source: Full Compound
ru: Полностью составное
uk: Повністю складений

source: Examples of Simple Sentences
ru: Примеры простых предложений
uk: Приклади простих речень

source: Comprehensive Examples of Simple Sentences
ru: Исчерпывающие примеры простых предложений
uk: Вичерпні приклади простих речень

source: Simple sentences demonstrate how single independent clauses can express complete thoughts in various forms, from basic to complex structures.
ru: Простые предложения демонстрируют, как отдельные независимые части могут выражать законченные мысли в различных формах, от базовых до сложных структур.
uk: Прості речення демонструють, як окремі незалежні речення можуть виражати повні думки в різних формах, від базових до складних структур.

source: 1. Basic Structures
ru: 1. Базовые структуры
uk: 1. Базові структури

source: Simple Subject + Simple Predicate
ru: Простое подлежащее + Простое сказуемое
uk: Простий підмет + Простий присудок

source: 2. Expanded Structures
ru: 2. Расширенные структуры
uk: 2. Розширені структури

source: With Modifiers
ru: С модификаторами
uk: Зі словами-модифікаторами

source: With Prepositional Phrases
ru: С предложными фразами
uk: З прийменниковими фразами

source: 3. Compound Elements
ru: 3. Составные элементы
uk: 3. Складові елементи

source: These remain simple sentences because they contain one independent clause, despite having multiple subjects or verbs.
ru: Они остаются простыми предложениями, поскольку содержат одну независимую часть, несмотря на наличие нескольких подлежащих или сказуемых.
uk: Вони залишаються простими реченнями, оскільки містять одне незалежне речення, незважаючи на наявність кількох підметів або дієслів.

source: Compound Subjects
ru: Составные подлежащие
uk: Складені підмети

source: Compound Predicates
ru: Составные сказуемые
uk: Складені присудки

source: Compound Subject and Predicate
ru: Составные подлежащее и сказуемое
uk: Складений підмет і присудок

source: 4. Functional Variations
ru: 4. Функциональные вариации
uk: 4. Функціональні варіації

source: Declarative
ru: Повествовательное
uk: Розповідні

source: Imperative
ru: Повелительное
uk: Спонукальні

source: Exclamatory
ru: Восклицательное
uk: Окличні

source: Advanced Examples
ru: Продвинутые примеры
uk: Розширені приклади

source: Key Characteristics of Simple Sentences
ru: Ключевые характеристики простых предложений
uk: Ключові характеристики простих речень

source: Essential Features of Simple Sentences
ru: Основные особенности простых предложений
uk: Основні особливості простих речень

source: Simple sentences form the foundation of English grammar. They express complete thoughts with minimal structural elements while maintaining clarity and precision.
ru: Простые предложения формируют основу английской грамматики. Они выражают законченные мысли с минимальными структурными элементами, сохраняя при этом ясность и точность.
uk: Прості речення формують основу англійської граматики. Вони виражають повні думки з мінімальними структурними елементами, зберігаючи при цьому ясність і точність.

source: 1. Single Independent Clause
ru: 1. Одна независимая часть
uk: 1. Одне незалежне речення

source: A simple sentence contains exactly one independent clause that can stand alone as a complete thought.
ru: Простое предложение содержит ровно одну независимую часть, которая может стоять отдельно как законченная мысль.
uk: Просте речення містить рівно одне незалежне речення, яке може виступати як самостійна, повна думка.

source: Components:
ru: Компоненты:
uk: Компоненти:

source: The person, place, thing, or idea performing the action
ru: Человек, место, вещь или идея, выполняющая действие
uk: Особа, місце, річ або ідея, що виконує дію (підмет)

source: The action or state of being (verb phrase)
ru: Действие или состояние бытия (глагольная фраза)
uk: Дія або стан буття (дієслівна фраза/присудок)

source: 2. Complete Thought
ru: 2. Законченная мысль
uk: 2. Повна думка

source: Simple sentences express a complete idea that doesn't require additional information to be understood.
ru: Простые предложения выражают законченную идею, которая не требует дополнительной информации для понимания.
uk: Прості речення виражають повну ідею, яка не вимагає додаткової інформації для розуміння.

source: Answers a basic question (who did what?)
ru: Отвечает на основной вопрос (кто что сделал?)
uk: Відповідає на базове питання (хто що зробив?)

source: Makes sense when standing alone
ru: Имеет смысл, когда стоит отдельно
uk: Має сенс, коли стоїть окремо

source: Conveys a clear message without ambiguity
ru: Передает ясное сообщение без двусмысленности
uk: Передає чітке повідомлення без двозначності

source: Complete vs Incomplete:
ru: Законченное vs Незаконченное:
uk: Повна vs Неповна:

source: Incomplete
ru: Незаконченное
uk: Неповна

source: 3. Single Main Verb
ru: 3. Один основной глагол
uk: 3. Одне основне дієслово

source: While a simple sentence may contain compound verbs or helping verbs, it expresses one main action or state of being.
ru: Хотя простое предложение может содержать составные глаголы или вспомогательные глаголы, оно выражает одно основное действие или состояние бытия.
uk: Хоча просте речення може містити складені дієслова або допоміжні дієслова, воно виражає одну основну дію або стан буття.

source: Verb Types in Simple Sentences:
ru: Типы глаголов в простых предложениях:
uk: Типи дієслів у простих реченнях:

source: Common Misconceptions
ru: Распространенные заблуждения
uk: Поширені хибні уявлення

source: Why Simple Sentences Matter
ru: Почему простые предложения важны
uk: Чому прості речення важливі

source: Form the foundation for more complex structures
ru: Формируют основу для более сложных структур
uk: Формують основу для більш складних структур

source: Provide clarity in communication
ru: Обеспечивают ясность в общении
uk: Забезпечують ясність у спілкуванні

source: Create emphasis in writing
ru: Создают акцент в письме
uk: Створюють акцент у письмі

source: Essential for instructions and directions
ru: Необходимы для инструкций и указаний
uk: Важливі для інструкцій та вказівок

source: Improve readability when used strategically
ru: Улучшают читабельность при стратегическом использовании
uk: Покращують читабельність при стратегічному використанні
