Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: <b>The Passive Voice</b> is a grammatical construction where the subject of the sentence receives the action of the verb, rather than performing it. This contrasts with the active voice, where the subject performs the action. The passive voice focuses attention on the action itself or the recipient of the action, often when the doer is unknown, unimportant, or obvious from the context.
ru: **Пассивный залог (The Passive Voice)** — это грамматическая конструкция, в которой **подлежащее предложения принимает на себя действие глагола**, а не совершает его. Это контрастирует с активным залогом, где подлежащее совершает действие. Пассивный залог фокусирует внимание на самом действии или на получателе действия, часто когда исполнитель **неизвестен, неважен или очевиден** из контекста.
uk: <b>Пасивний Стан (The Passive Voice)</b> — це граматична конструкція, де підмет речення є об'єктом дії дієслова, а не виконує її. Це протиставляється активному стану (Active Voice), де підмет виконує дію. Пасивний стан зосереджує увагу на самій дії або на отримувачі дії, часто коли виконавець невідомий, неважливий або очевидний з контексту.

source: Formation of the Passive Voice
ru: Образование пассивного залога
uk: Утворення Пасивного Стану

source: The passive voice is consistently formed using a specific structure: a form of the verb
ru: Пассивный залог постоянно формируется с использованием определенной структуры: форма глагола
uk: Пасивний стан послідовно формується за допомогою конкретної структури: форма дієслова

source: followed by the
ru: с последующим
uk: з наступним

source: of the main verb. Optionally, the doer of the action (the \
ru: главного глагола. Опционально, исполнитель действия (
uk: основного дієслова. За бажанням, виконавець дії (так званий \

source: in a passive sentence is the object of the active sentence.
ru: в пассивном предложении является объектом активного предложения.
uk: у пасивному реченні є об'єктом активного речення.

source: form of \
ru: форма \
uk: форма \

source: changes according to the tense.
ru: изменяется в зависимости от времени.
uk: змінюється відповідно до часу.

source: past participle
ru: причастие прошедшего времени
uk: дієприкметником минулого часу

source: of the main verb always remains the same for a given verb.
ru: главного глагола всегда остается одинаковым для данного глагола.
uk: основного дієслова завжди залишається однаковою для даного дієслова.

source: agent
ru: агент
uk: агентом

source: the person or thing performing the action in the active voice
ru: лицо или предмет, совершающее действие в активном залоге
uk: особа або річ, яка виконує дію в активному стані

source: is often omitted but can be included with \
ru: часто опускается, но может быть включен с помощью \
uk: часто опускається, але може бути включений за допомогою \

source: Passive Voice Across Different Tenses:
ru: Пассивный залог в различных временах:
uk: Пасивний Стан У Різних Часах:

source: Present Simple Passive:
ru: Present Simple Passive (Простое настоящее, пассивный залог):
uk: Простий Теперішній Пасивний:

source: Active:
ru: Активный залог:
uk: Активний:

source: Passive:
ru: Пассивный залог:
uk: Пасивний:

source: Passive (with agent):
ru: Пассивный залог (с агентом):
uk: Пасивний (з агентом):

source: Past Simple Passive:
ru: Past Simple Passive (Простое прошедшее, пассивный залог):
uk: Простий Минулий Пасивний:

source: Future Simple Passive:
ru: Future Simple Passive (Простое будущее, пассивный залог):
uk: Простий Майбутній Пасивний:

source: Present Continuous Passive:
ru: Present Continuous Passive (Настоящее продолженное, пассивный залог):
uk: Теперішній Тривалий Пасивний:

source: Past Continuous Passive:
ru: Past Continuous Passive (Прошедшее продолженное, пассивный залог):
uk: Минулий Тривалий Пасивний:

source: by her
ru: ею
uk: нею

source: Future Continuous Passive:
ru: Future Continuous Passive (Будущее продолженное, пассивный залог):
uk: Майбутній Тривалий Пасивний:

source: Rarely used, often avoided
ru: Редко используется, часто избегается
uk: Рідко використовується, часто уникають

source: Passive (less common):
ru: Пассивный залог (менее распространен):
uk: Пасивний (менш поширений):

source: Often rephrased
ru: Часто перефразируется
uk: Часто перефразовується

source: Present Perfect Passive:
ru: Present Perfect Passive (Настоящее совершенное, пассивный залог):
uk: Теперішній Доконаний Пасивний:

source: Past Perfect Passive:
ru: Past Perfect Passive (Прошедшее совершенное, пассивный залог):
uk: Минулий Доконаний Пасивний:

source: Future Perfect Passive:
ru: Future Perfect Passive (Будущее совершенное, пассивный залог):
uk: Майбутній Доконаний Пасивний:

source: 4. Modals in Passive Voice
ru: 4. Модальные глаголы в пассивном залоге
uk: 4. Модальні Дієслова у Пасивному Стані

source: Modal verbs (can, could, may, might, must, should, will, would, etc.) are followed by
ru: За модальными глаголами (can, could, may, might, must, should, will, would и т. д.) следует
uk: Після модальних дієслів (can, could, may, might, must, should, will, would, тощо) слідує

source: Use of the Passive Voice
ru: Использование пассивного залога
uk: Використання Пасивного Стану

source: While the active voice is generally preferred for clarity and directness, the passive voice is essential in certain situations to shift focus, emphasize different elements, or when specific information is unavailable or unimportant.
ru: Хотя активный залог обычно предпочтителен для ясности и прямоты, пассивный залог необходим в определенных ситуациях для **смещения фокуса**, выделения различных элементов или когда конкретная информация **недоступна или неважна**.
uk: Хоча активний стан зазвичай є кращим для ясності та прямоти, пасивний стан є важливим у певних ситуаціях, щоб змістити фокус, підкреслити різні елементи, або коли конкретна інформація недоступна чи неважлива.

source: 1. When the Doer of the Action (Agent) is Unknown or Unimportant
ru: 1. Когда исполнитель действия (Агент) неизвестен или неважен
uk: 1. Коли Виконавець Дії (Агент) Невідомий або Неважливий

source: This is the most common reason to use the passive voice. When we don't know who performed an action, or it's irrelevant to the message, the passive voice is ideal.
ru: Это наиболее частая причина использования пассивного залога. Когда мы не знаем, кто совершил действие, или это не имеет отношения к сообщению, пассивный залог идеален.
uk: Це найпоширеніша причина використання пасивного стану. Коли ми не знаємо, хто виконав дію, або це не має відношення до повідомлення, пасивний стан є ідеальним.

source: We don't know who broke it.
ru: Мы не знаем, кто это разбил.
uk: Ми не знаємо, хто це розбив.

source: The identity of the thief isn't the main point.
ru: Личность вора не является главным.
uk: Особа злодія не є головним моментом.

source: The speakers are too numerous or obvious to mention.
ru: Говорящие слишком многочисленны или очевидны, чтобы их упоминать.
uk: Мовців занадто багато або вони надто очевидні, щоб їх згадувати.

source: 2. When the Action Itself or the Recipient of the Action is More Important than the Doer
ru: 2. Когда само действие или получатель действия более важны, чем Исполнитель
uk: 2. Коли Сама Дія Або Отримувач Дії Більш Важливі, Ніж Виконавець

source: In scientific, academic, or formal contexts, the process or outcome is often more significant than who performed it. This leads to frequent use of the passive voice.
ru: В научном, академическом или формальном контексте процесс или результат часто более значимы, чем тот, кто его выполнил. Это приводит к частому использованию пассивного залога.
uk: У наукових, академічних або формальних контекстах процес або результат часто є більш значущими, ніж той, хто їх виконав. Це призводить до частого використання пасивного стану.

source: Focus on the experiments, not the scientists.
ru: Сосредоточение на экспериментах, а не на ученых.
uk: Фокус на експериментах, а не на вчених.

source: Focus on the policy, not who announced it.
ru: Сосредоточение на политике, а не на том, кто ее объявил.
uk: Фокус на політиці, а не на тому, хто її оголосив.

source: While the doer is known, the focus is on the theory's development.
ru: Хотя исполнитель известен, внимание сосредоточено на развитии теории.
uk: Хоча виконавець відомий, увага зосереджена на розробці теорії.

source: 3. To Maintain Objectivity or Formality
ru: 3. Для поддержания объективности или формальности
uk: 3. Для Підтримання Об'єктивності або Формальності

source: The passive voice can create a more impersonal and objective tone, which is often desirable in academic writing, reports, and news articles.
ru: Пассивный залог может создать более **безличный и объективный** тон, что часто желательно в академическом письме, отчетах и новостных статьях.
uk: Пасивний стан може створити більш безособовий та об'єктивний тон, що часто бажано в академічному письмі, звітах та новинних статтях.

source: Avoids blaming a specific person.
ru: Позволяет избежать обвинения конкретного лица.
uk: Уникає звинувачення конкретної особи.

source: More formal than \
ru: Более формально, чем \
uk: Більш формально, ніж \

source: 4. To Vary Sentence Structure and Flow
ru: 4. Для разнообразия структуры предложения и плавности
uk: 4. Для Урізноманітнення Структури Речення та Плинності

source: Occasionally, using the passive voice can help improve the flow and readability of a paragraph by avoiding repetitive sentence structures or by placing emphasis on different parts of the sentence.
ru: Иногда использование пассивного залога может помочь улучшить **плавность и читабельность** абзаца, избегая повторяющихся структур предложений или делая акцент на других частях предложения.
uk: Іноді використання пасивного стану може допомогти покращити плинність та читабельність абзацу, уникнувши повторюваних структур речень або розмістивши акцент на різних частинах речення.

source: Connects the two sentences smoothly by focusing on the exhibition.
ru: Плавно связывает два предложения, фокусируясь на выставке.
uk: Плавно поєднує два речення, зосереджуючись на виставці.

source: When to Avoid the Passive Voice:
ru: Когда следует избегать пассивного залога:
uk: Коли Слід Уникати Пасивного Стану:

source: While useful, overuse of the passive voice can make writing seem:
ru: Хотя пассивный залог полезен, его чрезмерное использование может сделать текст:
uk: Хоча пасивний стан корисний, його надмірне використання може зробити текст:

source: Vague:
ru: Расплывчатым:
uk: Нечітким:

source: Hiding the agent can lead to ambiguity.
ru: Скрытие агента может привести к двусмысленности.
uk: Приховування агента може призвести до двозначності.

source: Wordy:
ru: Многословным:
uk: Багатослівним:

source: Passive constructions often use more words than active ones.
ru: Пассивные конструкции часто используют больше слов, чем активные.
uk: Пасивні конструкції часто використовують більше слів, ніж активні.

source: Less Direct:
ru: Менее прямым:
uk: Менш Прямим:

source: It can sometimes sound evasive or overly formal where directness is needed.
ru: Иногда может звучать уклончиво или слишком формально, когда необходима прямота.
uk: Іноді це може звучати ухильно або надмірно формально там, де потрібна прямота.

source: Weak:
ru: Слабым:
uk: Слабким:

source: The active voice is generally more dynamic and engaging.
ru: Активный залог, как правило, более динамичен и увлекателен.
uk: Активний стан, як правило, більш динамічний та захоплюючий.

source: Always consider whether the passive voice serves a specific purpose in your writing. If the doer is important and known, or if you want clear, direct communication, the active voice is usually the better choice.
ru: Всегда учитывайте, служит ли пассивный залог конкретной цели в вашем тексте. Если исполнитель важен и известен, или если вам нужна четкая, прямая коммуникация, **активный залог** обычно является лучшим выбором.
uk: Завжди зважайте, чи служить пасивний стан конкретній меті у вашому тексті. Якщо виконавець важливий і відомий, або якщо ви бажаєте чіткої, прямої комунікації, активний стан зазвичай є кращим вибором.

source: The Past Continuous
ru: Прошедшее продолженное время (The Past Continuous)
uk: Минулий Тривалий Час (Past Continuous)

source: The Past Continuous (Past Progressive)
ru: Прошедшее продолженное время (The Past Continuous / Past Progressive)
uk: Минулий Тривалий Час (Past Continuous/Past Progressive)

source: Formation of the Past Continuous
ru: Образование Past Continuous
uk: Утворення Минулого Тривалого Часу

source: The Past Continuous is formed using the auxiliary verb <span class=\
ru: Past Continuous образуется с помощью вспомогательного глагола <span class=\
uk: Минулий Тривалий Час утворюється за допомогою допоміжного дієслова <span class=\

source: in Past
ru: в прошедшем времени
uk: у Минулому

source: Uses of the Past Continuous
ru: Использование Past Continuous
uk: Використання Минулого Тривалого Часу

source: The Past Continuous is used to express:
ru: Past Continuous используется для выражения:
uk: Минулий Тривалий Час використовується для вираження:

source: Actions in Progress at a Specific Time in the Past:
ru: Действия, происходившие в определенный момент в прошлом:
uk: Дії, що Тривали у Певний Момент у Минулому:

source: It indicates that an action was ongoing at a particular point in time. The specific time is often mentioned.
ru: Оно указывает, что действие продолжалось в определенный момент времени. Конкретное время часто упоминается.
uk: Він вказує на те, що дія тривала у певний момент часу. Конкретний час часто згадується.

source: Actions Interrupted by Another Action:
ru: Действия, прерванные другим действием:
uk: Дії, Перервані Іншою Дією:

source: A longer action in the past continuous is interrupted by a shorter, completed action in the past simple.
ru: Более длительное действие в Past Continuous прерывается более коротким, завершенным действием в Past Simple.
uk: Довша дія в Past Continuous переривається коротшою, завершеною дією в Past Simple.

source: are often used here.
ru: часто используются здесь.
uk: часто використовуються тут.

source: Parallel Actions in the Past:
ru: Параллельные действия в прошлом:
uk: Паралельні Дії у Минулому:

source: Two or more actions happening at the same time in the past.
ru: Два или более действий, происходивших одновременно в прошлом.
uk: Дві або більше дії, що відбувалися одночасно в минулому.

source: To Describe Atmosphere or Background in a Story:
ru: Для описания атмосферы или фона в истории:
uk: Для Опису Атмосфери або Фону в Оповіданні:

source: Sets the scene for a narrative, describing ongoing actions that form the context for main events.
ru: Задает сцену для повествования, описывая продолжающиеся действия, которые формируют контекст для основных событий.
uk: Створює сцену для розповіді, описуючи триваючі дії, які формують контекст для основних подій.

source: With
ru: С
uk: З

source: to Describe Annoying Past Habits:
ru: для описания раздражающих прошлых привычек:
uk: для Опису Набридливих Звичок у Минулому:

source: Similar to the Present Continuous for annoyance, but referring to the past.
ru: Аналогично Present Continuous для выражения раздражения, но относится к прошлому.
uk: Схоже на Present Continuous для вираження роздратування, але стосується минулого.

source: Past Continuous vs. Past Simple
ru: Past Continuous против Past Simple
uk: Past Continuous проти Past Simple

source: It's crucial to understand the difference between the Past Simple and Past Continuous:
ru: Крайне важно понимать разницу между Past Simple и Past Continuous:
uk: Важливо розуміти різницю між Past Simple та Past Continuous:

source: Describes a <b>completed action</b> at a <b>specific point in the past</b>. The focus is on the action's completion.
ru: Описывает **завершенное действие** в **определенный момент в прошлом**. Основное внимание уделяется завершению действия.
uk: Описує <b>завершену дію</b> у <b>певний момент у минулому</b>. Акцент робиться на завершенні дії.

source: The action of reading is finished.
ru: Действие чтения завершено.
uk: Дія читання завершена.

source: Describes an <b>ongoing action</b> in the past. The focus is on the <b>duration</b> or that the action was interrupted or background to another event.
ru: Описывает **продолжающееся действие** в прошлом. Основное внимание уделяется **длительности** или тому, что действие было прервано или служило фоном для другого события.
uk: Описує <b>триваючу дію</b> у минулому. Акцент робиться на <b>тривалості</b> або на тому, що дія була перервана або слугувала фоном для іншої події.

source: The reading was in progress when the call interrupted it.
ru: Чтение было в процессе, когда звонок прервал его.
uk: Читання тривало, коли дзвінок його перервав.

source: Using the Past Continuous effectively helps you describe the dynamic and ongoing nature of past events, providing richer detail in your narratives.
ru: Эффективное использование Past Continuous помогает вам описывать динамичный и продолжающийся характер прошлых событий, предоставляя более богатые детали в ваших повествованиях.
uk: Ефективне використання Past Continuous допомагає описати динамічний та триваючий характер минулих подій, надаючи більш насичені деталі у ваших розповідях.

source: The Past Perfect
ru: Прошедшее совершенное время (The Past Perfect)
uk: Минулий Доконаний Час (Past Perfect)

source: Formation of the Past Perfect
ru: Образование Past Perfect
uk: Утворення Минулого Доконаного Часу

source: The Past Perfect is formed using the auxiliary verb <span class=\
ru: Past Perfect образуется с помощью вспомогательного глагола <span class=\
uk: Минулий Доконаний Час утворюється за допомогою допоміжного дієслова <span class=\

source: In informal speech and writing, contractions are very common:
ru: В неформальной речи и письме очень распространены сокращения:
uk: У неформальному мовленні та письмі дуже поширені скорочення:

source: Uses of the Past Perfect
ru: Использование Past Perfect
uk: Використання Минулого Доконаного Часу

source: The Past Perfect is primarily used to:
ru: Past Perfect в основном используется для:
uk: Минулий Доконаний Час в основному використовується для:

source: Actions Completed Before Another Action or Time in the Past:
ru: Действия, завершенные до другого действия или момента в прошлом:
uk: Дії, Завершені До Іншої Дії Або Часу У Минулому:

source: This is the most common use. It shows that one past action occurred before another past action or before a specific time in the past. The later action/time is usually in the Past Simple.
ru: Это наиболее распространенное использование. Оно показывает, что одно прошлое действие произошло **до** другого прошлого действия или до определенного момента в прошлом. Более позднее действие/время обычно выражено в Past Simple.
uk: Це найбільш поширене використання. Воно показує, що одна минула дія відбулася до іншої минулої дії або до певного моменту в минулому. Пізніша дія/час зазвичай стоїть у Past Simple.

source: First, they ate; then, I arrived.
ru: Сначала они поели; затем я пришел.
uk: Спочатку вони поїли, потім я приїхав.

source: First, she lived in London; then, she moved.
ru: Сначала она жила в Лондоне; затем она переехала.
uk: Спочатку вона жила в Лондоні, потім переїхала.

source: First, I finished work; then, 6 PM arrived.
ru: Сначала я закончил работу; затем наступило 6 вечера.
uk: Спочатку я закінчив роботу, потім настала 18:00.

source: In Reported Speech:
ru: 3. В косвенной речи:
uk: У Непрямій Мові:

source: When reporting something that was originally said in the Present Perfect or Past Simple, the tense shifts to the Past Perfect.
ru: При передаче сообщения, которое изначально было сказано в Present Perfect или Past Simple, время смещается в Past Perfect.
uk: При передачі чогось, що було спочатку сказано в Present Perfect або Past Simple, час змінюється на Past Perfect.

source: Direct speech:
ru: Прямая речь:
uk: Пряма мова:

source: Reported speech:
ru: Косвенная речь:
uk: Непряма мова:

source: In Type 3 Conditional Sentences (Unreal Past Conditionals):
ru: В условных предложениях 3-го типа (Нереальные прошлые условия):
uk: Умовні Речення Третього Типу (Нереальні Умовні Речення у Минулому):

source: To talk about hypothetical situations in the past that did not happen.
ru: Для разговора о гипотетических ситуациях в прошлом, которые не произошли.
uk: Для розмови про гіпотетичні ситуації в минулому, які не відбулися.

source: But I didn't know, so I didn't bake a cake.
ru: Но я не знал, поэтому не испек торт.
uk: Але я не знав, тому не спік торт.

source: But they didn't study, so they didn't pass.
ru: Но они не учились, поэтому не сдали.
uk: Але вони не вчилися, тому не здали.

source: To Explain or Give Reasons for a Past Situation:
ru: Для объяснения или приведения причин прошлой ситуации:
uk: Для Пояснення Або Вказання Причин Минулої Ситуації:

source: The forgetting happened before the attempt to get in.
ru: Забывание произошло до попытки войти.
uk: Забуття сталося до спроби увійти.

source: Time Expressions Used with the Past Perfect
ru: Временные выражения, используемые с Past Perfect
uk: Часові Вирази, Що Використовуються З Past Perfect

source: Common time expressions often used with the Past Perfect include:
ru: Распространенные временные выражения, часто используемые с Past Perfect, включают:
uk: Поширені часові вирази, які часто використовуються з Past Perfect, включають:

source: can be used if the order is clear
ru: может использоваться, если порядок ясен
uk: може використовуватися, якщо послідовність зрозуміла

source: The Past Perfect is essential for clearly sequencing events in the past, especially when explaining cause and effect or narratives where the chronology is important.
ru: Past Perfect имеет важное значение для четкого упорядочивания событий в прошлом, особенно при объяснении причины и следствия или в повествованиях, где важна хронология.
uk: Past Perfect є важливим для чіткого впорядкування подій у минулому, особливо при поясненні причини та наслідку або в розповідях, де важлива хронологія.

source: The Past Perfect Continuous
ru: Прошедшее совершенное длительное время (The Past Perfect Continuous)
uk: Минулий Доконано-Тривалий Час (Past Perfect Continuous)

source: The Past Perfect Continuous (Past Perfect Progressive)
ru: Прошедшее совершенное длительное время (The Past Perfect Continuous / Past Perfect Progressive)
uk: Минулий Доконано-Тривалий Час (Past Perfect Continuous/Past Perfect Progressive)

source: Formation of the Past Perfect Continuous
ru: Образование Past Perfect Continuous
uk: Утворення Минулого Доконано-Тривалого Часу

source: The Past Perfect Continuous is formed using the auxiliary verb <span class=\
ru: Past Perfect Continuous образуется с помощью вспомогательного глагола <span class=\
uk: Минулий Доконано-Тривалий Час утворюється за допомогою допоміжного дієслова <span class=\

source: To form questions, we invert the subject and the first auxiliary verb \
ru: Для образования вопросов мы инвертируем подлежащее и первый вспомогательный глагол \
uk: Для утворення питань ми інвертуємо підмет і перше допоміжне дієслово \

source: Uses of the Past Perfect Continuous
ru: Использование Past Perfect Continuous
uk: Використання Минулого Доконано-Тривалого Часу

source: The Past Perfect Continuous is used to express:
ru: Past Perfect Continuous используется для выражения:
uk: Минулий Доконано-Тривалий Час використовується для вираження:

source: Actions that Started in the Past and Continued Up to Another Point in the Past:
ru: Действия, которые начались в прошлом и **продолжались до другого момента в прошлом**:
uk: Дії, що Розпочалися У Минулому І Тривали До Іншого Моменту У Минулому:
