Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: 1. One-Syllable Adjectives
ru: 1. Односложные прилагательные
uk: 1. Односкладові прикметники

source: For most one-syllable adjectives, you form the comparative by adding <span class=\
ru: Для большинства односложных прилагательных сравнительная степень образуется путем добавления
uk: Для більшості односкладових прикметників ви утворюєте вищий ступінь, додаючи <span class=\

source: Positive
ru: Положительная степень
uk: Позитивний

source: Comparative
ru: Сравнительная степень
uk: Вищий ступінь

source: Superlative
ru: Превосходная степень
uk: Найвищий ступінь

source: <strong>Spelling Rule:</strong> If the adjective ends in a single vowel + consonant, double the final consonant before adding the suffix (e.g.,
ru: <strong>Правило правописания:</strong> Если прилагательное оканчивается на одну гласную + согласную, удвойте конечную согласную перед добавлением суффикса (например,
uk: <strong>Правило написання:</strong> Якщо прикметник закінчується на одну голосну + приголосну, подвойте кінцеву приголосну перед додаванням суфікса (наприклад,

source: 2. Two-Syllable Adjectives
ru: 2. Двусложные прилагательные
uk: 2. Двоскладові прикметники

source: For most two-syllable adjectives, you use <span class=\
uk: Для більшості двоскладових прикметників ви використовуєте <span class=\

source: <strong>Note:</strong> Adjectives ending in <span class=\
uk: <strong>Примітка:</strong> Прикметники, що закінчуються на <span class=\

source: 3. Three or More Syllable Adjectives
ru: 3. Прилагательные с тремя и более слогами
uk: 3. Три або більше складів прикметники

source: All adjectives with three or more syllables form the comparative and superlative degrees using <span class=\
uk: Усі прикметники з трьома або більше складами утворюють вищий та найвищий ступені порівняння за допомогою <span class=\

source: Adjective: Irregular Forms
ru: Прилагательное: Неправильные формы
uk: Прикметник: Неправильні форми

source: Irregular Forms
ru: Неправильные формы
uk: Неправильні форми

source: While most adjectives follow the standard rules for forming comparative and superlative degrees, some common adjectives have irregular forms that must be memorized. These forms do not follow the <span class=\
uk: Хоча більшість прикметників дотримуються стандартних правил утворення вищого та найвищого ступенів порівняння, деякі поширені прикметники мають неправильні форми, які необхідно запам’ятати. Ці форми не дотримуються <span class=\

source: Key Irregular Adjectives
ru: Ключевые неправильные прилагательные
uk: Ключові неправильні прикметники

source: The following table lists the most important irregular adjectives and their degrees of comparison.
ru: В следующей таблице перечислены наиболее важные неправильные прилагательные и их степени сравнения.
uk: Наведена нижче таблиця містить перелік найважливіших неправильних прикметників та їхні ступені порівняння.

source: Examples in Sentences
ru: Примеры в предложениях
uk: Приклади в реченнях

source: Here's how these irregular forms are used in context:
ru: Вот как эти неправильные формы используются в контексте:
uk: Ось як ці неправильні форми використовуються в контексті:

source: Adjective: Morphological Structure
ru: Прилагательное: Морфологическая структура
uk: Прикметник: Морфологічна структура

source: Morphological Structure
ru: Морфологическая структура
uk: Морфологічна структура

source: The morphological structure of adjectives refers to how they are formed. Adjectives can be simple, formed by adding suffixes to other words, or have special endings for comparison.
ru: Морфологическая структура прилагательных относится к тому, как они образуются. Прилагательные могут быть простыми, образованными путем добавления суффиксов к другим словам, или иметь специальные окончания для сравнения.
uk: Морфологічна структура прикметників стосується способу їх утворення. Прикметники можуть бути простими, утвореними шляхом додавання суфіксів до інших слів, або мати спеціальні закінчення для порівняння.

source: 1. Simple and Derived Adjectives
ru: 1. Простые и производные прилагательные
uk: 1. Прості та похідні прикметники

source: Most adjectives in English are simple words that don't have affixes (e.g.,
ru: Большинство прилагательных в английском языке — это простые слова, не имеющие аффиксов (например,
uk: Більшість прикметників в англійській мові — це прості слова, які не мають афіксів (наприклад,

source: ). However, many adjectives are formed from other parts of speech by adding a suffix.
ru: ). Однако многие прилагательные образуются от других частей речи путем добавления суффикса.
uk: ). Однак багато прикметників утворюються від інших частин мови шляхом додавання суфікса.

source: Suffix
ru: Суффикс
uk: Суфікс

source: From
ru: От (чего образовано)
uk: Від

source: Noun
ru: Существительное
uk: Іменник

source: Verb
ru: Глагол
uk: Дієслово

source: 2. Comparative and Superlative Forms
ru: 2. Сравнительная и превосходная степени
uk: 2. Вищий та найвищий ступені

source: The other main aspect of adjective morphology is the formation of comparative and superlative degrees. This usually happens with suffixes for short adjectives and with separate words for long ones.
ru: Другой основной аспект морфологии прилагательных — это образование сравнительной и превосходной степеней. Обычно это происходит с помощью суффиксов для коротких прилагательных и отдельных слов для длинных.
uk: Іншим основним аспектом морфології прикметників є утворення вищого та найвищого ступенів порівняння. Це зазвичай відбувається за допомогою суфіксів для коротких прикметників і окремих слів для довгих.

source: Degree
ru: Степень
uk: Ступінь

source: Rule
ru: Правило
uk: Правило

source: Add <span class=\
uk: Додати <span class=\

source: Note that for longer adjectives, we use separate words:
ru: Обратите внимание, что для более длинных прилагательных мы используем отдельные слова:
uk: Зверніть увагу, що для довших прикметників ми використовуємо окремі слова:

source: and
ru: и
uk: та

source: instead of adding suffixes.
ru: вместо добавления суффиксов.
uk: замість додавання суфіксів.

source: Adjectives: Object Complement
ru: Прилагательные: Дополнение к дополнению
uk: Прикметники: Додаток-доповнення

source: Object Complement
ru: Дополнение к дополнению
uk: Додаток-доповнення

source: In some sentences, an adjective can function as an object complement. This means the adjective follows a direct object and describes or renames that object, not the subject of the sentence. This structure is used with verbs that describe a state or change of state, such as
ru: В некоторых предложениях прилагательное может выполнять функцию дополнения к дополнению. Это означает, что прилагательное следует за прямым дополнением и описывает или переименовывает это дополнение, а не подлежащее предложения. Эта структура используется с глаголами, описывающими состояние или изменение состояния, такими как
uk: У деяких реченнях прикметник може функціонувати як додаток-доповнення. Це означає, що прикметник стоїть після прямого додатка й описує або перейменовує цей додаток, а не підмет речення. Ця структура використовується з дієсловами, які описують стан або зміну стану, такими як

source: , etc.
ru: , и т. д.
uk: тощо.

source: 1. The Basic Structure
ru: 1. Основная структура
uk: 1. Основна структура

source: The structure for an object complement is: <strong>Subject + Verb + Direct Object + Adjective</strong>.
ru: Структура дополнения к дополнению: <strong>Подлежащее + Глагол + Прямое дополнение + Прилагательное</strong>.
uk: Структура додатка-доповнення: <strong>Підмет + Дієслово + Прямий Додаток + Прикметник</strong>.

source: Sentence Structure
ru: Структура предложения
uk: Структура речення

source: Subject + Verb + Direct Object + Adjective
ru: Подлежащее + Глагол + Прямое дополнение + Прилагательное
uk: Підмет + Дієслово + Прямий Додаток + Прикметник

source: In these examples, the adjectives
ru: В этих примерах прилагательные
uk: У цих прикладах прикметники

source: and
ru: и
uk: та

source: are describing the direct objects (
ru: описывают прямые дополнения (
uk: описують прямі додатки (

source: ), not the subjects of the sentences.
ru: ), а не подлежащие предложений.
uk: ), а не підмети речень.

source: 2. Distinguishing from Other Functions
ru: 2. Отличие от других функций
uk: 2. Відмінність від інших функцій

source: It's important to differentiate an object complement from a predicative adjective, which describes the subject. The position of the adjective and the verb used are key.
ru: Важно отличать дополнение к дополнению от предикативного прилагательного, которое описывает подлежащее. Положение прилагательного и используемый глагол являются ключевыми.
uk: Важливо відрізняти додаток-доповнення від предикативного прикметника, який описує підмет. Позиція прикметника та використовуване дієслово є ключовими.

source: Function
ru: Функция
uk: Функція

source: What the Adjective Describes
ru: Что описывает прилагательное
uk: Що описує прикметник

source: The subject, 'house'.
ru: Подлежащее, 'house' (дом).
uk: Підмет, 'будинок'.

source: The direct object, 'house'.
ru: Прямое дополнение, 'house' (дом).
uk: Прямий додаток, 'будинок'.

source: 3. Common Verbs Used with Object Complements
ru: 3. Распространенные глаголы, используемые с дополнением к дополнению
uk: 3. Поширені дієслова, що вживаються з додатками-доповненнями

source: Here is a list of some common verbs that can be used with an adjective as an object complement:
ru: Вот список некоторых распространенных глаголов, которые могут использоваться с прилагательным в качестве дополнения к дополнению:
uk: Ось список деяких поширених дієслів, які можуть використовуватися з прикметником як додаток-доповнення:

source: Adjective: Degrees of Comparison
ru: Прилагательное: Степени сравнения
uk: Прикметник: Ступені порівняння

source: Positive, Comparative, and Superlative
ru: Положительная, сравнительная и превосходная степени
uk: Позитивний, вищий та найвищий ступені

source: Positive, Comparative, and Superlative Degrees
ru: Положительная, сравнительная и превосходная степени
uk: Позитивний, вищий та найвищий ступені

source: Adjectives are words that describe the qualities of nouns. They can exist in three different forms, or 'degrees,' to show a comparison between things.
ru: Прилагательные — это слова, которые описывают качества существительных. Они могут существовать в трех разных формах, или 'степенях', чтобы показать сравнение между предметами.
uk: Прикметники — це слова, які описують якості іменників. Вони можуть існувати в трьох різних формах, або «ступенях», щоб показати порівняння між речами.

source: 1. The Positive Degree
ru: 1. Положительная степень
uk: 1. Позитивний ступінь

source: The positive degree is the basic, unmodified form of the adjective. It simply describes a quality without making any comparison.
ru: Положительная степень — это основная, неизмененная форма прилагательного. Она просто описывает качество, не делая никакого сравнения.
uk: Позитивний ступінь — це основна, незмінена форма прикметника. Він просто описує якість, не роблячи жодного порівняння.

source: The adjective '
ru: Прилагательное '
uk: Прикметник '

source: ' describes the building's height without comparing it to anything else.
ru: ' описывает высоту здания, не сравнивая ее ни с чем другим.
uk: ' описує висоту будівлі, не порівнюючи її ні з чим іншим.

source: ' describes the voice's quality.
ru: ' описывает качество голоса.
uk: ' описує якість голосу.

source: 2. The Comparative Degree
ru: 2. Сравнительная степень
uk: 2. Вищий ступінь

source: The comparative degree is used to compare two things. It shows that one thing has a certain quality to a greater or lesser extent than another.
ru: Сравнительная степень используется для сравнения двух предметов. Она показывает, что один предмет обладает определенным качеством в большей или меньшей степени, чем другой.
uk: Вищий ступінь використовується для порівняння двох речей. Він показує, що одна річ має певну якість більшою або меншою мірою, ніж інша.

source: ' compares the height of two buildings.
ru: ' сравнивает высоту двух зданий.
uk: ' порівнює висоту двох будівель.

source: The phrase '
ru: Фраза '
uk: Фраза '

source: ' compares the quality of two voices.
ru: ' сравнивает качество двух голосов.
uk: ' порівнює якість двох голосів.

source: 3. The Superlative Degree
ru: 3. Превосходная степень
uk: 3. Найвищий ступінь

source: The superlative degree is used to compare three or more things. It indicates that one thing has the highest or lowest degree of a certain quality among a group.
ru: Превосходная степень используется для сравнения трех или более предметов. Она указывает, что один предмет обладает самой высокой или самой низкой степенью определенного качества среди группы.
uk: Найвищий ступінь використовується для порівняння трьох або більше речей. Він вказує на те, що одна річ має найвищий або найнижчий ступінь певної якості серед групи.

source: ' indicates that this building surpasses all others in height.
ru: ' указывает, что это здание превосходит все остальные по высоте.
uk: ' вказує на те, що ця будівля перевершує всі інші за висотою.

source: ' indicates that her voice is the best among a group.
ru: ' указывает, что ее голос является лучшим среди группы.
uk: ' вказує на те, що її голос є найкращим серед групи.

source: Summary Table
ru: Сводная таблица
uk: Зведена таблиця

source: Describes one item (no comparison).
ru: Описывает один предмет (без сравнения).
uk: Описує один предмет (без порівняння).

source: Compares two items.
ru: Сравнивает два предмета.
uk: Порівнює два предмети.

source: Compares three or more items.
ru: Сравнивает три или более предмета.
uk: Порівнює три або більше предметів.

source: Adjectives: Predicative Function
ru: Прилагательные: Предикативная функция
uk: Прикметники: Предикативна функція

source: Predicative Function
ru: Предикативная функция
uk: Предикативна функція

source: When an adjective is used predicatively, it describes the subject of the sentence but is located after a verb. The adjective is not part of the noun phrase; instead, it functions as a subject complement, providing more information about the subject.
ru: Когда прилагательное используется предикативно, оно описывает подлежащее предложения, но находится после глагола. Прилагательное не является частью именной фразы; вместо этого оно функционирует как дополнение подлежащего, предоставляя больше информации о подлежащем.
uk: Коли прикметник використовується як предикативний, він описує підмет речення, але розташований після дієслова. Прикметник не є частиною іменної групи; натомість він функціонує як предикативна частина присудка, надаючи більше інформації про підмет.

source: The predicative adjective typically follows a linking verb, such as
ru: Предикативное прилагательное обычно следует за глаголом-связкой, таким как
uk: Предикативний прикметник зазвичай стоїть після дієслова-зв’язки, такого як

source: or sensory verbs like
ru: или глаголами чувственного восприятия, такими как
uk: або сенсорних дієслів, таких як

source: Subject + Linking Verb + Adjective
ru: Подлежащее + Глагол-связка + Прилагательное
uk: Підмет + Дієслово-зв'язка + Прикметник

source: describe the subjects (
ru: описывают подлежащие (
uk: описують підмети (

source: ) but are separated from them by a verb.
ru: ), но отделены от них глаголом.
uk: ), але відокремлені від них дієсловом.

source: 2. Comparing Attributive vs. Predicative
ru: 2. Сравнение атрибутивной и предикативной функций
uk: 2. Порівняння означувальної та предикативної функцій

source: Understanding the difference is crucial for proper sentence construction. The two functions can often be used to convey the same information, but with a different emphasis.
ru: Понимание различия имеет решающее значение для правильного построения предложения. Две функции часто могут использоваться для передачи одной и той же информации, но с разным акцентом.
uk: Розуміння різниці є вирішальним для правильної побудови речення. Обидві функції часто можуть використовуватися для передачі однієї й тієї ж інформації, але з різним акцентом.

source: Attributive:
ru: Атрибутивная:
uk: Означувальна функція:

source: Predicative:
ru: Предикативная:
uk: Предикативна функція:

source: While both sentences describe a happy dog, the attributive form is more direct, while the predicative form often feels like a statement of a condition.
ru: Хотя оба предложения описывают счастливую собаку, атрибутивная форма более прямая, в то время как предикативная форма часто звучит как констатация состояния.
uk: Хоча обидва речення описують щасливого собаку, означувальна форма є більш прямою, тоді як предикативна форма часто звучить як констатація стану.

source: 3. Adjectives That Are ONLY Predicative
ru: 3. Прилагательные, которые являются ТОЛЬКО предикативными
uk: 3. Прикметники, які є ТІЛЬКИ предикативними

source: Just as some adjectives are only attributive, others can only be used predicatively. These adjectives often start with the prefix
ru: Подобно тому, как некоторые прилагательные являются только атрибутивными, другие могут использоваться только предикативно. Эти прилагательные часто начинаются с приставки
uk: Подібно до того, як деякі прикметники є лише означувальними, інші можуть використовуватися лише предикативно. Ці прикметники часто починаються з префікса

source: Knowing these specific words helps to prevent common grammatical errors.
ru: Знание этих конкретных слов помогает предотвратить распространенные грамматические ошибки.
uk: Знання цих конкретних слів допомагає запобігти поширеним граматичним помилкам.

source: Order of Adjectives: The Standard Order (OSASCOMP)
ru: Порядок прилагательных: Стандартный порядок (OSASCOMP)
uk: Порядок прикметників: Стандартний порядок (OSASCOMP)

source: The Standard Order (OSASCOMP)
ru: Стандартный порядок (OSASCOMP)
uk: Стандартний порядок (OSASCOMP)

source: When a noun is modified by multiple adjectives, they must follow a specific, unspoken order. English speakers use this order naturally, but for learners, a mnemonic device can be very helpful. This standard order is often referred to by the acronym <strong>OSASCOMP</strong>.
ru: Когда существительное определяется несколькими прилагательными, они должны следовать определенному, негласному порядку. Носители английского языка используют этот порядок интуитивно, но для изучающих язык очень полезным может быть мнемоническое правило. Этот стандартный порядок часто называют аббревиатурой <strong>OSASCOMP</strong>.
uk: Коли іменник модифікується кількома прикметниками, вони повинні дотримуватися певного, неписаного порядку. Носії англійської мови використовують цей порядок природно, але для тих, хто вивчає мову, мнемонічний прийом може бути дуже корисним. Цей стандартний порядок часто називають за акронімом <strong>OSASCOMP</strong>.

source: Understanding OSASCOMP
ru: Понимание OSASCOMP
uk: Розуміння OSASCOMP

source: Each letter in the acronym represents a category of adjective. The order is from most general opinion to most specific, factual detail.
ru: Каждая буква в аббревиатуре представляет категорию прилагательных. Порядок идет от наиболее общего мнения к наиболее конкретным, фактическим деталям.
uk: Кожна літера в акронімі представляє категорію прикметника. Порядок встановлюється від найбільш загальної думки до найбільш конкретної, фактичної деталі.

source: Letter
ru: Буква
uk: Літера

source: Example Adjective
ru: Пример прилагательного
uk: Приклад прикметника

source: Origin
ru: Происхождение
uk: Походження

source: Purpose
ru: Назначение
uk: Призначення

source: Putting It All Together
ru: Собираем всё вместе
uk: Зводимо все разом

source: Not every noun phrase will have an adjective from each category, but when they do, this is the order they should follow. The most common error is mixing up the order of Opinion and Size/Age.
ru: Не в каждой именной фразе будет прилагательное из каждой категории, но если они есть, то должен соблюдаться именно этот порядок. Самая распространенная ошибка — путаница в порядке категорий «Мнение» и «Размер/Возраст».
uk: Не кожна іменна група матиме прикметник з кожної категорії, але якщо вони є, саме такого порядку вони повинні дотримуватися. Найпоширенішою помилкою є переплутування порядку Оцінки та Розміру/Віку.

source: Correct:
ru: Правильно:
uk: Правильно:

source: Incorrect:
ru: Неправильно:
uk: Неправильно:

source: Remember, an article always comes before the entire string of adjectives.
ru: Помните, что артикль всегда стоит перед всей цепочкой прилагательных.
uk: Пам'ятайте, що артикль завжди стоїть перед усім рядком прикметників.

source: Adjective: Syntactic Functions
ru: Прилагательное: Синтаксические функции
uk: Прикметник: Синтаксичні функції

source: Syntactic Functions
ru: Синтаксические функции
uk: Синтаксичні функції

source: In a sentence, adjectives primarily perform one of two syntactic functions: they can either describe a noun directly within a noun phrase (attributive function) or serve as the complement of a verb (predicative function).
ru: В предложении прилагательные в основном выполняют одну из двух синтаксических функций: они могут либо непосредственно описывать существительное внутри именной фразы (атрибутивная функция), либо служить дополнением глагола (предикативная функция).
uk: У реченні прикметники переважно виконують одну з двох синтаксичних функцій: вони можуть або описувати іменник безпосередньо в іменній групі (означувальна функція), або слугувати доповненням до дієслова (предикативна функція).

source: 1. Attributive Function
ru: 1. Атрибутивная функция
uk: 1. Означувальна функція

source: An adjective used attributively modifies a noun or pronoun directly. It typically comes right before the noun it describes.
ru: Прилагательное, используемое атрибутивно, непосредственно определяет существительное или местоимение. Оно обычно стоит непосредственно перед существительным, которое описывает.
uk: Прикметник, що використовується як означення, безпосередньо модифікує іменник або займенник. Зазвичай він стоїть безпосередньо перед іменником, який описує.

source: ' is part of the noun phrase '
ru: ' является частью именной фразы '
uk: ' є частиною іменної групи '

source: ' and describes 'flower'.
ru: ' и описывает 'flower' (цветок).
uk: ' та описує 'квітку'.

source: ' modifies the noun 'house'.
ru: ' определяет существительное 'house' (дом).
uk: ' модифікує іменник 'будинок'.

source: <strong>Note:</strong> In some cases, usually with multi-word adjectives or for emphasis, the adjective can come after the noun (e.g.,
ru: <strong>Примечание:</strong> В некоторых случаях, обычно с многословными прилагательными или для выделения, прилагательное может стоять после существительного (например,
uk: <strong>Примітка:</strong> У деяких випадках, зазвичай із багатослівними прикметниками або для наголосу, прикметник може стояти після іменника (наприклад,

source: 2. Predicative Function
ru: 2. Предикативная функция
uk: 2. Предикативна функція

source: An adjective used predicatively describes the subject of a sentence, but it is separated from the subject by a verb, typically a linking verb like
ru: Прилагательное, используемое предикативно, описывает подлежащее предложения, но отделено от подлежащего глаголом, обычно глаголом-связкой, таким как
uk: Прикметник, що використовується предикативно, описує підмет речення, але відокремлений від нього дієсловом, зазвичай дієсловом-зв'язкою, як

source: ' follows the verb 'is' and describes the subject 'flower'.
ru: ' следует за глаголом 'is' (есть) и описывает подлежащее 'flower' (цветок).
uk: ' стоїть після дієслова 'is' та описує підмет 'квітка'.
