Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: These nouns are more specific and are used in particular contexts.
ru: Эти существительные более специфичны и используются в определенных контекстах.
uk: Ці іменники є більш специфічними та використовуються в певних контекстах.

source: In British English, a collective noun can take either a singular or a plural verb, depending on whether you are thinking of the group as a single unit or as individual members. In American English, a singular verb is almost always used.
ru: В британском английском собирательное существительное может принимать как глагол в единственном, так и во множественном числе, в зависимости от того, рассматриваете ли вы группу как единое целое или как отдельных членов. В американском английском почти всегда используется глагол в единственном числе.
uk: У британській англійській збірний іменник може вживатися з дієсловом як в однині, так і в множині, залежно від того, розглядаєте ви групу як єдине ціле чи як окремих членів. В американській англійській майже завжди використовується дієслово в однині.

source: Singular Verb (as a unit):
ru: Глагол в единственном числе (как единица):
uk: Дієслово в однині (як одиниця):

source: Plural Verb (as individuals) - British English:
ru: Глагол во множественном числе (как отдельные лица) - Британский английский:
uk: Дієслово у множині (як окремі особи) - Британська англійська:

source: Nouns as Subjects
ru: Существительные в качестве подлежащих
uk: Іменники як підмети

source: When a noun in the common case performs the action in a sentence, it is the subject.
ru: Когда существительное в общем падеже совершает действие в предложении, оно является подлежащим.
uk: Коли іменник у загальному відмінку виконує дію в реченні, він є підметом.

source: Subject Noun
ru: Существительное-подлежащее
uk: Іменник-підмет

source: Nouns as Objects
ru: Существительные в качестве дополнений
uk: Іменники як додатки

source: When a noun in the common case receives the action of the verb, it is the object.
ru: Когда существительное в общем падеже принимает на себя действие глагола, оно является дополнением.
uk: Коли іменник у загальному відмінку отримує дію дієслова, він є додатком.

source: Object Noun
ru: Существительное-дополнение
uk: Іменник-додаток

source: It's important to note that the form of the noun (
uk: Важливо зазначити, що форма іменника (

source: Forms of Compound Nouns
ru: Формы составных существительных
uk: Форми складених іменників

source: Compound nouns can be written in three different ways:
ru: Составные существительные могут быть написаны тремя различными способами:
uk: Складені іменники можуть записуватися трьома різними способами:

source: Closed Form
ru: Слитная форма
uk: Закрита форма (разом)

source: Written as a single word, with no spaces or hyphens.
ru: Пишется как одно слово, без пробелов или дефисов.
uk: Записується як одне слово, без пробілів чи дефісів.

source: Hyphenated Form
ru: Дефисная форма
uk: Форма з дефісом

source: Written with a hyphen between the words.
ru: Пишется с дефисом между словами.
uk: Записується з дефісом між словами.

source: Open Form
ru: Раздельная форма
uk: Відкрита форма (окремо)

source: Written as separate words, but together they function as a single noun.
ru: Пишется как отдельные слова, но вместе они функционируют как одно существительное.
uk: Записується як окремі слова, але разом вони функціонують як один іменник.

source: Closed
ru: Слитно
uk: Закрита

source: Hyphenated
ru: Через дефис
uk: З дефісом

source: Open
ru: Раздельно
uk: Відкрита

source: Forming Plurals of Compound Nouns
ru: Образование множественного числа составных существительных
uk: Утворення множини складених іменників

source: The way you form the plural of a compound noun depends on its structure.
ru: Способ образования множественного числа составного существительного зависит от его структуры.
uk: Спосіб утворення множини складеного іменника залежить від його структури.

source: Most common nouns:
ru: Наиболее распространенные существительные:
uk: Найпоширеніші іменники (закрита форма):

source: Add '-s' to the end of the noun.
ru: Добавьте '-s' в конец существительного.
uk: Додайте '-s' до кінця іменника.

source: Hyphenated nouns:
ru: Существительные с дефисом:
uk: Іменники з дефісом:

source: Add '-s' to the most significant word (usually the noun).
ru: Добавьте '-s' к наиболее значимому слову (обычно к существительному).
uk: Додайте '-s' до найбільш значущого слова (зазвичай іменника).

source: Open form nouns:
ru: Существительные в раздельной форме:
uk: Іменники відкритої форми:

source: Add '-s' to the end of the noun part of the phrase.
ru: Добавьте '-s' к существительной части фразы.
uk: Додайте '-s' до кінця іменникової частини фрази.

source: Concrete vs Abstract Nouns
ru: Конкретные vs. абстрактные существительные
uk: Конкретні проти абстрактних іменників

source: Nouns can be classified based on whether they refer to tangible things that can be perceived with the five senses or intangible concepts. This distinction helps to better understand the nature of a noun.
ru: Существительные можно классифицировать в зависимости от того, относятся ли они к материальным вещам, которые можно воспринять пятью органами чувств, или к нематериальным понятиям. Это различие помогает лучше понять природу существительного.
uk: Іменники можна класифікувати на основі того, чи позначають вони матеріальні речі, які можна сприйняти п'ятьма відчуттями, чи нематеріальні поняття. Це розрізнення допомагає краще зрозуміти природу іменника.

source: Concrete Nouns
ru: Конкретные существительные
uk: Конкретні іменники

source: Sense
ru: Чувство
uk: Відчуття

source: Sight
ru: Зрение
uk: Зір

source: Sound
ru: Слух
uk: Слух

source: Smell
ru: Обоняние
uk: Нюх

source: Touch
ru: Осязание
uk: Дотик

source: Taste
ru: Вкус
uk: Смак

source: Most common nouns and all proper nouns are concrete nouns.
ru: Большинство нарицательных существительных и все имена собственные являются конкретными существительными.
uk: Більшість загальних іменників і всі власні іменники є конкретними.

source: Abstract Nouns
ru: Абстрактные существительные
uk: Абстрактні іменники

source: Emotions
ru: Эмоции
uk: Емоції

source: Qualities
ru: Качества
uk: Якості

source: Concepts
ru: Понятия
uk: Поняття

source: States
ru: Состояния
uk: Стани

source: Some abstract nouns can be formed by adding a suffix to an adjective or verb (e.g.,
uk: Деякі абстрактні іменники можуть утворюватися додаванням суфікса до прикметника або дієслова (наприклад,

source: Countable/Uncountable Nouns
ru: Исчисляемые/неисчисляемые существительные
uk: Злічувані/Незлічувані іменники

source: Nouns can be divided into two main categories based on whether they can be counted. This distinction affects the use of articles, determiners, and verb agreement.
ru: Существительные можно разделить на две основные категории в зависимости от того, можно ли их посчитать. Это различие влияет на использование артиклей, определителей и согласование глаголов.
uk: Іменники можна розділити на дві основні категорії залежно від того, чи можна їх порахувати. Це розрізнення впливає на вживання артиклів, визначників та узгодження дієслів.

source: Countable Nouns
ru: Исчисляемые существительные
uk: Злічувані іменники

source: Sentence Example
ru: Пример предложения
uk: Приклад речення

source: Key Rules for Countable Nouns
ru: Ключевые правила для исчисляемых существительных
uk: Ключові правила для злічуваних іменників

source: They can be used with numbers:
ru: Они могут использоваться с числами:
uk: Вони можуть використовуватися з числами:

source: They can be used with indefinite articles
uk: Вони можуть використовуватися з неозначеними артиклями

source: They can be used with quantifiers like
uk: Вони можуть використовуватися з квантифікаторами, такими як

source: Uncountable Nouns
ru: Неисчисляемые существительные
uk: Незлічувані іменники

source: Liquids
ru: Жидкости
uk: Рідини

source: Materials
ru: Материалы
uk: Матеріали

source: Abstract Ideas
ru: Абстрактные идеи
uk: Абстрактні ідеї

source: Fields of Study
ru: Области обучения
uk: Галузі знань/науки

source: Key Rules for Uncountable Nouns
ru: Ключевые правила для неисчисляемых существительных
uk: Ключові правила для незлічуваних іменників

source: They cannot be used with numbers directly.
ru: Они не могут использоваться напрямую с числами.
uk: Вони не можуть використовуватися безпосередньо з числами.

source: They do not take the indefinite articles
uk: Вони не приймають неозначені артиклі

source: They are used with quantifiers like
uk: Вони використовуються з квантифікаторами, такими як

source: To count them, we use phrases like
uk: Щоб їх порахувати, ми використовуємо фрази, як-от

source: Nouns that can be both
ru: Существительные, которые могут быть и теми, и другими
uk: Іменники, які можуть бути і тими, і іншими

source: Some nouns can be either countable or uncountable, depending on the context and meaning.
ru: Некоторые существительные могут быть как исчисляемыми, так и неисчисляемыми, в зависимости от контекста и значения.
uk: Деякі іменники можуть бути як злічуваними, так і незлічуваними, залежно від контексту та значення.

source: Countable:
ru: Исчисляемое:
uk: Злічуваний:

source: Uncountable:
ru: Неисчисляемое:
uk: Незлічуваний:

source: Singular and Plural
ru: Единственное и множественное число
uk: Однина та множина

source: Number
ru: Число
uk: Число

source: Close to the speaker
ru: Близко к говорящему
uk: Близько до мовця

source: Far from the speaker
ru: Далеко от говорящего
uk: Далеко від мовця

source: Demonstratives as Determiners vs. Pronouns
ru: Указательные слова как определители vs. местоимения
uk: Вказівні як визначники проти займенників

source: Demonstratives can function as both determiners and pronouns. The distinction depends on whether they are followed by a noun.
ru: Указательные слова могут функционировать как определители и как местоимения. Различие зависит от того, следует ли за ними существительное.
uk: Вказівні можуть функціонувати як визначники, так і як займенники. Відмінність залежить від того, чи йде за ними іменник.

source: Followed by a noun.
ru: Последующее существительное.
uk: Йде за іменником.

source: Stands alone, replacing a noun.
ru: Стоит отдельно, заменяя существительное.
uk: Стоїть окремо, замінюючи іменник.

source: Close and Singular:
ru: Близко и единственное число:
uk: Близько та в однині:

source: Far and Singular:
ru: Далеко и единственное число:
uk: Далеко та в однині:

source: Close and Plural:
ru: Близко и множественное число:
uk: Близько та у множині:

source: Far and Plural:
ru: Далеко и множественное число:
uk: Далеко та у множині:

source: Nouns can function as either a
uk: Іменники можуть функціонувати як

source: Position of the Indirect Object
ru: Положение косвенного дополнения
uk: Позиція непрямого додатка

source: The indirect object can be rephrased using a prepositional phrase, usually with
uk: Непрямий додаток може бути перефразований за допомогою прийменникової фрази, зазвичай з

source: While English nouns themselves do not have grammatical gender, personal pronouns are chosen based on the natural gender of the person or animal they refer to. Understanding this relationship is crucial for correct sentence construction.
ru: Хотя сами английские существительные не имеют грамматического рода, личные местоимения выбираются на основе естественного пола человека или животного, на которое они ссылаются. Понимание этой взаимосвязи является ключевым для правильного построения предложения.
uk: Хоча іменники в англійській мові самі по собі не мають граматичного роду, особові займенники обираються на основі природного роду особи чи тварини, на яку вони посилаються. Розуміння цього взаємозв'язку є вирішальним для правильної побудови речень.

source: Pronouns for People
ru: Местоимения для людей
uk: Займенники для людей

source: Pronouns are used to replace nouns. The choice of pronoun depends on the gender of the person.
ru: Местоимения используются для замены существительных. Выбор местоимения зависит от пола человека.
uk: Займенники використовуються для заміни іменників. Вибір займенника залежить від статі/гендеру особи.

source: Gender
ru: Пол
uk: Рід/Гендер

source: Possessive
ru: Притяжательное
uk: Присвійний

source: Masculine
ru: Мужской
uk: Чоловічий

source: Feminine
ru: Женский
uk: Жіночий

source: Common/Unknown
ru: Общий/Неизвестный
uk: Спільний/Невідомий

source: Modern English widely uses singular
uk: Сучасна англійська широко використовує однину

source: Pronouns for Objects and Animals
ru: Местоимения для предметов и животных
uk: Займенники для об'єктів і тварин

source: The pronoun
uk: Займенник

source: Exceptions for Animals
ru: Исключения для животных
uk: Винятки для тварин

source: When the gender of a pet or a specific animal is known, it is common to use
uk: Коли стать/гендер домашнього улюбленця або конкретної тварини відома, зазвичай використовують

source: Figurative Gender
ru: Фигуративный род
uk: Образний рід

source: In some contexts, especially in poetic or traditional language, inanimate objects can be personified and referred to with gender-specific pronouns. This is becoming less common in modern usage.
ru: В некоторых контекстах, особенно в поэтическом или традиционном языке, неодушевленные предметы могут быть олицетворены и обозначены местоимениями, указывающими на пол. Это становится менее распространенным в современном употреблении.
uk: У деяких контекстах, особливо в поетичній або традиційній мові, неживі предмети можуть бути персоніфіковані, і на них можна посилатися за допомогою гендерно-специфічних займенників. Це стає менш поширеним у сучасному вжитку.

source: Why Use Gender-Neutral Terms?
ru: Зачем использовать гендерно-нейтральные термины?
uk: Навіщо використовувати гендерно-нейтральні терміни?

source: Using gender-neutral language is a way of showing respect for all people, regardless of their gender identity. It helps to:
ru: Использование гендерно-нейтрального языка — это способ проявить уважение ко всем людям, независимо от их гендерной идентичности. Это помогает:
uk: Використання гендерно-нейтральної мови – це спосіб проявити повагу до всіх людей, незалежно від їхньої гендерної ідентичності. Це допомагає:

source: Avoid making assumptions about a person's gender.
ru: Избегать предположений о поле человека.
uk: Уникнути припущень щодо гендеру особи.

source: Include people who are non-binary or do not identify as male or female.
ru: Включать людей, которые являются небинарными или не идентифицируют себя как мужчины или женщины.
uk: Включити людей, які є небінарними або не ідентифікують себе як чоловік чи жінка.

source: Promote equal opportunities by not associating certain professions with a specific gender.
ru: Продвигать равные возможности, не связывая определенные профессии с конкретным полом.
uk: Сприяти рівним можливостям, не асоціюючи певні професії з конкретним гендером.

source: Gender-Neutral Job Titles
ru: Гендерно-нейтральные названия должностей
uk: Гендерно-нейтральні назви посад

source: Many traditional job titles have been replaced with gender-neutral alternatives.
ru: Многие традиционные названия должностей были заменены гендерно-нейтральными альтернативами.
uk: Багато традиційних назв посад було замінено на гендерно-нейтральні альтернативи.

source: Gender-Specific Term
ru: Гендерно-специфический термин
uk: Гендерно-специфічний термін

source: Gender-Neutral Term
ru: Гендерно-нейтральный термин
uk: Гендерно-нейтральний термін

source: Gender-Neutral Pronouns and General Terms
ru: Гендерно-нейтральные местоимения и общие термины
uk: Гендерно-нейтральні займенники та загальні терміни

source: Beyond job titles, using gender-neutral pronouns and general terms is also a common practice.
ru: Помимо названий должностей, использование гендерно-нейтральных местоимений и общих терминов также является распространенной практикой.
uk: Окрім назв посад, використання гендерно-нейтральних займенників та загальних термінів також є поширеною практикою.

source: Gender-Neutral Alternative
ru: Гендерно-нейтральная альтернатива
uk: Гендерно-нейтральна альтернатива

source: In some cases, the gender of a noun is indicated by a special suffix added to the root word. These suffixes typically turn a masculine noun into a feminine one.
ru: В некоторых случаях род существительного обозначается специальным суффиксом, добавленным к корневому слову. Эти суффиксы обычно превращают существительное мужского рода в существительное женского рода.
uk: У деяких випадках рід/гендер іменника позначається спеціальним суфіксом, доданим до кореневого слова. Ці суфікси зазвичай перетворюють іменник чоловічого роду на іменник жіночого роду.

source: While these forms were common in the past, modern English tends to use gender-neutral nouns to avoid gender bias, making many of these suffixes less common today.
ru: Хотя эти формы были распространены в прошлом, современный английский язык, как правило, использует гендерно-нейтральные существительные, чтобы избежать гендерной предвзятости, что делает многие из этих суффиксов менее распространенными сегодня.
uk: Хоча ці форми були поширені в минулому, сучасна англійська мова має тенденцію використовувати гендерно-нейтральні іменники, щоб уникнути гендерної упередженості, що робить багато з цих суфіксів менш поширеними сьогодні.

source: Common Gender Suffixes
ru: Распространенные суффиксы рода
uk: Поширені гендерні суфікси

source: The most common suffix used to create a feminine noun is
uk: Найпоширенішим суфіксом, що використовується для створення іменника жіночого роду, є

source: Note
ru: Примечание
uk: Примітка

source: Still common, but
uk: Все ще поширений, але

source: Gender-neutral
uk: Гендерно-нейтральний

source: Very common.
ru: Очень распространен.
uk: Дуже поширений.

source: Still in use.
ru: Все еще используется.
uk: Все ще використовується.

source: Other Suffixes
ru: Другие суффиксы
uk: Інші суфікси

source: Other, less common suffixes can also indicate gender.
ru: Другие, менее распространенные суффиксы также могут указывать на род.
uk: Інші, менш поширені суфікси також можуть вказувати на рід/гендер.

source: Modern Usage and Recommendations
ru: Современное использование и рекомендации
uk: Сучасне вживання та рекомендації

source: In contemporary writing and speech, it is generally recommended to use gender-neutral nouns unless the gender is specific and relevant to the context.
ru: В современном письме и речи, как правило, рекомендуется использовать гендерно-нейтральные существительные, если пол не является специфическим и актуальным для контекста.
uk: У сучасному письмі та мовленні, як правило, рекомендується використовувати гендерно-нейтральні іменники, якщо стать/гендер не є специфічною та важливою для контексту.

source: Instead of
uk: Замість

source: The Interrogative Determiners
ru: Вопросительные определители
uk: Питальні визначники

source: Determiner
ru: Определитель
uk: Визначник

source: Used when there is a limited or specific choice of items.
ru: Используется, когда есть ограниченный или конкретный выбор предметов.
uk: Використовується, коли є обмежений або конкретний вибір предметів.

source: Used when there is an unlimited or general choice.
ru: Используется, когда есть неограниченный или общий выбор.
uk: Використовується, коли є необмежений або загальний вибір.

source: Used to ask about possession.
ru: Используется, чтобы спросить о принадлежности.
uk: Використовується для запитання про володіння (приналежність).

source: Detailed Explanations
ru: Подробные объяснения
uk: Детальні пояснення

source: Using 'Which':
ru: Использование 'Which':
uk: Використання 'Which':

source: Using 'What':
ru: Использование 'What':
uk: Використання 'What':

source: Using 'Whose':
ru: Использование 'Whose':
uk: Використання 'Whose':

source: Shared Possession
ru: Совместное владение
uk: Спільне володіння

source: When two or more nouns share a single item, ownership is indicated by adding
uk: Коли два або більше іменників мають спільний предмет, володіння позначається додаванням

source: Possessive is added to the last noun.
ru: Притяжательный падеж добавляется к последнему существительному.
uk: Присвійний відмінок додається до останнього іменника.

source: They own one car together.
ru: Они владеют одной машиной вместе.
uk: Вони разом володіють однією машиною.

source: They all worked on one project together.
ru: Они все работали над одним проектом вместе.
uk: Вони всі разом працювали над одним проєктом.

source: Separate Possession
ru: Раздельное владение
uk: Окреме володіння

source: When two or more nouns possess their own separate items, ownership is indicated by adding 's to each noun.
uk: Коли два або більше іменників володіють своїми окремими предметами, володіння позначається додаванням 's до кожного іменника.

source: Possessive is added to each noun.
ru: Притяжательный падеж добавляется к каждому существительному.
uk: Присвійний відмінок додається до кожного іменника.

source: Maria owns one car, and Tom owns another.
ru: Мария владеет одной машиной, а Том владеет другой.
uk: Марія володіє однією машиною, а Том – іншою.

source: The student's book is on the table, and the teacher's book is also on the table.
ru: Книга студента лежит на столе, и книга учителя тоже лежит на столе.
uk: Книга студента лежить на столі, і книга вчителя також лежить на столі.

source: In English, some nouns have distinct forms to specify the gender of a person or an animal. These are known as "gender-specific nouns" or "male-female pairs."
uk: В англійській мові деякі іменники мають різні форми для позначення статі/гендеру людини або тварини. Вони відомі як "гендерно-специфічні іменники" або "чоловічо-жіночі пари."

source: While many of these pairs exist, modern English tends to favor gender-neutral terms (e.g., "flight attendant" instead of "stewardess").
uk: Хоча багато з цих пар існує, сучасна англійська має тенденцію віддавати перевагу гендерно-нейтральним термінам (наприклад, "бортпровідник" замість "стюардеса").

source: Pairs for People
ru: Пары для людей
uk: Пари для людей

source: Pairs for Animals
ru: Пары для животных
uk: Пари для тварин

source: Unlike many other languages, English nouns do not have grammatical gender. Instead, nouns have a "natural gender" that corresponds to the sex of the person or animal.
uk: На відміну від багатьох інших мов, англійські іменники не мають граматичного роду. Натомість, іменники мають "природний рід", що відповідає статі людини або тварини.

source: Masculine Nouns
ru: Существительные мужского рода
uk: Іменники чоловічого роду

source: These nouns refer to male persons or animals. They are typically replaced by the pronoun "he" or "him."
uk: Ці іменники стосуються осіб чоловічої статі або тварин. Вони зазвичай замінюються займенником "he" або "him."

source: Feminine Nouns
ru: Существительные женского рода
uk: Іменники жіночого роду

source: These nouns refer to female persons or animals. They are replaced by the pronoun "she" or "her."
uk: Ці іменники стосуються осіб жіночої статі або тварин. Вони замінюються займенником "she" або "her."

source: Common Gender
ru: Общий род
uk: Спільний рід

source: Many nouns in English are of a "common gender," meaning they can refer to either male or female.
uk: Багато іменників в англійській мові мають "спільний рід", що означає, вони можуть стосуватися як чоловічої, так і жіночої статі.

source: Using Pronouns with Common Nouns
ru: Использование местоимений с существительными общего рода
uk: Використання займенників зі спільними іменниками

source: When the gender of a common noun is unknown, modern English often uses singular "they" or "them" for gender neutrality.
uk: Коли стать/гендер спільного іменника невідома, сучасна англійська часто використовує однину "they" або "them" для гендерної нейтральності.
