Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: The present tense \
ru: Настоящее время ***смещается (backshifts)*** на соответствующее прошедшее время
uk: Теперішній час \

source: This \
ru: Это ***смещение (backshifting)*** — изменение времени на одно в прошлое — необходимо для сохранения временной логики относительно прошедшего глагола в главном предложении.
uk: Це \

source: Why is the Sequence of Tenses Important?
ru: Почему согласование времен важно?
uk: Чому Узгодження Часів Важливе?

source: Adhering to the sequence of tenses is crucial for:
ru: Соблюдение согласования времен имеет решающее значение для:
uk: Дотримання узгодження часів має вирішальне значення для:

source: Clarity and Coherence:
ru: Ясности и связности:
uk: Ясності та Послідовності:

source: It helps avoid confusion about the timeline of events. If the main verb is past, but the subordinate clause is present, it can create a jarring and illogical sense of time.
ru: Это помогает избежать путаницы с хронологией событий. Если глагол в главном предложении стоит в прошедшем времени, а придаточное — в настоящем, это может создать резкое и нелогичное ощущение времени.
uk: Це допомагає уникнути плутанини щодо часової шкали подій. Якщо головне дієслово стоїть у минулому, а підрядне речення – у теперішньому, це може створити різке та нелогічне відчуття часу.

source: Grammatical Correctness:
ru: Грамматической правильности:
uk: Граматичної Правильності:

source: It's a standard rule in formal and often informal English, and ignoring it can lead to grammatically incorrect sentences.
ru: Это стандартное правило в формальном и часто неформальном английском, и его игнорирование может привести к грамматически неверным предложениям.
uk: Це стандартне правило у формальній і часто неформальній англійській мові, і його ігнорування може призвести до граматично неправильних речень.

source: Natural Flow:
ru: Естественности речи:
uk: Природності Викладу:

source: Sentences that follow this rule sound more natural and are easier for native speakers to understand.
ru: Предложения, следующие этому правилу, звучат более естественно и легче для понимания носителями языка.
uk: Речення, які дотримуються цього правила, звучать більш природно і легше для розуміння носіями мови.

source: Common Scenarios for Sequence of Tenses
ru: Распространенные сценарии для согласования времен
uk: Поширені Сценарії Для Узгодження Часів

source: The rule applies most frequently in sentences involving <span class=\
ru: Правило наиболее часто применяется в предложениях, включающих ***косвенную речь (reported speech)*** <span class=\
uk: Правило найчастіше застосовується в реченнях, що включають <span class=\

source: Original Tense (in Direct Speech / Independent Clause)
ru: Исходное время (в прямой речи / независимом предложении)
uk: Оригінальний Час (у Прямій Мові / Незалежному Реченні)

source: Backshifted Tense (in Subordinate Clause)
ru: Смещенное время (в придаточном предложении)
uk: Зміщений Час (у Підрядному Реченні)

source: Past Perfect Continuous
uk: Минулий Доконано-Тривалий Час (Past Perfect Continuous)

source: The past simple often shifts to past perfect for clarity
ru: Past Simple часто смещается на Past Perfect для ясности
uk: Past simple часто зміщується до Past perfect для ясності

source: Conditional Simple
ru: Conditional Simple (Would + V1)
uk: Простий Умовний Час (Conditional Simple)

source: Conditional Continuous
ru: Conditional Continuous (Would be + Ving)
uk: Тривалий Умовний Час (Conditional Continuous)

source: Conditional Perfect
ru: Conditional Perfect (Would have + V3)
uk: Доконаний Умовний Час (Conditional Perfect)

source: Future Perfect Continuous
uk: Майбутній Доконано-Тривалий Час (Future Perfect Continuous)

source: Conditional Perfect Continuous
ru: Conditional Perfect Continuous (Would have been + Ving)
uk: Доконано-Тривалий Умовний Час (Conditional Perfect Continuous)

source: Exceptions to the Rule
ru: Исключения из правила
uk: Винятки з Правила

source: While the rule is generally consistent, there are important exceptions where backshifting does <i>not</i> occur:
ru: Хотя правило в целом последовательно, существуют важные исключения, при которых смещение ***не*** происходит:
uk: Хоча правило, як правило, послідовне, існують важливі винятки, коли зміщення <i>не</i> відбувається:

source: General Truths or Facts:
ru: Общие истины или факты:
uk: Загальні Істини або Факти:

source: If the reported statement expresses a universal truth or a timeless fact, the tense in the subordinate clause remains present.
ru: Если сообщаемое утверждение выражает всеобщую истину или вечный факт, время в придаточном предложении остается настоящим.
uk: Якщо повідомлене твердження виражає загальновідому істину або позачасовий факт, час у підрядному реченні залишається теперішнім.

source: Not \
ru: Не \
uk: Не \

source: Statements that are Still True/Relevant in the Present:
ru: Утверждения, которые до сих пор верны/актуальны в настоящем:
uk: Твердження, які Все Ще Є Правдивими/Актуальними У Теперішньому Часі:

source: If the reported statement is still true or relevant at the time of reporting, the tense in the subordinate clause can often remain in its original present form. This is especially common in informal contexts.
ru: Если сообщаемое утверждение все еще верно или актуально на момент сообщения, время в придаточном предложении часто может оставаться в своей первоначальной форме настоящего времени. Это особенно распространено в неформальных контекстах.
uk: Якщо повідомлене твердження все ще є правдивим або актуальним на момент повідомлення, час у підрядному реченні часто може залишатися у своїй початковій теперішній формі. Це особливо поширено в неформальних контекстах.

source: If she is still tired right now.
ru: Если она все еще устала прямо сейчас.
uk: Якщо вона все ще втомлена прямо зараз.

source: If he still lives in London.
ru: Если он все еще живет в Лондоне.
uk: Якщо він все ще живе в Лондоні.

source: However, backshifting is always grammatically safe:
ru: Однако смещение всегда грамматически безопасно:
uk: Однак, зміщення завжди є граматично безпечним:

source: Hypothetical Situations/Unreal Conditionals:
ru: Гипотетические ситуации/нереальные условные предложения:
uk: Гіпотетичні Ситуації/Нереальні Умовні Речення:

source: Tenses in conditional clauses (Type 2 and Type 3) generally do not backshift.
ru: Времена в условных придаточных предложениях (Тип 2 и Тип 3) обычно не смещаются.
uk: Часи в умовних реченнях (Типу 2 та Типу 3) зазвичай не зміщуються.

source: Specific Time Reference (Optional Backshift):
ru: Конкретная ссылка на время (опциональное смещение):
uk: Конкретна Часова Згадка (Необов'язкове Зміщення):

source: If the subordinate clause includes a specific time reference that makes the past action clear, backshifting the Past Simple is often optional (though Past Perfect is always safe).
ru: Если придаточное предложение включает конкретную ссылку на время, которая делает прошедшее действие ясным, смещение Past Simple часто необязательно (хотя Past Perfect всегда безопасен).
uk: Якщо підрядне речення містить конкретну часову згадку, яка робить минулу дію зрозумілою, зміщення Past Simple часто є необов'язковим (хоча Past Perfect завжди є безпечним).

source: Still clear it was yesterday
ru: Все еще ясно, что это было вчера
uk: Все ще зрозуміло, що це було вчора

source: Also correct and safe
ru: Также правильно и безопасно
uk: Також правильно та безпечно

source: Understanding the General Rule for Sequence of Tenses, along with its exceptions, is key to forming grammatically correct and clear complex sentences in English, particularly when reporting what someone else said or thought.
ru: Понимание Общего правила согласования времен, наряду с его исключениями, является ключом к формированию грамматически правильных и ясных сложных предложений в английском языке, особенно при сообщении о том, что сказал или подумал кто-то другой.
uk: Розуміння Загального Правила Узгодження Часів, а також його винятків, є ключем до формування граматично правильних і зрозумілих складних речень в англійській мові, особливо при передачі того, що сказав або подумав хтось інший.

source: Transitive and Intransitive Verbs
ru: Переходные и непереходные глаголы
uk: Перехідні та Неперехідні Дієслова

source: English verbs can be classified into two main categories based on whether they require a direct object to complete their meaning: <span class=\
ru: Английские глаголы можно классифицировать на две основные категории в зависимости от того, требуют ли они прямого дополнения для завершения своего значения: ***переходные и непереходные глаголы*** <span class=\
uk: Англійські дієслова можна розділити на дві основні категорії залежно від того, чи вимагають вони прямого додатку для завершення свого значення: <span class=\

source: Transitive Verbs (Переходные глаголы)
ru: Переходные глаголы (Transitive Verbs)
uk: Перехідні Дієслова (Transitive Verbs)

source: To identify a transitive verb, ask 'what?' or 'whom?' after the verb. If there's an answer, the verb is transitive.
ru: Чтобы определить переходный глагол, спросите 'что?' или 'кого?' после глагола. Если есть ответ, глагол является переходным.
uk: Щоб визначити перехідне дієслово, запитайте 'що?' або 'кого?' після дієслова. Якщо є відповідь, дієслово є перехідним.

source: Reads what? – a book
ru: Читает что? – книгу
uk: Читає що? – книгу

source: Wrote what? – a letter
ru: Написал что? – письмо
uk: Написав що? – листа

source: Built what? – a house
ru: Построил что? – дом
uk: Побудував що? – будинок

source: Saw whom? – John
ru: Увидел кого? – Джона
uk: Бачив кого? – Джона

source: The direct object is typically a noun or pronoun that directly receives the action.
ru: Прямое дополнение, как правило, представляет собой существительное или местоимение, которое непосредственно принимает действие.
uk: Прямий додаток – це, як правило, іменник або займенник, який безпосередньо приймає дію.

source: Intransitive Verbs (Непереходные глаголы)
ru: Непереходные глаголы (Intransitive Verbs)
uk: Неперехідні Дієслова (Intransitive Verbs)

source: Intransitive verbs cannot have a direct object. Asking 'what?' or 'whom?' after an intransitive verb will not yield a direct answer about an object receiving the action.
ru: Непереходные глаголы не могут иметь прямого дополнения. Вопрос 'что?' или 'кого?' после непереходного глагола не даст прямого ответа о дополнении, принимающем действие.
uk: Неперехідні дієслова не можуть мати прямого додатку. Запитання 'що?' або 'кого?' після неперехідного дієслова не дасть прямої відповіді про об'єкт, який приймає дію.

source: Sleeps what? – no answer
ru: Поет что? – нет ответа
uk: Спить що? – немає відповіді

source: Sing what? – no answer
uk: Співає що? – немає відповіді

source: Laughed what? – no answer
ru: Смеялся что? – нет ответа
uk: Сміявся що? – немає відповіді

source: Arrived what? – no answer
ru: Прибыл что? – нет ответа
uk: Прибув що? – немає відповіді

source: Intransitive verbs can be followed by adverbs or prepositional phrases, but these are not direct objects.
ru: Непереходные глаголы могут сопровождаться наречиями или предложными фразами, но они не являются прямыми дополнениями.
uk: За неперехідними дієсловами можуть слідувати прислівники або прийменникові фрази, але вони не є прямими додатками.

source: Verbs that can be Both Transitive and Intransitive
ru: Глаголы, которые могут быть как переходными, так и непереходными
uk: Дієслова, які можуть бути як Перехідними, так і Неперехідними

source: Some verbs can function as both transitive and intransitive depending on the context in which they are used. The key is whether a direct object is present.
ru: Некоторые глаголы могут функционировать как переходные, так и непереходные, в зависимости от контекста их использования. Ключевым моментом является наличие прямого дополнения.
uk: Деякі дієслова можуть функціонувати як перехідні та неперехідні залежно від контексту, в якому вони використовуються. Ключовим є наявність прямого додатку.

source: Runs what? – a business
ru: Управляет чем? – бизнесом (Переходный)
uk: Керує чим? – бізнесом

source: Runs what? – no answer
ru: Бежит что? – нет ответа (Непереходный)
uk: Біжить що? – немає відповіді

source: Eats what? – an apple
ru: Ест что? – яблоко (Переходный)
uk: Їсть що? – яблуко

source: Eats what? – no answer
ru: Ест что? – нет ответа (Непереходный)
uk: Їсть що? – немає відповіді

source: Read what? – a book
ru: Читает что? – книгу (Переходный)
uk: Читає що? – книгу

source: Read what? – no answer
ru: Читает что? – нет ответа (Непереходный)
uk: Читає що? – немає відповіді

source: Understanding the distinction between transitive and intransitive verbs helps in constructing grammatically correct sentences and correctly identifying sentence structure.
ru: Понимание различия между переходными и непереходными глаголами помогает в построении грамматически правильных предложений и правильном определении структуры предложения.
uk: Розуміння різниці між перехідними та неперехідними дієсловами допомагає у побудові граматично правильних речень та правильному визначенні структури речення.

source: The Verb 'To Be'
ru: Глагол 'To Be'
uk: Дієслово 'To Be'

source: Forms of the Verb 'To Be'
ru: Формы глагола 'To Be'
uk: Форми Дієслова 'To Be'

source: Unlike most verbs, \
ru: В отличие от большинства глаголов, ***'To Be' является неправильным глаголом и имеет много форм***. <span class=\
uk: На відміну від більшості дієслів, \

source: for all persons
ru: для всех лиц
uk: для всіх осіб

source: Present Participle (V-ing form):
ru: Причастие настоящего времени (форма V-ing):
uk: Дієприкметник Теперішнього Часу (форма V-ing):

source: Past Participle (V3 form):
ru: Причастие прошедшего времени (форма V3):
uk: Дієприкметник Минулого Часу (форма V3):

source: Infinitive:
ru: Инфинитив:
uk: Інфінітив:

source: Uses of the Verb 'To Be'
ru: Использование глагола 'To Be'
uk: Використання Дієслова 'To Be'

source: As a Linking (Copular) Verb:
ru: 1. Как глагол-связка (Linking (Copular) Verb):
uk: Як Дієслово-Зв’язка (Copular Verb):

source: It connects the subject of a sentence to a noun, pronoun, or adjective that describes or identifies the subject.
ru: Он связывает подлежащее предложения с существительным, местоимением или прилагательным, которое описывает или идентифицирует подлежащее.
uk: Воно з'єднує підмет речення з іменником, займенником або прикметником, який описує або ідентифікує підмет.

source: links \
ru: связывает \
uk: з'єднує \

source: As an Auxiliary (Helping) Verb:
ru: 2. Как вспомогательный глагол (Auxiliary (Helping) Verb):
uk: Як Допоміжне Дієслово (Auxiliary / Helping Verb):

source: It is used to form various tenses and voices.
ru: Он используется для образования различных времен и залогов.
uk: Воно використовується для утворення різних часів та станів.

source: In Continuous (Progressive) Tenses:
ru: В длительных (Continuous/Progressive) временах:
uk: У Тривалих (Continuous / Progressive) Часах:

source: Used with the present participle (-ing form) to describe ongoing actions.
ru: Используется с причастием настоящего времени (формой -ing) для описания продолжающихся действий.
uk: Використовується з дієприкметником теперішнього часу (форма -ing) для опису тривалих дій.

source: In the Passive Voice:
ru: В пассивном залоге (Passive Voice):
uk: У Пасивному Стані (Passive Voice):

source: Used with the past participle (V3 form) to indicate that the subject is receiving the action.
ru: Используется с причастием прошедшего времени (формой V3) для указания того, что подлежащее принимает действие.
uk: Використовується з дієприкметником минулого часу (форма V3) для позначення того, що підмет приймає дію.

source: Present Continuous Passive
uk: Теперішній Тривалий Пасивний Стан (Present Continuous Passive)

source: To express existence or location (with \
ru: 3. Для выражения существования или местоположения (с ***'There is/are'***):
uk: Для вираження існування або місцезнаходження (з \

source: To express age:
ru: 4. Для выражения возраста:
uk: Для вираження віку:

source: To describe weather or time:
ru: 5. Для описания погоды или времени:
uk: Для опису погоди або часу:

source: Common Contractions with 'To Be'
ru: Распространенные сокращения с 'To Be'
uk: Поширені Скорочення з 'To Be'

source: In informal speech and writing, \
ru: В неформальной речи и письме глагол ***'To Be'*** <span class=\
uk: У неформальному мовленні та письмі \

source: Mastering the verb \
ru: Освоение глагола ***'To Be'*** <span class=\
uk: Опанування дієслова \

source: The Verb 'To Do'
ru: Глагол 'To Do'
uk: Дієслово 'To Do'

source: Forms of the Verb 'To Do'
ru: Формы глагола 'To Do'
uk: Форми Дієслова 'To Do'

source: Uses of the Verb 'To Do'
ru: Использование глагола 'To Do'
uk: Використання Дієслова 'To Do'

source: As a Main (Notional) Verb:
ru: 1. Как основной (смысловой) глагол (Main (Notional) Verb):
uk: Як Основне (Змістове) Дієслово:

source: In this role, it can be used in all tenses, just like any other main verb.
ru: В этой роли он может использоваться во всех временах, как и любой другой основной глагол.
uk: У цій ролі воно може використовуватися у всіх часах, як і будь-яке інше основне дієслово.

source: To form Questions:
ru: Для образования вопросов:
uk: Для Утворення Питань:

source: In the Present Simple and Past Simple, \
ru: В Present Simple и Past Simple глагол ***'do/does/did'*** <span class=\
uk: У Present Simple та Past Simple \

source: To form Negative Sentences:
ru: Для образования отрицательных предложений:
uk: Для Утворення Заперечних Речень:

source: For Emphasis:
ru: Для усиления (Emphasis):
uk: Для Наголосу:

source: Emphasizes belief
ru: Подчеркивает убеждение
uk: Наголошує на переконанні

source: In Short Answers:
ru: В кратких ответах (Short Answers):
uk: У Коротких Відповідях:

source: Used to avoid repeating the main verb in short answers.
ru: Используется для избежания повторения основного глагола в кратких ответах.
uk: Використовується, щоб уникнути повторення основного дієслова у коротких відповідях.

source: As a Pro-verb (Substitution):
ru: 3. Как заменяющий глагол (Pro-verb/Substitution):
uk: Як Замінник Дієслова (Pro-verb / Substitution):

source: instead of \
ru: вместо \
uk: замість \

source: Common Contractions with 'To Do'
ru: Распространенные сокращения с 'To Do'
uk: Поширені Скорочення з 'To Do'

source: Understanding the dual role of \
ru: Понимание двойной роли глагола ***'To Do'*** <span class=\
uk: Розуміння подвійної ролі \

source: The Verb 'To Have'
ru: Глагол 'To Have'
uk: Дієслово 'To Have'

source: Forms of the Verb 'To Have'
ru: Формы глагола 'To Have'
uk: Форми Дієслова 'To Have'

source: Uses of the Verb 'To Have'
ru: Использование глагола 'To Have'
uk: Використання Дієслова 'To Have'

source: To express possession or belonging:
ru: Для выражения владения или принадлежности:
uk: Для вираження володіння або приналежності:

source: In this sense, \
ru: В этом значении ***'have'*** <span class=\
uk: У цьому значенні \

source: To denote actions or experiences (often in set phrases):
ru: Для обозначения действий или опыта (часто в устойчивых фразах):
uk: Для позначення дій або досвіду (часто у сталих фразах):

source: In these expressions, \
ru: В этих выражениях ***'have'*** <span class=\
uk: У цих виразах \

source: It is used to form all perfect tenses (Present Perfect, Past Perfect, Future Perfect) and their continuous forms.
ru: Он используется для образования всех перфектных времен (Present Perfect, Past Perfect, Future Perfect) и их длительных форм.
uk: Воно використовується для утворення всіх доконаних часів (Present Perfect, Past Perfect, Future Perfect) та їхніх тривалих форм.

source: The phrase <span class=\
ru: Фраза ***'have got/has got'*** <span class=\
uk: Фраза <span class=\

source: Understanding the various roles of \
ru: Понимание различных ролей глагола ***'To Have'*** <span class=\
uk: Розуміння різних ролей \

source: The Verb
ru: Глагол
uk: Дієслово

source: Forms and Types of Verbs
ru: Формы и типы глаголов
uk: Форми та Типи Дієслів

source: Basic Verbs
ru: Базовые глаголы
uk: Основні Дієслова

source: Non-Finite Verb Forms
ru: Безличные формы глагола (Non-Finite Verb Forms)
uk: Неособові Форми Дієслова

source: Tenses
ru: Времена (Tenses)
uk: Часи

source: The Present Perfect Continuous
ru: Present Perfect Continuous
uk: Теперішній Доконано-Тривалий Час (Present Perfect Continuous)

source: Other Tense Topics
ru: Другие темы по временам
uk: Інші Теми Щодо Часів

source: The Sequence of Tenses: General Rule
ru: Согласование времен: Общее правило
uk: Узгодження Часів: Загальне Правило

source: The Sequence of Tenses: Exceptions
ru: Согласование времен: Исключения
uk: Узгодження Часів: Винятки

source: Moods
ru: Наклонения (Moods)
uk: Способи Дієслова

source: Voice
ru: Залог (Voice)
uk: Стан

source: Modal Verbs
ru: Модальные глаголы
uk: Модальні Дієслова

source: Translator
ru: Переводчик
uk: Перекладач

source: Auto
ru: Авто
uk: Авто

source: Russian
ru: Русский
uk: Російська

source: Ukrainian
ru: Украинский
uk: Українська

source: Enter text...
ru: Введите текст...
uk: Введіть текст...

source: Translate
ru: Перевести
uk: Перекласти

source: Translation...
ru: Перевод...
uk: Переклад...

source: Navigation
ru: Навигация
uk: Навігація

source: Cards
ru: Карточки
uk: Картки

source: Texts
ru: Тексты
uk: Тексти

source: Tests
ru: Тесты
uk: Тести

source: Contact Us
ru: Связаться с нами
uk: Зв'язатися з нами

source: Feedback
ru: Обратная связь
uk: Зворотний зв'язок

source: Report a Bug
ru: Сообщить об ошибке
uk: Повідомити про помилку

source: Follow Us
ru: Подписывайтесь на нас
uk: Слідкуйте за нами

source: Stay Updated
ru: Будьте в курсе
uk: Залишайтеся в курсі

source: Your Email
ru: Ваш Email
uk: Ваша електронна пошта

source: Subscribe
ru: Подписаться
uk: Підписатися

source: Privacy Policy
ru: Политика конфиденциальности
uk: Політика конфіденційності

source: Terms of Service
ru: Условия обслуживания
uk: Умови надання послуг

source: Welcome back, %(username)s!
ru: С возвращением, %(username)s!
uk: З поверненням, %(username)s!

source: Master English with ExdiEng
ru: Освойте английский с ExdiEng
uk: Опануйте англійську з ExdiEng

source: Continue your journey to English fluency with personalized lessons and progress tracking.
ru: Продолжайте свой путь к свободному владению английским языком с персонализированными уроками и отслеживанием прогресса.
uk: Продовжуйте свій шлях до вільного володіння англійською мовою за допомогою персоналізованих уроків та відстеження прогресу.

source: The most effective way to learn English vocabulary, grammar and reading skills.
ru: Самый эффективный способ изучения английской лексики, грамматики и навыков чтения.
uk: Найефективніший спосіб вивчити англійську лексику, граматику та навички читання.

source: Continue Learning
ru: Продолжить обучение
uk: Продовжити Навчання

source: Start Learning
ru: Начать обучение
uk: Почати Навчання

source: Login
ru: Войти
uk: Увійти

source: Words Learned
ru: Выучено слов
uk: Вивчено Слів

source: Tests Completed
ru: Завершено тестов
uk: Тестів Виконано

source: Day Streak
ru: Дней подряд
uk: Днів Поспіль

source: Why Choose ExdiEng?
ru: Почему выбирают ExdiEng?
uk: Чому варто обрати ExdiEng?

source: Smart Flashcards
ru: Умные карточки
uk: Розумні Картки

source: Learn vocabulary with our spaced repetition system for maximum retention.
ru: Изучайте лексику с нашей системой интервального повторения для максимального запоминания.
uk: Вивчайте лексику за допомогою нашої системи інтервального повторення для максимального запам'ятовування.

source: Reading Practice
ru: Практика чтения
uk: Практика Читання
