Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Slightly stronger emphasis on it being the right thing to do
ru: Немного более сильный акцент на том, что это правильное действие
uk: Трохи сильніший акцент на тому, що це правильно

source: In negative and interrogative forms, \
ru: В отрицательных и вопросительных формах \
uk: У заперечних та питальних формах, \

source: Forms of Shall / Will
ru: Формы Shall / Will
uk: Форми Shall / Will

source: As modal verbs, \
ru: Как модальные глаголы, \
uk: Як модальні дієслова, \

source: 1. Will (Most Common Future Tense Modal)
ru: 1. Will (Наиболее распространенный модальный глагол будущего времени)
uk: 1. Will (Найпоширеніше Модальне Дієслово Майбутнього Часу)

source: Subject + will ('ll) + Base Verb
ru: Подлежащее + will ('ll) + Базовый глагол
uk: Підмет + will ('ll) + Базова форма дієслова

source: Subject + will not / won't + Base Verb
ru: Подлежащее + will not / won't + Базовый глагол
uk: Підмет + will not / won't + Базова форма дієслова

source: Will + Subject + Base Verb?
ru: Will + Подлежащее + Базовый глагол?
uk: Will + Підмет + Базова форма дієслова?

source: 2. Shall (Less Common, More Formal / Specific Uses)
ru: 2. Shall (Менее распространенное, более формальное / Специфическое использование)
uk: 2. Shall (Менш Поширений, Більш Формальний / Специфічне Використання)

source: Subject + shall + Base Verb (mainly with I/We)
ru: Подлежащее + shall + Базовый глагол (в основном с I/We)
uk: Підмет + shall + Базова форма дієслова (переважно з I/We)

source: Subject + shall not / shan't + Base Verb (mainly with I/We)
ru: Подлежащее + shall not / shan't + Базовый глагол (в основном с I/We)
uk: Підмет + shall not / shan't + Базова форма дієслова (переважно з I/We)

source: Shall + I/We + Base Verb?
ru: Shall + I/We + Базовый глагол?
uk: Shall + I/We + Базова форма дієслова?

source: Use of Shall / Will
ru: Использование Shall / Will
uk: Використання Shall / Will

source: 1. Expressing Future Actions / Intentions (Main Use)
ru: 1. Выражение будущих действий / намерений (Основное использование)
uk: 1. Вираження Майбутніх Дій / Намірів (Основне Використання)

source: Will (General Future):
ru: Will (Общее будущее):
uk: Will (Загальне Майбутнє):

source: This is the standard way to express future events, predictions, or intentions. It's used with all subjects (I, you, he, she, it, we, they).
ru: Это **стандартный способ** выразить будущие события, предсказания или намерения. Используется со **всеми** подлежащими (I, you, he, she, it, we, they).
uk: Це стандартний спосіб вираження майбутніх подій, прогнозів або намірів. Використовується з усіма підметами (I, you, he, she, it, we, they).

source: Shall (Formal / Traditional Future with I/We):
ru: Shall (Формальное / Традиционное будущее с I/We):
uk: Shall (Формальне / Традиційне Майбутнє з I/We):

source: In very formal or traditional contexts (especially British English), \
ru: В очень **формальных или традиционных контекстах** (особенно в британском английском) \
uk: У дуже формальних або традиційних контекстах (особливо в британській англійській), \

source: Often literary or rhetorical
ru: Часто литературно или риторически
uk: Часто літературне або риторичне

source: 2. Expressing Decisions Made at the Moment of Speaking
ru: 2. Выражение решений, принятых в момент речи
uk: 2. Вираження Рішень, Прийнятих У Момент Мовлення

source: Used to announce a decision made spontaneously at the time of speaking.
ru: Используется для объявления о решении, принятом **спонтанно в момент речи**.
uk: Використовується для оголошення рішення, прийнятого спонтанно у момент мовлення.

source: 3. Expressing Offers, Suggestions, or Seeking Advice/Permission (Mainly \
ru: 3. Выражение предложений, советов, или запрос совета/разрешения (В основном \
uk: 3. Вираження Пропозицій, Порад або Запиту Поради/Дозволу (Переважно \

source: Shall (Offers/Suggestions with I/We):
ru: Shall (Предложения/Советы с I/We):
uk: Shall (Пропозиції/Поради з I/We):

source: This is a very common and natural use of \
ru: Это очень **распространенное и естественное** использование \
uk: Це дуже поширене та природне використання \

source: Offer
ru: Предложение
uk: Пропозиція

source: Shall (Seeking Advice/Permission with I/We):
ru: Shall (Запрос совета/разрешения с I/We):
uk: Shall (Запит Поради/Дозволу з I/We):

source: Seeking advice
ru: Запрос совета
uk: Запит поради

source: Seeking advice/agreement
ru: Запрос совета/согласия
uk: Запит поради/згоди

source: 4. Promises, Threats, or Determinations
ru: 4. Обещания, угрозы или решимость
uk: 4. Обіцянки, Погрози або Рішучість

source: Used for promises, strong intentions, or threats, with all subjects.
ru: Используется для обещаний, сильных намерений или угроз со всеми подлежащими.
uk: Використовується для обіцянок, сильних намірів або погроз, з усіма підметами.

source: Promise
ru: Обещание
uk: Обіцянка

source: Threat
ru: Угроза
uk: Погроза

source: Determination
ru: Решимость
uk: Рішучість

source: Shall (Strong Determination/Command - formal/legal):
ru: Shall (Сильная решимость/Приказ — формально/юридически):
uk: Shall (Сильна Рішучість/Наказ - формально/юридично):

source: Strong command/prohibition
ru: Строгий приказ/запрет
uk: Сильний наказ/заборона

source: 5. Questions about Willingness
ru: 5. Вопросы о готовности
uk: 5. Запитання про Готовність

source: Used to ask about someone's willingness or intention.
ru: Используется, чтобы спросить о чьей-либо **готовности** или намерении.
uk: Використовується, щоб запитати про чиюсь готовність або намір.

source: Asking about willingness
ru: Вопрос о готовности
uk: Запитання про готовність

source: Asking for willingness to help
ru: Вопрос о готовности помочь
uk: Прохання про готовність допомогти

source: 6. Habits or Characteristic Behavior (Will)
ru: 6. Привычки или характерное поведение (Will)
uk: 6. Звички або Характерна Поведінка (Will)

source: Used to describe typical or habitual behavior.
ru: Используется для описания **типичного или привычного поведения**.
uk: Використовується для опису типової або звичної поведінки.

source: Characteristic behavior
ru: Характерное поведение
uk: Характерна поведінка

source: The modal verb <span class=\
ru: Модальный глагол <span class=\
uk: Модальне дієслово <span class=\

source: Forms of Should
ru: Формы Should
uk: Форми Should

source: Subject + should + Base Verb
ru: Подлежащее + should + Базовый глагол
uk: Підмет + should + Базова форма дієслова

source: Subject + should not / shouldn't + Base Verb
ru: Подлежащее + should not / shouldn't + Базовый глагол
uk: Підмет + should not / shouldn't + Базова форма дієслова

source: Should + Subject + Base Verb?
ru: Should + Подлежащее + Базовый глагол?
uk: Should + Підмет + Базова форма дієслова?

source: Should have + Past Participle (Past Regret/Unfulfilled Obligation)
ru: Should have + Причастие прошедшего времени (Прошлое сожаление / Невыполненная обязанность)
uk: Should have + Дієприкметник минулого часу (Жаль/Невиконаний Обов'язок у минулому)

source: This construction is used to express that something would have been a good idea in the past but didn't happen, or to criticize a past action.
ru: Эта конструкция используется для выражения того, что что-то было бы **хорошей идеей в прошлом, но не произошло**, или для **критики** прошлого действия.
uk: Ця конструкція використовується для вираження того, що щось було б гарною ідеєю в минулому, але не сталося, або для критики минулої дії.

source: Subject + should have + Past Participle
ru: Подлежащее + should have + Причастие прошедшего времени
uk: Підмет + should have + Дієприкметник минулого часу

source: You didn't call, but it was advisable
ru: Ты не позвонил, хотя это было разумно
uk: Ти не подзвонив, але це було доцільно

source: Subject + should not have / shouldn't have + Past Participle
ru: Подлежащее + should not have / shouldn't have + Причастие прошедшего времени
uk: Підмет + should not have / shouldn't have + Дієприкметник минулого часу

source: They left, but it was a bad idea
ru: Они ушли, но это была плохая идея
uk: Вони пішли, але це була погана ідея

source: Use of Should
ru: Использование Should
uk: Використання Should

source: 1. Giving Advice or Recommendation
ru: 1. Предоставление совета или рекомендации
uk: 1. Надання Поради або Рекомендації

source: Personal recommendation
ru: Личная рекомендация
uk: Особиста рекомендація

source: General recommendation
ru: Общая рекомендация
uk: Загальна рекомендація

source: 2. Expressing Obligation or Duty (Milder than Must)
ru: 2. Выражение обязанности или долга (Мягче, чем Must)
uk: 2. Вираження Обов'язку або Боргу (М'якше, ніж Must)

source: It's your duty to be careful
ru: Твой долг быть осторожным
uk: Це твій обов'язок бути обережним

source: Expected behavior
ru: Ожидаемое поведение
uk: Очікувана поведінка

source: General duty
ru: Общий долг
uk: Загальний обов'язок

source: Expected delivery time
ru: Ожидаемое время доставки
uk: Очікуваний час доставки

source: Expected outcome
ru: Ожидаемый результат
uk: Очікуваний результат

source: 4. Referring to Unfulfilled Obligation or Regret (Should have + Past Participle)
ru: 4. Ссылка на невыполненную обязанность или сожаление (Should have + Причастие прошедшего времени)
uk: 4. Посилання на Невиконаний Обов'язок або Жаль (Should have + Дієприкметник минулого часу)

source: This past form is used to express regret, criticism, or disappointment about something that was expected or advisable in the past but did not occur.
ru: Эта форма прошедшего времени используется для выражения **сожаления, критики или разочарования** по поводу того, что ожидалось или было разумным в прошлом, но не произошло.
uk: Ця минула форма використовується для вираження жалю, критики або розчарування щодо того, що очікувалося або було доцільним у минулому, але не відбулося.

source: Regret: I didn't listen, but it would have been better
ru: Сожаление: Я не послушал, но было бы лучше
uk: Жаль: Я не послухав, але було б краще

source: Criticism: You waited, and it was a mistake
ru: Критика: Ты ждал, и это была ошибка
uk: Критика: Ти чекав, і це була помилка

source: Expectation for the past that wasn't met
ru: Ожидание в прошлом, которое не оправдалось
uk: Очікування щодо минулого, яке не виправдалося

source: 5. In Conditional Sentences (Formal / Less Common)
ru: 5. В условных предложениях (Формально / Менее распространенно)
uk: 5. У Умовних Реченнях (Формально / Менш Поширено)

source: In formal or hypothetical conditional sentences, \
ru: В формальных или гипотетических условных предложениях \
uk: У формальних або гіпотетичних умовних реченнях, \

source: Less likely than \
ru: Менее вероятно, чем \
uk: Менш ймовірно, ніж \

source: Formal inversion
ru: Формальная инверсия
uk: Формальна інверсія

source: 6. After Verbs of Opinion/Emotion (Subjunctive-like)
ru: 6. После глаголов мнения/эмоций (Подобно сослагательному наклонению)
uk: 6. Після Дієслів Думки/Емоції (Схоже на Умовний Спосіб)

source: In some formal contexts, \
ru: В некоторых формальных контекстах \
uk: У деяких формальних контекстах, \

source: Or simply:
ru: Или просто:
uk: Або просто:

source: The expression <span class=\
ru: Выражение <span class=\
uk: Вираз <span class=\

source: It is important not to confuse \
ru: Важно не путать \
uk: Важливо не плутати \

source: Forms of Used to
ru: Формы Used to
uk: Форми Used to

source: Subject + used to + Base Verb
ru: Подлежащее + used to + Базовый глагол
uk: Підмет + used to + Базова форма дієслова

source: Subject + did not use to / didn't use to + Base Verb
ru: Подлежащее + did not use to / didn't use to + Базовый глагол
uk: Підмет + did not use to / didn't use to + Базова форма дієслова

source: Less common: used not to / usedn't to
ru: Менее распространено: used not to / usedn't to
uk: Менш поширено: used not to / usedn't to

source: Did + Subject + use to + Base Verb?
ru: Did + Подлежащее + use to + Базовый глагол?
uk: Did + Підмет + use to + Базова форма дієслова?

source: Use of Used to
ru: Использование Used to
uk: Використання Used to

source: 1. Past Habits / Repeated Actions
ru: 1. Прошлые привычки / Повторяющиеся действия
uk: 1. Минулі Звички / Повторювані Дії

source: This is the primary use of \
ru: Это основное использование \
uk: Це основне використання \

source: Now I don't
ru: Теперь я этого не делаю
uk: Зараз я цього не роблю

source: She doesn't do it anymore
ru: Она больше этого не делает
uk: Вона більше цього не робить

source: 2. Past States / Situations
ru: 2. Прошлые состояния / Ситуации
uk: 2. Минулі Стани / Ситуації

source: Now it's something else
ru: Теперь это что-то другое
uk: Зараз це щось інше

source: Now her hair is short
ru: Теперь ее волосы короткие
uk: Зараз у неї коротке волосся

source: It's gone now
ru: Сейчас его нет
uk: Його зараз немає

source: 3. Comparison with \
ru: 3. Сравнение с \
uk: 3. Порівняння з \

source: Can describe both past habits (repeated actions) and past states.
ru: Может описывать как прошлые привычки (повторяющиеся действия), так и **прошлые состояния**.
uk: Може описувати як минулі звички (повторювані дії), так і минулі стани.

source: State
ru: Состояние
uk: Стан

source: Habit
ru: Привычка
uk: Звичка

source: Can only describe past habits (repeated actions), not past states.
ru: Может описывать только прошлые привычки (повторяющиеся действия), но **не прошлые состояния**.
uk: Може описувати лише минулі звички (повторювані дії), а не минулі стани.

source: Incorrect for a state
ru: Неправильно для состояния
uk: Неправильно для стану

source: Therefore, \
ru: Следовательно, \
uk: Отже, \

source: 4. Negative and Interrogative Forms
ru: 4. Отрицательные и вопросительные формы
uk: 4. Заперечні та Питальні Форми

source: Standard negative
ru: Стандартное отрицание
uk: Стандартне заперечення

source: Standard question
ru: Стандартный вопрос
uk: Стандартне питання

source: Forms of Would
ru: Формы Would
uk: Форми Would

source: Subject + would ('d) + Base Verb
ru: Подлежащее + would ('d) + Базовый глагол
uk: Підмет + would ('d) + Базова форма дієслова

source: Subject + would not / wouldn't + Base Verb
ru: Подлежащее + would not / wouldn't + Базовый глагол
uk: Підмет + would not / wouldn't + Базова форма дієслова

source: Would + Subject + Base Verb?
ru: Would + Подлежащее + Базовый глагол?
uk: Would + Підмет + Базова форма дієслова?

source: Would have + Past Participle (Unrealized Past Conditionals)
ru: Would have + Причастие прошедшего времени (Нереализованные прошлые условные предложения)
uk: Would have + Дієприкметник минулого часу (Нереалізовані Умовні Речення у минулому)

source: This construction is used in the third conditional to talk about hypothetical situations in the past that did not happen.
ru: Эта конструкция используется в **третьем типе условных предложений**, чтобы говорить о гипотетических ситуациях в прошлом, которые **не произошли**.
uk: Ця конструкція використовується в третьому типі умовних речень, щоб говорити про гіпотетичні ситуації в минулому, які не відбулися.

source: Subject + would have + Past Participle
ru: Подлежащее + would have + Причастие прошедшего времени
uk: Підмет + would have + Дієприкметник минулого часу

source: Subject + would not have / wouldn't have + Past Participle
ru: Подлежащее + would not have / wouldn't have + Причастие прошедшего времени
uk: Підмет + would not have / wouldn't have + Дієприкметник минулого часу

source: Use of Would
ru: Использование Would
uk: Використання Would

source: 1. Hypothetical Situations and Conditionals
ru: 1. Гипотетические ситуации и условные предложения
uk: 1. Гіпотетичні Ситуації та Умовні Речення

source: Second Conditional (Unreal Present/Future):
ru: Второй тип условных предложений (Нереальное настоящее/будущее):
uk: Другий тип умовних речень (Нереальне Теперішнє/Майбутнє):

source: Used to describe hypothetical situations and their likely results in the present or future.
ru: Используется для описания гипотетических ситуаций и их вероятных результатов в настоящем или будущем.
uk: Використовується для опису гіпотетичних ситуацій та їх ймовірних результатів у теперішньому або майбутньому.

source: But I don't have time
ru: Но у меня нет времени
uk: Але у мене немає часу

source: But she can't
ru: Но она не может
uk: Але вона не може

source: Third Conditional (Unreal Past):
ru: Третий тип условных предложений (Нереальное прошлое):
uk: Третій тип умовних речень (Нереальне Минуле):

source: Used with \
ru: Используется с \
uk: Використовується з \

source: You didn't call, so I didn't come
ru: Ты не позвонил, поэтому я не пришел
uk: Ти не подзвонив, тому я не прийшов

source: 2. Polite Requests and Offers
ru: 2. Вежливые просьбы и предложения
uk: 2. Ввічливі Прохання та Пропозиції

source: Polite Requests:
ru: Вежливые просьбы:
uk: Ввічливі Прохання:

source: Polite Offers/Invitations:
ru: Вежливые предложения/приглашения:
uk: Ввічливі Пропозиції/Запрошення:

source: 3. Expressing Preferences or Desires (often with 'like', 'love', 'prefer')
ru: 3. Выражение предпочтений или желаний (часто с 'like', 'love', 'prefer')
uk: 3. Вираження Уподобань або Бажань (часто з 'like', 'love', 'prefer')

source: 4. Past Habits or Repeated Actions (similar to \
ru: 4. Прошлые привычки или повторяющиеся действия (похоже на \
uk: 4. Минулі Звички або Повторювані Дії (схоже на \

source: Unlike \
ru: В отличие от \
uk: На відміну від \

source: 5. In Reported Speech (as the past of \
ru: 5. В косвенной речи (как прошедшее время от \
uk: 5. У Непрямій Мові (як минула форма \

source: 6. To Express Certainty or Opinion (Formal)
ru: 6. Выражение уверенности или мнения (Формально)
uk: 6. Для Вираження Впевненості або Думки (Формально)

source: In more formal contexts, \
ru: В более формальных контекстах \
uk: У більш формальних контекстах, \

source: The Participle
ru: Причастие
uk: Дієприкметник

source: 1. The Present Participle (Причастие настоящего времени)
ru: 1. Причастие настоящего времени (The Present Participle)
uk: 1. Дієприкметник Теперішнього Часу

source: The Present Participle is formed by adding <span class=\
ru: Причастие настоящего времени образуется путем добавления <span class=\
uk: Дієприкметник теперішнього часу утворюється шляхом додавання <span class=\

source: Uses of the Present Participle:
ru: Использование причастия настоящего времени:
uk: Використання Дієприкметника Теперішнього Часу:

source: To form Continuous (Progressive) Tenses:
ru: Для образования длительных (продолженных) времен:
uk: Для утворення Тривалих (Continuous/Progressive) Часів:

source: Used with the auxiliary verb \
ru: Используется со вспомогательным глаголом \
uk: Використовується з допоміжним дієсловом \

source: Present Continuous
ru: Настоящее продолженное время (Present Continuous)
uk: Теперішній Тривалий (Present Continuous)

source: Past Continuous
ru: Прошедшее продолженное время (Past Continuous)
uk: Минулий Тривалий (Past Continuous)

source: Future Continuous
ru: Будущее продолженное время (Future Continuous)
uk: Майбутній Тривалий (Future Continuous)

source: As an Adjective:
ru: В качестве прилагательного:
uk: Як Прикметник:

source: Describes a noun or pronoun, often indicating something that is performing the action or causing the feeling.
ru: Описывает существительное или местоимение, часто указывая на то, что совершает действие или вызывает чувство.
uk: Описує іменник або займенник, часто вказуючи на щось, що виконує дію або спричиняє відчуття.

source: Water that is running
ru: Вода, которая течет
uk: Вода, що біжить

source: The game caused excitement
ru: Игра, которая вызвала восторг
uk: Гра викликала захоплення

source: A smile that charms
ru: Улыбка, которая очаровывает
uk: Посмішка, яка зачаровує

source: To indicate an ongoing action that is perceived.
ru: Для указания продолжающегося действия, которое воспринимается.
uk: Для позначення триваючої дії, яка сприймається.

source: To replace a subordinate clause (Participle Clauses):
ru: Для замены придаточного предложения (Причастные обороты):
uk: Для заміни підрядного речення (Дієприкметникові звороти):

source: Used to condense sentences, especially when two actions happen at the same time or one after another, or to give a reason.
ru: Используется для сокращения предложений, особенно когда два действия происходят одновременно или одно за другим, или чтобы указать причину.
uk: Використовується для скорочення речень, особливо коли дві дії відбуваються одночасно або одна за одною, або для вказівки причини.

source: While I was walking...
ru: Пока я шел...
uk: Поки я йшов...

source: Because she felt tired...
ru: Поскольку она чувствовала усталость...
uk: Оскільки вона відчувала втому...

source: 2. The Past Participle (Причастие прошедшего времени)
ru: 2. Причастие прошедшего времени (The Past Participle)
uk: 2. Дієприкметник Минулого Часу

source: The Past Participle is the third form of a verb (V3). For regular verbs, it ends in <span class=\
ru: Причастие прошедшего времени – это третья форма глагола (V3). Для правильных глаголов оно заканчивается на <span class=\
uk: Дієприкметник минулого часу — це третя форма дієслова (V3). Для правильних дієслів він закінчується на <span class=\

source: Uses of the Past Participle:
ru: Использование причастия прошедшего времени:
uk: Використання Дієприкметника Минулого Часу:

source: To form Perfect Tenses:
ru: Для образования перфектных времен:
uk: Для утворення Доконаних (Perfect) Часів:

source: Past Perfect
ru: Прошедшее совершенное время (Past Perfect)
uk: Минулий Доконаний (Past Perfect)

source: Future Perfect
ru: Будущее совершенное время (Future Perfect)
uk: Майбутній Доконаний (Future Perfect)

source: To form the Passive Voice:
ru: Для образования пассивного залога:
uk: Для утворення Пасивного Стану:

source: Past Simple Passive
ru: Простое прошедшее время, пассивный залог
uk: Простий Минулий Пасивний

source: Present Simple Passive
ru: Простое настоящее время, пассивный залог
uk: Простий Теперішній Пасивний

source: Present Perfect Passive
ru: Настоящее совершенное время, пассивный залог
uk: Теперішній Доконаний Пасивний

source: Describes a noun or pronoun, often indicating something that has undergone the action or is affected by it.
ru: Описывает существительное или местоимение, часто указывая на то, что подверглось действию или находится под его влиянием.
uk: Описує іменник або займенник, часто вказуючи на щось, що зазнало дії або на що вона вплинула.

source: The window was broken
ru: Окно, которое было разбито
uk: Вікно було розбите

source: The egg was fried
ru: Яйцо, которое было пожарено
uk: Яйце було смажене

source: He was made tired
ru: Он был сделан уставшим
uk: Його втомили

source: Similar to present participle clauses, used to condense sentences, often indicating a completed action that precedes another, or a cause/reason.
ru: Подобно причастным оборотам настоящего времени, используется для сокращения предложений, часто указывая на завершенное действие, предшествующее другому, или на причину/основание.
uk: Схоже на звороти з дієприкметником теперішнього часу, використовується для скорочення речень, часто вказуючи на завершену дію, що передує іншій, або на причину/підставу.

source: Because it was written...
ru: Поскольку это было написано...
uk: Оскільки це було написано...

source: After she had finished...
ru: После того как она закончила...
uk: Після того, як вона закінчила...

source: Understanding participles is key to forming complex tenses, passive constructions, and more concise, sophisticated sentences in English.
ru: Понимание причастий является ключом к формированию сложных времен, пассивных конструкций и более лаконичных, сложных предложений в английском языке.
uk: Розуміння дієприкметників є ключовим для формування складних часів, пасивних конструкцій і більш лаконічних, витончених речень в англійській мові.

source: The Passive Voice
ru: Пассивный залог (The Passive Voice)
uk: Пасивний Стан
