Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Add card
ru: Добавить карточку
uk: Додати картку

source: Home
ru: Главная
uk: Головна

source: My Cards
ru: Мои карточки
uk: Мої картки

source: Add Card
ru: Добавить карточку
uk: Додати картку

source: Add New Card
ru: Добавить новую карточку
uk: Додати нову картку

source: English word
ru: Английское слово
uk: Англійське слово

source: Enter the word in English
ru: Введите слово на английском
uk: Введіть слово англійською

source: Translation
ru: Перевод
uk: Переклад

source: Enter the translation in your native language
ru: Введите перевод на вашем родном языке
uk: Введіть переклад рідною мовою

source: Category (Optional)
ru: Категория (Необязательно)
uk: Категорія (Необов'язково)

source: Choose or create a category
ru: Выберите или создайте категорию
uk: Виберіть або створіть категорію

source: Save card
ru: Сохранить карточку
uk: Зберегти картку

source: Save and add another
ru: Сохранить и добавить еще одну
uk: Зберегти та додати ще одну

source: Last added cards
ru: Последние добавленные карточки
uk: Останні додані картки

source: You haven't added any cards yet
ru: Вы еще не добавили ни одной карточки
uk: Ви ще не додали жодної картки

source: Go to top
ru: Наверх
uk: Нагору

source: Scroll to top
ru: Прокрутить наверх
uk: Прокрутити нагору

source: My cards
ru: Мои карточки
uk: Мої картки

source: Add cards
ru: Добавить карточки
uk: Додати картки

source: Quiz
ru: Тест
uk: Тест

source: Confirm delete
ru: Подтвердить удаление
uk: Підтвердити видалення

source: Are you sure you want to delete "%(card.english_word)s"?
ru: Вы уверены, что хотите удалить «%(card.english_word)s»?
uk: Ви впевнені, що хочете видалити «%(card.english_word)s»?

source: Delete
ru: Удалить
uk: Видалити

source: Cancel
ru: Отмена
uk: Скасувати

source: Edit Card
ru: Редактировать карточку
uk: Редагувати картку

source: Save Changes
ru: Сохранить изменения
uk: Зберегти зміни

source: Filter by first letter
ru: Фильтр по первой букве
uk: Фільтрувати за першою літерою

source: Filter by letter %(letter)s
ru: Фильтр по букве %(letter)s
uk: Фільтрувати за літерою %(letter)s

source: Sort cards by date
ru: Сортировать карточки по дате
uk: Сортувати картки за датою

source: Sort newest first
ru: Сначала новые
uk: Сортувати від нових до старих

source: Newest
ru: Самые новые
uk: Нові

source: Sort oldest first
ru: Сначала старые
uk: Сортувати від старих до нових

source: Oldest
ru: Самые старые
uk: Старі

source: Cards per page
ru: Карточек на странице
uk: Карток на сторінку

source: Show:
ru: Показать:
uk: Показати:

source: Filter by category
ru: Фильтр по категории
uk: Фільтрувати за категорією

source: Category:
ru: Категория:
uk: Категорія:

source: All Categories
ru: Все категории
uk: Усі категорії

source: Uncategorized
ru: Без категории
uk: Без категорії

source: Edit card
ru: Редактировать карточку
uk: Редагувати картку

source: Delete card
ru: Удалить карточку
uk: Видалити картку

source: Are you sure you want to delete \'%(card.english_word)s\'?
ru: Вы уверены, что хотите удалить «%(card.english_word)s»?
uk: Ви впевнені, що хочете видалити «%(card.english_word)s»?

source: You don't have any cards yet.
ru: У вас пока нет ни одной карточки.
uk: Ви ще не маєте жодної картки.

source: Add your first card
ru: Добавьте вашу первую карточку
uk: Додайте свою першу картку

source: First page
ru: Первая страница
uk: Перша сторінка

source: first
ru: первая
uk: перша

source: Previous page
ru: Предыдущая страница
uk: Попередня сторінка

source: previous
ru: предыдущая
uk: попередня

source: Page %(page_obj.number)s of %(page_obj.paginator.num_pages)s
ru: Страница %(page_obj.number)s из %(page_obj.paginator.num_pages)s
uk: Сторінка %(page_obj.number)s з %(page_obj.paginator.num_pages)s

source: Next page
ru: Следующая страница
uk: Наступна сторінка

source: next
ru: следующая
uk: наступна

source: Last page
ru: Последняя страница
uk: Остання сторінка

source: last
ru: последняя
uk: остання

source: Question %(forloop.counter)s: %(question.question)s
ru: Вопрос %(forloop.counter)s: %(question.question)s
uk: Запитання %(forloop.counter)s: %(question.question)s

source: Submit Answers
ru: Отправить ответы
uk: Надіслати відповіді

source: Quiz Results
ru: Результаты теста
uk: Результати тесту

source: You scored <strong>%(correct)s/%(total)s</strong> (%(percentage)s%%)
ru: Вы набрали <strong>%(correct)s/%(total)s</strong> (%(percentage)s%%)
uk: Ви набрали <strong>%(correct)s/%(total)s</strong> (%(percentage)s%%)

source: Question %(forloop.counter)s
ru: Вопрос %(forloop.counter)s
uk: Запитання %(forloop.counter)s

source: Your answer: %(answer.user_answer)s
ru: Ваш ответ: %(answer.user_answer)s
uk: Ваша відповідь: %(answer.user_answer)s

source: Correct answer: %(answer.correct_answer)s
ru: Правильный ответ: %(answer.correct_answer)s
uk: Правильна відповідь: %(answer.correct_answer)s

source: Take Another Quiz
ru: Пройти еще один тест
uk: Пройти інший тест

source: Return Home
ru: Вернуться на Главную
uk: Повернутися на головну

source: Start Quiz
ru: Начать тест
uk: Розпочати тест

source: Translation Direction:
ru: Направление перевода:
uk: Напрямок перекладу:

source: English → Native
ru: Английский → Родной
uk: Англійська → Рідна мова

source: Native → English
ru: Родной → Английский
uk: Рідна мова → Англійська

source: Category (optional):
ru: Категория (необязательно):
uk: Категорія (необов'язково):

source: %(card_count)s card
ru: %(card_count)s карточка
uk: %(card_count)s картка

source: Number of questions:
ru: Количество вопросов:
uk: Кількість запитань:

source: All available
ru: Все доступные
uk: Усі доступні

source: You have %(card_total)s card total
ru: У вас всего %(card_total)s карточка
uk: Усього у вас %(card_total)s картка

source: and %(category_count)s category
ru: и %(category_count)s категория
uk: та %(category_count)s категорія

source: You don't have any cards yet. Please add some first.
ru: У вас пока нет карточек. Пожалуйста, добавьте их сначала.
uk: Ви ще не маєте жодної картки. Будь ласка, додайте кілька спочатку.

source: Quiz mode:
ru: Режим теста:
uk: Режим тестування:

source: Multiple choice
ru: Множественный выбор
uk: Множинний вибір

source: Spelling
ru: Правописание
uk: Правопис

source: Classification of English Verbs
ru: Классификация английских глаголов
uk: Класифікація англійських дієслів

source: By meaning and function
ru: По значению и функции
uk: За значенням і функцією

source: English verbs can be classified in several ways based on their meaning, function, and grammatical properties.
ru: Английские глаголы можно классифицировать несколькими способами в зависимости от их значения, функции и грамматических свойств.
uk: Англійські дієслова можна класифікувати кількома способами, ґрунтуючись на їхньому значенні, функції та граматичних властивостях.

source: By meaning and function:
ru: По значению и функции:
uk: За значенням і функцією:

source: Notional verbs:
ru: Знаменательные глаголы:
uk: Повнозначні дієслова:

source: express actions or states and can function as simple predicates.
ru: выражают действия или состояния и могут функционировать как простые сказуемые.
uk: виражають дії або стани та можуть функціонувати як простий присудок.

source: Examples:
ru: Примеры:
uk: Приклади:

source: Auxiliary verbs:
ru: Вспомогательные глаголы:
uk: Допоміжні дієслова:

source: help form grammatical structures but don't have full meaning on their own.
ru: помогают формировать грамматические структуры, но не имеют полного значения сами по себе.
uk: допомагають формувати граматичні структури, але не мають повного значення самостійно.

source: e.g.
ru: напр.
uk: напр.

source: By relation to direct object:
ru: По отношению к прямому дополнению:
uk: За відношенням до прямого додатка:

source: Transitive verbs:
ru: Переходные глаголы:
uk: Перехідні дієслова:

source: require a direct object to complete their meaning.
ru: требуют прямого дополнения для завершения своего значения.
uk: вимагають прямого додатка для завершення свого значення.

source: Intransitive verbs:
ru: Непереходные глаголы:
uk: Неперехідні дієслова:

source: do not require a direct object.
ru: не требуют прямого дополнения.
uk: не вимагають прямого додатка.

source: Note: Some verbs can be both transitive and intransitive depending on usage.
ru: Примечание: Некоторые глаголы могут быть как переходными, так и непереходными в зависимости от контекста.
uk: Примітка: Деякі дієслова можуть бути як перехідними, так і неперехідними залежно від вживання.

source: English Grammar
ru: Грамматика английского языка
uk: Граматика англійської мови

source: Grammar Topics
ru: Грамматические темы
uk: Теми з граматики

source: Coming Soon
ru: Скоро
uk: Незабаром

source: Grammar Exercises (Coming Soon)
ru: Грамматические упражнения (скоро)
uk: Вправи з граматики (Незабаром)

source: English Grammar Topics
ru: Темы грамматики английского языка
uk: Теми з граматики англійської мови

source: Grammar
ru: Грамматика
uk: Граматика

source: Explore detailed topics across various English grammar categories.
ru: Изучите подробные темы по различным категориям грамматики английского языка.
uk: Ознайомтеся з детальними темами в різних категоріях граматики англійської мови.

source: Back to Home
ru: На главную
uk: На головну

source: Detailed content for "%(topic_title)s" in "%(main_topic_title)s" is coming soon!
ru: Подробный материал по теме «%(topic_title)s» в разделе «%(main_topic_title)s» скоро появится!
uk: Детальний зміст для «%(topic_title)s» у «%(main_topic_title)s» буде незабаром!

source: Back to %(main_topic_title)s Topics
ru: Назад к темам «%(main_topic_title)s»
uk: Повернутися до тем %(main_topic_title)s

source: Back to Grammar Topics
ru: Назад к грамматическим темам
uk: Повернутися до тем з граматики

source: Adjective: Absolute Adjectives
ru: Прилагательное: Абсолютные прилагательные
uk: Прикметник: Абсолютні прикметники

source: Adjective
ru: Прилагательное
uk: Прикметник

source: Degrees of Comparison
ru: Степени сравнения
uk: Ступені порівняння

source: Absolute Adjectives
ru: Абсолютные прилагательные
uk: Абсолютні прикметники

source: Absolute adjectives, also known as non-gradable or superlative adjectives, describe a quality that cannot be intensified or compared. These words represent a state that is either complete or not, with no degrees in between.
ru: Абсолютные прилагательные, также известные как неградуируемые или превосходные прилагательные, описывают качество, которое нельзя усилить или сравнить. Эти слова представляют собой состояние, которое является либо полным, либо нет, без промежуточных степеней.
uk: Абсолютні прикметники, також відомі як неградуйовані або найвищі, описують якість, яку неможливо посилити чи порівняти. Ці слова представляють стан, який є або повним, або ні, без проміжних ступенів.

source: 1. The Concept of 'Absolute'
ru: 1. Концепция «Абсолюта»
uk: 1. Концепція «Абсолюту»

source: Think of these adjectives as all-or-nothing words. For example, something is either <span class=\
ru: Считайте эти прилагательные словами, которые означают «всё или ничего». Например, что-то является либо <span class=\
uk: Уявіть ці прикметники як слова, що означають «все або нічого». Наприклад, щось є або <span class=\

source: 2. Common Absolute Adjectives
ru: 2. Распространенные абсолютные прилагательные
uk: 2. Поширені абсолютні прикметники

source: Here are some of the most common absolute adjectives:
ru: Вот некоторые из наиболее распространенных абсолютных прилагательных:
uk: Ось деякі з найпоширеніших абсолютних прикметників:

source: Using phrases like '<strike>more dead</strike>' or '<strike>very unique</strike>' is generally considered incorrect or non-standard. Instead, we use intensifiers that mean 'almost' or 'completely'.
ru: Использование фраз типа '<strike>более мертвый</strike>' или '<strike>очень уникальный</strike>' обычно считается неверным или нестандартным. Вместо этого мы используем интенсификаторы, которые означают «почти» или «полностью».
uk: Використання фраз на кшталт «<strike>більш мертвий</strike>» або «<strike>дуже унікальний</strike>» зазвичай вважається неправильним або нестандартним. Натомість ми використовуємо підсилювачі, що означають «майже» або «повністю».

source: 3. Using Intensifiers with Absolute Adjectives
ru: 3. Использование интенсификаторов с абсолютными прилагательными
uk: 3. Використання підсилювачів з абсолютними прикметниками

source: While you cannot compare these adjectives, you can often use adverbs to emphasize their absolute quality or to show that they are nearly at that state.
ru: Хотя эти прилагательные нельзя сравнивать, часто можно использовать наречия, чтобы подчеркнуть их абсолютное качество или показать, что они близки к этому состоянию.
uk: Хоча ви не можете порівнювати ці прикметники, ви часто можете використовувати прислівники, щоб підкреслити їхню абсолютну якість або показати, що вони майже досягли цього стану.

source: Intensifier
ru: Интенсификатор
uk: Підсилювач

source: Example
ru: Пример
uk: Приклад

source: Explanation
ru: Объяснение
uk: Пояснення

source: Emphasizes the absolute state.
ru: Подчеркивает абсолютное состояние.
uk: Підкреслює абсолютний стан.

source: Shows it is very close to the absolute state.
ru: Показывает, что состояние очень близко к абсолютному.
uk: Показує, що це дуже близько до абсолютного стану.

source: Adds emphasis without implying a comparison.
ru: Добавляет акцент, не подразумевая сравнения.
uk: Додає акцент, не маючи на увазі порівняння.

source: Back to Adjectives
ru: Назад к Прилагательным
uk: Повернутися до Прикметників

source: Adjectives Used as Nouns: To Refer to Abstract Concepts
ru: Прилагательные в роли существительных: Для обозначения абстрактных понятий
uk: Прикметники, що використовуються як іменники: Для позначення абстрактних понять

source: Adjectives Used as Nouns
ru: Прилагательные в роли существительных
uk: Прикметники, що використовуються як іменники

source: To Refer to Abstract Concepts
ru: Для обозначения абстрактных понятий
uk: Для позначення абстрактних понять

source: Similar to how adjectives can refer to a group of people, they can also be used with the definite article <span class=\
uk: Подібно до того, як прикметники можуть посилатися на групу людей, вони також можуть використовуватися з означеним артиклем <span class=\

source: 1. The Basic Rule
ru: 1. Основное правило
uk: 1. Основне правило

source: The structure is <span class=\
uk: Структура виглядає так: <span class=\

source: Phrase (Abstract Concept)
ru: Фраза (Абстрактное понятие)
uk: Фраза (Абстрактне поняття)

source: Example Sentence
ru: Пример предложения
uk: Приклад речення

source: 2. How it Differs from Plural Nouns
ru: 2. Чем это отличается от существительных во множественном числе
uk: 2. Чим це відрізняється від іменників у множині

source: Unlike the use of adjectives to refer to a group of people, which takes a plural verb, this construction refers to a singular, abstract concept and typically takes a singular verb.
ru: В отличие от использования прилагательных для обозначения группы людей, где глагол употребляется во множественном числе, эта конструкция относится к единственному, абстрактному понятию и обычно требует глагола в единственном числе.
uk: На відміну від використання прикметників для позначення групи людей, що вимагає дієслова у множині, ця конструкція посилається на єдине, абстрактне поняття і, як правило, вимагає дієслова в однині.

source: 3. Context is Key
ru: 3. Контекст имеет решающее значение
uk: 3. Ключовим є контекст

source: Whether an adjective used as a noun refers to people or an abstract concept is determined by context.
ru: Относится ли прилагательное, используемое в качестве существительного, к людям или к абстрактному понятию, определяется контекстом.
uk: Чи прикметник, використаний як іменник, стосується людей чи абстрактного поняття, визначається контекстом.

source: In a philosophical discussion:
ru: В философской дискуссии:
uk: У філософській дискусії:

source: referring to a concept
ru: относится к понятию
uk: посилається на поняття

source: In a religious text:
ru: В религиозном тексте:
uk: У релігійному тексті:

source: referring to people
ru: относится к людям
uk: посилається на людей

source: This subtle difference is crucial for both understanding and using these phrases correctly.
ru: Эта тонкая разница имеет решающее значение как для понимания, так и для правильного использования этих фраз.
uk: Ця тонка відмінність є вирішальною як для розуміння, так і для правильного використання цих фраз.

source: Adjectives: Attributive Function
ru: Прилагательные: Атрибутивная функция
uk: Прикметники: Атрибутивна функція

source: Functions of Adjectives
ru: Функции прилагательных
uk: Функції прикметників

source: Attributive Function
ru: Атрибутивная функция
uk: Атрибутивна функція

source: The attributive function is the most common use of an adjective. When an adjective is used attributively, it is placed directly before the noun it modifies. The adjective is considered a part of the noun phrase, providing a direct description or quality of the noun.
ru: Атрибутивная функция — наиболее распространенное использование прилагательного. Когда прилагательное используется атрибутивно, оно ставится непосредственно перед существительным, которое оно определяет. Прилагательное считается частью именной фразы, дающей прямое описание или качество существительного.
uk: Атрибутивна функція — це найпоширеніше використання прикметника. Коли прикметник використовується атрибутивно, він ставиться безпосередньо перед іменником, який він модифікує. Прикметник вважається частиною іменникової фрази, забезпечуючи прямий опис або якість іменника.

source: 1. Basic Structure
ru: 1. Основная структура
uk: 1. Основна структура

source: The standard structure is a simple noun phrase: <strong>Article + Adjective + Noun</strong>.
ru: Стандартная структура — это простая именная фраза: <strong>Артикль + Прилагательное + Существительное</strong>.
uk: Стандартна структура — це проста іменникова фраза: <strong>Артикль + Прикметник + Іменник</strong>.

source: In these examples, the adjectives <span class=\
uk: У цих прикладах прикметники <span class=\

source: 2. Multiple Attributive Adjectives
ru: 2. Несколько атрибутивных прилагательных
uk: 2. Множинні атрибутивні прикметники

source: When multiple adjectives are used to describe a single noun, they are all placed before the noun and follow a specific order (e.g., Opinion, Size, Age, Color, etc.).
ru: Когда несколько прилагательных используются для описания одного существительного, все они ставятся перед существительным и следуют определенному порядку (например, Мнение, Размер, Возраст, Цвет и т. д.).
uk: Коли для опису одного іменника використовується кілька прикметників, усі вони розміщуються перед іменником і дотримуються певного порядку (наприклад, Думка, Розмір, Вік, Колір тощо).

source: This structure remains attributive, оскільки всі прикметники є частиною іменникової фрази, яка стоїть перед самим іменником.
uk: Ця структура залишається атрибутивною, оскільки всі прикметники є частиною іменникової фрази, яка стоїть перед самим іменником.

source: 3. Adjectives That Are ONLY Attributive
ru: 3. Прилагательные, которые являются ТОЛЬКО атрибутивными
uk: 3. Прикметники, які є ЛИШЕ атрибутивними

source: Some adjectives can only be used in an attributive position and cannot be used predicatively (after a verb). Common examples include:
ru: Некоторые прилагательные могут использоваться только в атрибутивной позиции и не могут использоваться предикативно (после глагола). Распространенные примеры включают:
uk: Деякі прикметники можуть використовуватися лише в атрибутивній позиції і не можуть використовуватися предикативно (після дієслова). Поширені приклади включають:

source: This is an important distinction to avoid grammatical errors when using these specific words.
ru: Это важное различие, чтобы избежать грамматических ошибок при использовании этих конкретных слов.
uk: Це важлива відмінність, щоб уникнути граматичних помилок при використанні цих конкретних слів.

source: Order of Adjectives: Examples of Usage
ru: Порядок прилагательных: Примеры использования
uk: Порядок прикметників: Приклади вживання

source: Order of Adjectives
ru: Порядок прилагательных
uk: Порядок прикметників

source: Examples of Usage
ru: Примеры использования
uk: Приклади вживання

source: The best way to understand the standard order of adjectives (OSASCOMP) is to see it in action. Here are several examples combining adjectives from different categories to describe a single noun.
ru: Лучший способ понять стандартный порядок прилагательных (OSASCOMP) — увидеть его в действии. Вот несколько примеров, объединяющих прилагательные из разных категорий для описания одного существительного.
uk: Найкращий спосіб зрозуміти стандартний порядок прикметників (OSASCOMP) — побачити його в дії. Ось кілька прикладів, що поєднують прикметники з різних категорій для опису одного іменника.

source: Example 1: Describing a Car
ru: Пример 1: Описание автомобиля
uk: Приклад 1: Опис автомобіля

source: Let's describe a car using a few adjectives. The correct order is based on the OSASCOMP rule: <span class=\
uk: Опишемо автомобіль, використовуючи кілька прикметників. Правильний порядок базується на правилі OSASCOMP: <span class=\

source: Here's the breakdown:
ru: Вот анализ:
uk: Ось розшифровка:

source: Category
ru: Категория
uk: Категорія

source: Opinion
ru: Мнение
uk: Думка

source: Size
ru: Размер
uk: Розмір

source: Age
ru: Возраст
uk: Вік

source: Color
ru: Цвет
uk: Колір

source: Example 2: Describing an Object
ru: Пример 2: Описание предмета
uk: Приклад 2: Опис об'єкта

source: Let's describe a piece of furniture with a more detailed combination. The order is: <span class=\
uk: Опишемо предмет меблів із більш детальною комбінацією. Порядок такий: <span class=\

source: Notice that the 'Color' category is skipped here, as there is no color adjective, but the rule still holds.
ru: Обратите внимание, что категория «Цвет» здесь пропущена, поскольку нет прилагательного цвета, но правило по-прежнему действует.
uk: Зверніть увагу, що категорія «Колір» тут пропущена, оскільки немає прикметника кольору, але правило все ще діє.

source: Shape
ru: Форма
uk: Форма

source: Material
ru: Материал
uk: Матеріал

source: Example 3: Describing a Person's Clothes
ru: Пример 3: Описание одежды человека
uk: Приклад 3: Опис одягу людини

source: Here's an example that includes an adjective of origin: <span class=\
uk: Ось приклад, який включає прикметник походження: <span class=\

source: This example shows that you don't need to have an adjective from every category to follow the rule. You simply place the adjectives in the correct order for the categories you are using.
ru: Этот пример показывает, что вам не обязательно иметь прилагательное из каждой категории, чтобы следовать правилу. Вы просто располагаете прилагательные в правильном порядке для тех категорий, которые вы используете.
uk: Цей приклад показує, що вам не обов’язково мати прикметник із кожної категорії, щоб дотримуватися правила. Ви просто розташовуєте прикметники в правильному порядку для категорій, які використовуєте.

source: Adjective: Formation Rules
ru: Прилагательное: Правила образования
uk: Прикметник: Правила утворення

source: Formation Rules
ru: Правила образования
uk: Правила утворення

source: The way comparative and superlative degrees are formed depends on the number of syllables in the adjective. There are three main rules to follow.
ru: Способ образования сравнительной и превосходной степеней зависит от количества слогов в прилагательном. Необходимо следовать трем основным правилам.
uk: Спосіб утворення вищого та найвищого ступенів порівняння залежить від кількості складів у прикметнику. Існують три основні правила, яких слід дотримуватися.
