Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Cardinal Numerals: Definition and Formation
ru: Количественные числительные: Определение и образование
uk: Кількісні числівники: Визначення та утворення

source: Cardinal numerals (also known as cardinal numbers) are words that represent specific quantities. They answer the question '<span class="
uk: Кількісні числівники (також відомі як cardinal numbers) — це слова, що позначають конкретні кількості. Вони відповідають на запитання '<span class="

source: Represent exact quantities (one, two, three)
ru: Обозначают точные количества (one, two, three — один, два, три)
uk: Представляють точні кількості (one, two, three)

source: Used for counting objects, people, or abstract concepts
ru: Используются для подсчета предметов, людей или абстрактных понятий
uk: Використовуються для підрахунку предметів, людей або абстрактних понять

source: Form the basis for mathematical operations
ru: Формируют основу для математических операций
uk: Складають основу для математичних операцій

source: Can function as determiners or pronouns
ru: Могут функционировать как определители или местоимения
uk: Можуть функціонувати як визначники або займенники

source: Distinct from ordinal numbers (first, second, third)
ru: Отличаются от порядковых числительных (first, second, third — первый, второй, третий)
uk: Відрізняються від порядкових числівників (first, second, third)

source: 1. Basic Number Formation
ru: 1. Образование основных чисел
uk: 1. Утворення основних чисел

source: English cardinal numbers follow specific patterns that make them relatively easy to learn, though there are some irregularities.
ru: Английские количественные числительные следуют определенным закономерностям, что делает их относительно легкими для изучения, хотя есть и некоторые нерегулярности.
uk: Англійські кількісні числівники мають певні закономірності, що робить їх відносно легкими для вивчення, хоча є деякі нерегулярності.

source: Range
ru: Диапазон
uk: Діапазон

source: Unique words
ru: Уникальные слова
uk: Унікальні слова

source: Must be memorized
ru: Должны быть запомнены
uk: Потрібно запам'ятати

source: Base + <span class="
uk: Основа + <span class="

source: Note: thirteen (not threeteen)
ru: Примечание: thirteen (а не threeteen)
uk: Примітка: thirteen (а не threeteen)

source: Note: forty (not fourty)
ru: Примечание: forty (а не fourty)
uk: Примітка: forty (а не fourty)

source: Tens + hyphen + unit
ru: Десятки + дефис + единицы
uk: Десятки + дефіс + одиниці

source: Hyphen required
ru: Требуется дефис
uk: Потрібен дефіс

source: Pronunciation Tips
ru: Советы по произношению
uk: Поради щодо вимови

source: numbers have stress on the last syllable: thir<span class="
uk: числа мають наголос на останньому складі: thir<span class="

source: Tens numbers have stress on the first syllable: <span class="
uk: Числа десятків мають наголос на першому складі: <span class="

source: In compound numbers (21-99), both parts are stressed: <span class="
uk: У складених числах (21-99) наголошуються обидві частини: <span class="

source: 2. Large Number Formation
ru: 2. Образование больших чисел
uk: 2. Утворення великих чисел

source: English uses specific terms for large numbers, with some differences between American and British English.
ru: В английском языке используются специальные термины для больших чисел, с некоторыми различиями между американским и британским английским.
uk: В англійській мові використовуються спеціальні терміни для великих чисел, з деякими відмінностями між американською та британською англійською.

source: Forming Large Numbers
ru: Образование больших чисел
uk: Утворення великих чисел

source: When writing or saying large numbers:
ru: При написании или произнесении больших чисел:
uk: При написанні або вимові великих чисел:

source: Start with the largest place value
ru: Начинайте с наибольшего разряда
uk: Починайте з найбільшого розряду

source: Use commas to separate thousands, millions, etc.
ru: Используйте запятые для разделения тысяч, миллионов и т. д.
uk: Використовуйте коми для відокремлення тисяч, мільйонів тощо.

source: Use 'and' before the last two digits in British English
ru: Используйте 'and' (и) перед последними двумя цифрами в британском английском
uk: Використовуйте 'and' перед останніми двома цифрами в британській англійській

source: Don't use 'and' in American English except for decimals
ru: Не используйте 'and' (и) в американском английском, кроме как для десятичных дробей
uk: Не використовуйте 'and' в американській англійській, крім випадків десяткових дробів

source: 3. Special Cases and Exceptions
ru: 3. Особые случаи и исключения
uk: 3. Особливі випадки та винятки

source: Collective Numerals
ru: Собирательные числительные
uk: Збірні числівники

source: Some numbers have special forms when counting specific items:
ru: Некоторые числа имеют особые формы при подсчете конкретных предметов:
uk: Деякі числа мають спеціальні форми при підрахунку конкретних предметів:

source: Using plural forms incorrectly: <span class="
uk: Неправильне використання форм множини: <span class="

source: Forgetting hyphens in compound numbers: <span class="
uk: Забування дефісів у складених числах: <span class="

source: Mixing American and British conventions in the same text
ru: Смешивание американских и британских соглашений в одном тексте
uk: Змішування американських та британських конвенцій в одному тексті

source: Using 'and' incorrectly in American English: <span class="
uk: Неправильне використання 'and' в американській англійській: <span class="

source: 4. Practical Usage Examples
ru: 4. Примеры практического использования
uk: 4. Приклади практичного використання

source: Counting objects
ru: Подсчет предметов
uk: Підрахунок предметів

source: is optional
ru: необязательно
uk: є необов'язковим

source: Temperature
ru: Температура
uk: Температура

source: Use \
uk: Використовуйте \

source: Money
ru: Деньги
uk: Гроші

source: used before cents
ru: используется перед центами
uk: використовується перед центами

source: Phone numbers
ru: Номера телефонов
uk: Номери телефонів

source: Digits read individually
ru: Цифры читаются по отдельности
uk: Цифри читаються окремо

source: Ordinal Numerals as Nouns
ru: Порядковые числительные как существительные
uk: Порядкові числівники як іменники

source: Ordinal Numerals Functioning as Nouns
ru: Порядковые числительные, функционирующие как существительные
uk: Порядкові числівники, що функціонують як іменники

source: Ordinal numerals frequently serve as nouns when they represent positions or ranks independently, without modifying another noun. This usage is particularly common in competitive, historical, and temporal contexts.
ru: Порядковые числительные часто служат существительными, когда они самостоятельно обозначают позиции или ранги, не определяя при этом другое существительное. Такое использование особенно распространено в контекстах, связанных с соревнованиями, историей и временем.
uk: Порядкові числівники часто виступають як іменники, коли вони самостійно позначають позиції або ранги, не модифікуючи інший іменник. Це використання особливо поширене в контекстах змагань, історичних та часових.

source: 1. Positional References
ru: 1. Указание на позицию
uk: 1. Позиційні посилання

source: Ordinals as nouns typically refer to people or items in a ranked sequence when the category is understood from context.
ru: Порядковые числительные в качестве существительных обычно обозначают людей или предметы в ранжированной последовательности, когда категория понятна из контекста.
uk: Порядкові числівники як іменники зазвичай позначають людей або предмети в ранжованій послідовності, коли категорія зрозуміла з контексту.

source: Implied Noun
ru: Подразумеваемое существительное
uk: Мається на увазі іменник

source: Competitions
ru: Соревнования
uk: Змагання

source: Family
ru: Семья
uk: Сім'я

source: Dates
ru: Даты
uk: Дати

source: Historical events
ru: Исторические события
uk: Історичні події

source: Important Rules
ru: Важные правила
uk: Важливі правила

source: Always use the definite article <span class="
uk: Завжди використовуйте означений артикль <span class="

source: When the noun is expressed, ordinals function as adjectives: <span class="
uk: Коли іменник виражений, порядкові числівники функціонують як прикметники: <span class="

source: For dates, <span class="
uk: Для дат, <span class="

source: 2. Plural Ordinal Nouns
ru: 2. Порядковые числительные во множественном числе
uk: 2. Порядкові числівники у множині

source: Pluralized ordinal nouns have specialized uses referring to multiple items sharing a rank or representing decades.
ru: Порядковые числительные во множественном числе имеют специализированное использование, обозначая несколько предметов, разделяющих один ранг, или представляя десятилетия.
uk: Порядкові числівники у множині мають спеціалізоване використання, посилаючись на декілька предметів, що мають спільний ранг або представляють десятиліття.

source: Shared Rankings
ru: Разделенные ранги
uk: Спільні ранги

source: Competitions:
uk: Змагання:

source: three first-place winners
uk: три переможці першого місця

source: Sports:
uk: Спорт:

source: five second-place finishes
uk: п'ять фінішів на другому місці

source: Decades and Centuries
ru: Десятилетия и столетия
uk: Десятиліття та століття

source: Years:
ru: Годы:
uk: Роки:

source: Centuries:
ru: Столетия:
uk: Століття:

source: Temperature:
ru: Температура:
uk: Температура:

source: Singular vs. Plural Ordinal Nouns
ru: Порядковые числительные в единственном vs. множественном числе
uk: Порядкові числівники в однині vs. у множині

source: One item in 10th position
ru: Один предмет на 10-й позиции
uk: Один предмет на 10-й позиції

source: Multiple items in 10th position
ru: Несколько предметов на 10-й позиции
uk: Кілька предметів на 10-й позиції

source: 3. Fixed Expressions and Idioms
ru: 3. Устойчивые выражения и идиомы
uk: 3. Усталені вирази та ідіоми

source: Many common phrases use ordinal numerals as nouns with specialized meanings.
ru: Многие распространенные фразы используют порядковые числительные в качестве существительных со специализированными значениями.
uk: Багато поширених фраз використовують порядкові числівники як іменники зі спеціалізованими значеннями.

source: Expression
ru: Выражение
uk: Вираз

source: Address most important matters initially
ru: Сначала рассмотреть наиболее важные вопросы
uk: Спочатку розглянути найважливіші питання

source: Originally; to begin with
ru: Изначально; для начала
uk: Спочатку; для початку

source: Penultimate
ru: Предпоследний
uk: Передостанній

source: Third attempt will succeed
ru: Третья попытка будет успешной
uk: Третя спроба буде успішною

source: 4. Special Usage Cases
ru: 4. Особые случаи использования
uk: 4. Особливі випадки використання

source: Fractions as Nouns
ru: Дроби как существительные
uk: Дроби як іменники

source: Mathematical:
ru: Математические:
uk: Математичні:

source: Measurements:
ru: Измерения:
uk: Вимірювання:

source: Historical and Legal Terms
ru: Исторические и юридические термины
uk: Історичні та юридичні терміни

source: Amendments:
ru: Поправки:
uk: Поправки:

source: Monarchs:
ru: Монархи:
uk: Монархи:

source: Ordinal vs. Cardinal Noun Usage
ru: Использование порядковых и количественных числительных как существительных
uk: Використання порядкових числівників у порівнянні з кількісними числівниками як іменниками

source: Ordinal Example
ru: Пример порядкового числительного
uk: Приклад порядкового числівника

source: Cardinal Example
ru: Пример количественного числительного
uk: Приклад кількісного числівника

source: Date
ru: Дата
uk: Дата

source: Numerals: Decimal Fractions
ru: Числительные: Десятичные дроби
uk: Числівники: Десяткові дроби

source: Fractional and Decimal Numerals
ru: Дробные и десятичные числительные
uk: Дробові та десяткові числівники

source: Decimal Fractions
ru: Десятичные дроби
uk: Десяткові дроби

source: Decimal fractions represent parts of whole numbers using a decimal point system. They are essential for precise measurements, financial transactions, and scientific calculations in English.
ru: Десятичные дроби представляют части целых чисел с использованием системы десятичной точки. Они необходимы для точных измерений, финансовых операций и научных расчетов в английском языке.
uk: Десяткові дроби представляють частини цілих чисел за допомогою системи десяткової точки. Вони є важливими для точних вимірювань, фінансових операцій та наукових обчислень в англійській мові.

source: 1. Reading Decimal Numbers
ru: 1. Чтение десятичных чисел
uk: 1. Читання десяткових чисел

source: Standard Methods
ru: Стандартные методы
uk: Стандартні методи

source: Decimal
ru: Десятичная дробь
uk: Десятковий дріб

source: Point Method
ru: Метод «Point» (Точка)
uk: Метод точки

source: Place Value Method
ru: Метод разряда (Place Value)
uk: Метод розряду

source: General/Math
ru: Общее/Математика
uk: Загальний/Математика

source: Money/Measurements
ru: Деньги/Измерения
uk: Гроші/Вимірювання

source: Precise measurements
ru: Точные измерения
uk: Точні вимірювання

source: Money amounts often drop 'point':
ru: В денежных суммах часто опускается 'point' (точка):
uk: У грошових сумах часто опускають 'point':

source: Temperatures often use 'point':
ru: В температурах часто используется 'point' (точка):
uk: У температурах часто використовують 'point':

source: Sports scores use individual digits:
ru: Спортивные результаты используют отдельные цифры:
uk: У спортивних рахунках використовуються окремі цифри:

source: 2. Practical Usage
ru: 2. Практическое использование
uk: 2. Практичне використання

source: Money and Financial Contexts
ru: Деньги и финансовые контексты
uk: Гроші та фінансові контексти

source: Amount
ru: Сумма
uk: Сума

source: Formal Reading
ru: Формальное чтение
uk: Формальне читання

source: Informal Reading
ru: Неформальное чтение
uk: Неформальне читання

source: Common in prices
ru: Распространено в ценах
uk: Поширено в цінах

source: European format
ru: Европейский формат
uk: Європейський формат

source: UK currency
ru: Валюта Великобритании
uk: Валюта Великобританії

source: Common pricing
ru: Распространенное ценообразование
uk: Поширене ціноутворення

source: Measurements and Quantities
ru: Измерения и количества
uk: Вимірювання та кількості

source: Metric measurements:
ru: Метрические измерения:
uk: Метричні вимірювання:

source: Time measurements:
ru: Измерения времени:
uk: Вимірювання часу:

source: Weight measurements:
ru: Измерения веса:
uk: Вимірювання ваги:

source: 3. International Variations
ru: 3. Международные различия
uk: 3. Міжнародні відмінності

source: Decimal Separators
ru: Разделители десятичных дробей
uk: Десяткові роздільники

source: Country/Region
ru: Страна/Регион
uk: Країна/Регіон

source: Decimal Separator
ru: Разделитель десятичных дробей
uk: Десятковий роздільник

source: Thousand Separator
ru: Разделитель тысяч
uk: Роздільник тисяч

source: Most European countries
ru: Большинство европейских стран
uk: Більшість європейських країн

source: In English writing, always use point as decimal separator
ru: При письме на английском языке всегда используйте точку в качестве разделителя десятичных дробей
uk: В англійському письмі завжди використовуйте точку як десятковий роздільник

source: Financial documents may use comma as thousand separator
ru: В финансовых документах может использоваться запятая в качестве разделителя тысяч
uk: Фінансові документи можуть використовувати кому як роздільник тисяч

source: Some style guides recommend spaces for thousands in scientific writing
ru: Некоторые руководства по стилю рекомендуют использовать пробелы для тысяч в научных текстах
uk: Деякі стилістичні довідники рекомендують використовувати пробіли для тисяч у наукових текстах

source: 4. Common Mistakes to Avoid
ru: 4. Распространенные ошибки, которых следует избегать
uk: 4. Поширені помилки, яких слід уникати

source: Mixing separators
ru: Смешивание разделителей
uk: Змішування роздільників

source: Omitting 'and' in place value method
ru: Опущение 'and' (и) в методе разряда
uk: Пропуск 'and' у методі розряду

source: Incorrect money readings
ru: Неправильное чтение денежных сумм
uk: Неправильне читання грошових сум

source: Numerals: Expressing Time
ru: Числительные: Выражение времени
uk: Числівники: Вираження часу

source: Usage of Numerals in Specific Contexts
ru: Использование числительных в конкретных контекстах
uk: Використання числівників у специфічних контекстах

source: Expressing Time
ru: Выражение времени
uk: Вираження часу

source: Expressing Time in English
ru: Выражение времени в английском языке
uk: Вираження часу в англійській мові

source: Mastering time expressions is essential for daily communication. This guide covers all methods of telling time, including special cases and regional variations.
ru: Освоение выражений времени имеет важное значение для повседневного общения. Это руководство охватывает все способы называния времени, включая особые случаи и региональные различия.
uk: Опанування виразів часу є важливим для щоденного спілкування. Цей посібник охоплює всі методи повідомлення часу, включаючи особливі випадки та регіональні відмінності.

source: 1. Traditional 'Past/To' Method (Analog Time)
ru: 1. Традиционный метод 'Past/To' (Аналоговое время)
uk: 1. Традиційний метод 'Past/To' (Аналоговий час)

source: This conversational method divides the hour into halves, using 'past' for the first half and 'to' for the second half.
ru: Этот разговорный метод делит час на половины, используя 'past' (после) для первой половины и 'to' (до) для второй.
uk: Цей розмовний метод ділить годину на дві половини, використовуючи 'past' для першої половини та 'to' для другої половини.

source: First Half-Hour (00-30 minutes)
ru: Первая половина часа (00-30 минут)
uk: Перша половина години (00-30 хвилин)

source: Second Half-Hour (31-59 minutes)
ru: Вторая половина часа (31-59 минут)
uk: Друга половина години (31-59 хвилин)

source: Special Time Expressions
ru: Особые выражения времени
uk: Спеціальні вирази часу

source: On the hour:
ru: Ровно в час:
uk: Рівно година:

source: 15 minutes:
ru: 15 минут:
uk: 15 хвилин:

source: 30 minutes:
uk: 30 хвилин:

source: never \
uk: ніколи не \

source: 2. Digital Time Method
ru: 2. Метод цифрового времени
uk: 2. Метод цифрового часу

source: This straightforward method is used in formal contexts, schedules, and digital displays.
ru: Этот простой метод используется в формальных контекстах, расписаниях и цифровых дисплеях.
uk: Цей простий метод використовується у формальних контекстах, розкладах та цифрових дисплеях.

source: Basic Digital Reading
ru: Базовое цифровое чтение
uk: Базове цифрове читання

source: military time
ru: военное время
uk: військовий час

source: 24-Hour Clock (Military Time)
ru: 24-часовой формат (военное время)
uk: 24-годинний формат (військовий час)

source: 3. AM/PM Time Designations
ru: 3. Обозначения времени AM/PM
uk: 3. Позначення часу AM/PM

source: These Latin abbreviations help distinguish morning from afternoon/evening times.
ru: Эти латинские аббревиатуры помогают отличить утреннее время от дневного/вечернего.
uk: Ці латинські скорочення допомагають розрізняти ранковий час від полуденного/вечірнього.

source: Notation
ru: Обозначение
uk: Позначення

source: Ante meridiem (before noon)
ru: Ante meridiem (до полудня)
uk: Ante meridiem (до полудня)

source: Post meridiem (after noon)
ru: Post meridiem (после полудня)
uk: Post meridiem (після полудня)

source: Noon (midday)
ru: Полдень
uk: Полудень

source: Midnight
ru: Полночь
uk: Північ

source: 4. Special Time Expressions
ru: 4. Особые выражения времени
uk: 4. Спеціальні вирази часу

source: Approximate Times
ru: Приблизительное время
uk: Приблизний час

source: About/around:
ru: Около/примерно:
uk: Близько/навколо:

source: Just after/before:
ru: Сразу после/перед:
uk: Одразу після/до:

source: Almost/nearly:
ru: Почти/практически:
uk: Майже/близько:

source: Time-Related Phrases
ru: Фразы, связанные со временем
uk: Фрази, пов'язані з часом

source: Sharp:
ru: Ровно (Sharp):
uk: Рівно:

source: On the dot:
ru: Точно (On the dot):
uk: Точно (як годинник):

source: In the morning/afternoon/evening:
ru: Утром/днем/вечером:
uk: Вранці/вдень/ввечері:

source: Important Notes About Time Expressions
ru: Важные примечания о выражениях времени
uk: Важливі примітки про вирази часу

source: In formal writing, always use figures with <span class="
uk: У формальному письмі завжди використовуйте цифри з <span class="

source: British English sometimes uses <span class="
uk: Британська англійська іноді використовує <span class="

source: For 12:00, specify <span class="
uk: Для 12:00, уточнюйте <span class="

source: In the 24-hour system, no AM/PM is needed: <span class="
uk: У 24-годинній системі AM/PM не потрібні: <span class="

source: Time Expression Comparison
ru: Сравнение выражений времени
uk: Порівняння виразів часу

source: Traditional
ru: Традиционный
uk: Традиційний

source: Digital
ru: Цифровой
uk: Цифровий

source: 24-Hour
ru: 24-часовой
uk: 24-годинний

source: Numerals: Noun Agreement with Fractions
ru: Числительные: Согласование существительных с дробями
uk: Числівники: Узгодження іменника з дробами

source: Noun Agreement with Fractions
ru: Согласование существительных с дробями
uk: Узгодження іменника з дробами

source: Proper noun agreement with fractions ensures grammatical accuracy in both written and spoken English. These rules govern how nouns and verbs interact with fractional quantities.
ru: Правильное согласование существительных с дробями обеспечивает грамматическую точность как в письменном, так и в устном английском языке. Эти правила регулируют взаимодействие существительных и глаголов с дробными количествами.
uk: Правильне узгодження іменника з дробами забезпечує граматичну точність як у писемній, так і в усній англійській мові. Ці правила регулюють, як іменники та дієслова взаємодіють із дробовими величинами.

source: 1. Core Agreement Rules
ru: 1. Основные правила согласования
uk: 1. Основні правила узгодження

source: Fraction Value Determines Agreement
ru: Величина дроби определяет согласование
uk: Величина дробу визначає узгодження

source: Fraction Value
ru: Величина дроби
uk: Величина дробу

source: Verb Form
ru: Форма глагола
uk: Форма дієслова

source: Less than 1
ru: Меньше 1
uk: Менше 1

source: Equal to 1
ru: Равно 1
uk: Дорівнює 1

source: Greater than 1
ru: Больше 1
uk: Більше 1

source: Fractions of one with plural nouns:
ru: Дроби от единицы с существительными во множественном числе:
uk: Дроби одиниці з іменниками у множині:

source: Mixed numbers with measurement units:
ru: Смешанные числа с единицами измерения:
uk: Мішані числа з одиницями вимірювання:

source: 2. Countable vs. Uncountable Nouns
ru: 2. Исчисляемые и неисчисляемые существительные
uk: 2. Злічувані проти незлічуваних іменників

source: Portion of countable plural
ru: Часть исчисляемого множественного числа
uk: Частина злічуваного іменника у множині

source: Collective noun treated as unit
ru: Собирательное существительное, рассматриваемое как единица
uk: Збірний іменник розглядається як одиниця

source: Multiple countable items
ru: Множество исчисляемых предметов
uk: Кілька злічуваних предметів

source: Always singular:
ru: Всегда единственное число:
uk: Завжди в однині:

source: No plural form:
ru: Нет формы множественного числа:
uk: Немає форми множини:

source: Measurement units:
ru: Единицы измерения:
uk: Одиниці вимірювання:

source: 3. Special Considerations
ru: 3. Особые случаи
uk: 3. Особливі міркування

source: Can take singular or plural depending on meaning:
ru: Может принимать единственное или множественное число в зависимости от значения:
uk: Може вживатися в однині або множині залежно від значення:

source: Percentage Equivalents
ru: Процентные эквиваленты
uk: Еквіваленти у відсотках
