Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: The Present Simple is typically used for <strong>Stative Verbs</strong> (verbs describing states, not actions), even if the state is happening now. <strong>Action Verbs</strong> can be used in both simple and continuous forms.
ru: Present Simple обычно используется для **глаголов состояния (Stative Verbs)** (глаголов, описывающих состояния, а не действия), даже если состояние происходит сейчас. **Глаголы действия (Action Verbs)** могут использоваться как в простых, так и в продолженных формах.
uk: Present Simple зазвичай використовується для **Стативних Дієслів** (дієслів, що описують стани, а не дії), навіть якщо стан відбувається зараз. **Дієслова Дії** можуть використовуватися як у простих, так і в тривалих формах.

source: Stative Verb (opinion):
ru: Глагол состояния (мнение):
uk: Стативне Дієслово (думка):

source: Action Verb (current thought process):
ru: Глагол действия (текущий мыслительный процесс):
uk: Дієслово Дії (поточний процес мислення):

source: For Dynamic Narrative:
ru: 8. Для динамического повествования:
uk: Для Динамічного Оповідання:

source: This tense is used in sports commentary and news headlines to make events seem immediate and dramatic.
ru: Это время используется в спортивных комментариях и заголовках новостей, чтобы сделать события немедленными и драматичными.
uk: Цей час використовується у спортивних коментарях та заголовках новин, щоб події здавалися безпосередніми та драматичними.

source: Sports Commentary:
ru: Спортивный комментарий:
uk: Спортивний Коментар:

source: News Headline:
ru: Заголовок новости:
uk: Заголовок Новин:

source: Regular and Irregular Verbs
ru: Правильные и неправильные глаголы
uk: Правильні та Неправильні Дієслова

source: English verbs are broadly categorized into two main types based on how they form their past tenses and past participles: <span class=\
ru: Глаголы в английском языке в целом делятся на два основных типа в зависимости от того, как они образуют прошедшее время и причастие прошедшего времени: <span class=\
uk: Англійські дієслова поділяються на два основних типи залежно від того, як вони утворюють свої форми минулого часу та дієприкметники минулого часу: <span class=\

source: Regular Verbs
ru: Правильные глаголы
uk: Правильні Дієслова

source: Rules for Adding the -ed Ending
ru: Правила добавления окончания -ed
uk: Правила Додавання Закінчення -ed

source: If the verb ends in <span class=\
ru: Если глагол оканчивается на <span class=\
uk: Якщо дієслово закінчується на <span class=\

source: If the verb ends in a <span class=\
ru: Если глагол оканчивается на <span class=\
uk: Якщо дієслово закінчується на <span class=\

source: Doubling the Final Consonant:
ru: Удвоение конечной согласной:
uk: Подвоєння Кінцевої Приголосної:

source: For single-syllable verbs ending in a <span class=\
ru: Для односложных глаголов, оканчивающихся на <span class=\
uk: Для односкладових дієслів, що закінчуються на <span class=\

source: For multi-syllable verbs ending in a <span class=\
ru: Для многосложных глаголов, оканчивающихся на <span class=\
uk: Для багатоскладових дієслів, що закінчуються на <span class=\

source: (In American English: <span class=\
ru: (В американском английском: <span class=\
uk: (В Американській англійській: <span class=\

source: Pronunciation of the -ed Ending
ru: Произношение окончания -ed
uk: Вимова Закінчення -ed

source: As the sound <span class=\
ru: Как звук <span class=\
uk: Як звук <span class=\

source: Irregular Verbs
ru: Неправильные глаголы
uk: Неправильні Дієслова

source: There are no simple rules for forming irregular verbs; their forms must typically be memorized. They are very common in English and include many of the most frequently used verbs.
ru: Для образования неправильных глаголов нет простых правил; их формы, как правило, необходимо запомнить. Они очень распространены в английском языке и включают многие из наиболее часто используемых глаголов.
uk: Не існує простих правил для утворення неправильних дієслів; їхні форми зазвичай потрібно запам'ятовувати. Вони дуже поширені в англійській мові та включають багато найбільш вживаних дієслів.

source: While challenging, mastering irregular verbs is crucial for fluency as they are fundamental to everyday communication.
ru: Хотя это и сложно, освоение неправильных глаголов имеет решающее значение для беглости, поскольку они являются основой повседневного общения.
uk: Хоча це й складно, освоєння неправильних дієслів має вирішальне значення для вільного володіння мовою, оскільки вони є фундаментальними для щоденного спілкування.

source: The Subjunctive Mood
ru: Сослагательное наклонение (The Subjunctive Mood)
uk: Умовний Спосіб (The Subjunctive Mood)

source: This section discusses the subjunctive mood, used to express wishes, recommendations, demands, or hypothetical situations.
ru: В этом разделе обсуждается сослагательное наклонение, используемое для выражения пожеланий, рекомендаций, требований или гипотетических ситуаций.
uk: Цей розділ обговорює умовний спосіб, що використовується для вираження бажань, рекомендацій, вимог або гіпотетичних ситуацій.

source: Forms of the Subjunctive Mood
ru: Формы сослагательного наклонения
uk: Форми Умовного Способу

source: Although its use has become less frequent in modern English, especially in informal contexts, it remains important for specific formal constructions and expressions.
ru: Хотя его использование стало менее частым в современном английском, особенно в неформальных контекстах, оно остается важным для определенных формальных конструкций и выражений.
uk: Хоча його використання стало менш частим у сучасній англійській мові, особливо в неформальних контекстах, він залишається важливим для специфічних формальних конструкцій та виразів.

source: The Limited Forms of the Subjunctive Mood
ru: Ограниченные формы сослагательного наклонения
uk: Обмежені Форми Умовного Способу

source: The subjunctive mood in English has very limited and distinct forms, primarily affecting the verb <span class=\
ru: Сослагательное наклонение в английском языке имеет очень ограниченные и четкие формы, в основном затрагивающие глагол <span class=\
uk: Умовний спосіб в англійській мові має дуже обмежені та чіткі форми, які переважно стосуються дієслова <span class=\

source: 1. The Present Subjunctive (Base Form Subjunctive)
ru: 1. Настоящее сослагательное наклонение (Present Subjunctive)
uk: 1. Теперішній Умовний Спосіб (The Present Subjunctive / Base Form Subjunctive)

source: The present subjunctive uses the <span class=\
ru: Настоящее сослагательное наклонение использует ***базовую форму глагола*** <span class=\
uk: Теперішній умовний спосіб використовує <span class=\

source: Other Verbs
ru: Другие глаголы
uk: Інші Дієслова

source: Example Sentence (Present Subjunctive)
ru: Пример предложения (Present Subjunctive)
uk: Приклад Речення (Present Subjunctive)

source: Instead of \
ru: Вместо \
uk: Замість \

source: 2. The Past Subjunctive
ru: 2. Прошедшее сослагательное наклонение (Past Subjunctive)
uk: 2. Минулий Умовний Спосіб (The Past Subjunctive)

source: The past subjunctive is primarily used in <span class=\
ru: Прошедшее сослагательное наклонение в основном используется в ***условных предложениях второго типа*** <span class=\
uk: Минулий умовний спосіб переважно використовується в <span class=\

source: For the verb
ru: Для глагола
uk: Для дієслова

source: the past subjunctive form is
ru: форма прошедшего сослагательного наклонения — это
uk: форма минулого умовного способу – це

source: This is the most recognizable form of the subjunctive mood.
ru: Это самая узнаваемая форма сослагательного наклонения.
uk: Це найбільш впізнавана форма умовного способу.

source: other verbs
ru: других глаголов
uk: інших дієслів

source: the past subjunctive is
ru: прошедшее сослагательное наклонение
uk: минулий умовний спосіб є

source: identical to the simple past indicative form
ru: идентично форме простого прошедшего изъявительного наклонения
uk: ідентичним формі простого минулого дійсного способу

source: However, its function is different – it expresses unreality, not past fact.
ru: Однако его функция отличается – оно выражает нереальность, а не факт из прошлого.
uk: Проте його функція інша – він виражає нереальність, а не факт минулого.

source: 3. The Past Perfect Subjunctive
ru: 3. Предпрошедшее сослагательное наклонение (Past Perfect Subjunctive)
uk: 3. Минулий Доконаний Умовний Спосіб (The Past Perfect Subjunctive)

source: The past perfect subjunctive is identical in form to the past perfect indicative
ru: Предпрошедшее сослагательное наклонение идентично по форме предпрошедшему изъявительному наклонению
uk: Минулий доконаний умовний спосіб ідентичний за формою минулому доконаному дійсному способу

source: It is used in <span class=\
ru: Оно используется в ***условных предложениях третьего типа*** <span class=\
uk: Він використовується в <span class=\

source: Expressing an unreal condition in the past
ru: Выражение нереального условия в прошлом
uk: Вираження нереальної умови в минулому

source: Expressing regret about a past action
ru: Выражение сожаления о прошлом действии
uk: Вираження жалю про минулу дію

source: Use of the Subjunctive Mood
ru: Использование сослагательного наклонения
uk: Використання Умовного Способу

source: The subjunctive mood is typically used in more formal contexts, specific fixed expressions, or constructions that convey non-factual or desired situations.
ru: Сослагательное наклонение обычно используется в более формальных контекстах, в конкретных устойчивых выражениях или конструкциях, которые передают нереальные или желаемые ситуации.
uk: Умовний спосіб зазвичай використовується у більш формальних контекстах, специфічних сталих виразах або конструкціях, які передають нефактичні або бажані ситуації.

source: 1. Mandative Subjunctive (after Verbs of Demand, Recommendation, Suggestion, etc.)
ru: 1. Сослагательное наклонение повелительного типа (после глаголов требования, рекомендации, предложения и т. д.)
uk: 1. Мандативний Умовний Спосіб (після Дієслів Вимоги, Рекомендації, Пропозиції тощо)

source: Used in
ru: Используется в
uk: Використовується в

source: clauses after verbs that express a <span class=\
ru: придаточных предложениях после глаголов, выражающих ***требование, приказ или рекомендацию*** <span class=\
uk: підрядних реченнях після дієслів, що виражають <span class=\

source: Common Verbs:
ru: Распространенные глаголы:
uk: Поширені Дієслова:

source: 2. Subjunctive after Adjectives Expressing Importance, Necessity, Urgency
ru: 2. Сослагательное наклонение после прилагательных, выражающих важность, необходимость, срочность
uk: 2. Умовний Спосіб після Прикметників, Що Виражають Важливість, Необхідність, Терміновість

source: clauses after adjectives that express <span class=\
ru: придаточных предложениях после прилагательных, выражающих ***важность или необходимость*** <span class=\
uk: підрядних реченнях після прикметників, що виражають <span class=\

source: Common Adjectives:
ru: Распространенные прилагательные:
uk: Поширені Прикметники:

source: 3. Subjunctive in Conditional Sentences (Hypothetical Situations)
ru: 3. Сослагательное наклонение в условных предложениях (гипотетические ситуации)
uk: 3. Умовний Спосіб в Умовних Реченнях (Гіпотетичні Ситуації)

source: The subjunctive is used in the
ru: Сослагательное наклонение используется в ***условии***
uk: Умовний спосіб використовується в

source: clause of <span class=\
ru: в ***условных предложениях*** <span class=\
uk: реченні <span class=\

source: Type 2 Conditional (Unreal Present/Future):
ru: Условные предложения типа 2 (Нереальное настоящее/будущее):
uk: Умовне речення Типу 2 (Нереальне Теперішнє/Майбутнє):

source: Uses the <span class=\
ru: Использует ***Past Subjunctive*** <span class=\
uk: Використовує <span class=\

source: But I am not a bird.
ru: Но я не птица.
uk: Але я не птах.

source: But she doesn't know.
ru: Но она не знает.
uk: Але вона не знає.

source: Type 3 Conditional (Unreal Past):
ru: Условные предложения типа 3 (Нереальное прошлое):
uk: Умовне речення Типу 3 (Нереальне Минуле):

source: But he didn't study, so he didn't pass.
ru: Но он не учился, поэтому не сдал.
uk: Але він не навчався, тому не склав.

source: 4. Subjunctive in Expressions of Wish, Doubt, or Supposition
ru: 4. Сослагательное наклонение в выражениях пожелания, сомнения или предположения
uk: 4. Умовний Спосіб у Виразах Бажання, Сумніву або Припущення

source: clauses (often implied
ru: придаточных предложениях (часто подразумевается
uk: підрядних реченнях (часто мається на увазі

source: or with
ru: или с
uk: або з

source: to express wishes, doubts, or suppositions that are contrary to fact.
ru: для выражения пожеланий, сомнений или предположений, которые противоречат фактам.
uk: для вираження бажань, сумнівів або припущень, які суперечать фактам.

source: Wishes
ru: Пожелания
uk: Бажання

source: Past subjunctive for a wish about the present
ru: Past subjunctive для пожелания о настоящем
uk: Минулий умовний спосіб для бажання щодо теперішнього

source: Past perfect subjunctive for a wish/regret about the past
ru: Past perfect subjunctive для пожелания/сожаления о прошлом
uk: Минулий доконаний умовний спосіб для бажання/жалю щодо минулого

source: As if / As though
ru: As if / As though (Как если бы / Как будто)
uk: As if / As though (Немовби / Хоча)

source: But she isn't the boss.
ru: Но она не босс.
uk: Але вона не бос.

source: But he doesn't know everything.
ru: Но он не знает всего.
uk: Але він не знає всього.

source: 5. Fixed Expressions and Idiomatic Phrases
ru: 5. Устойчивые выражения и идиоматические фразы
uk: 5. Сталі Вирази та Ідіоматичні Фрази

source: The subjunctive is preserved in many traditional or idiomatic expressions, often without a preceding main clause verb of command or suggestion. These are typically formulaic.
ru: Сослагательное наклонение сохраняется во многих традиционных или идиоматических выражениях, часто без предшествующего глагола главного предложения, выражающего команду или предложение. Обычно они являются формульными.
uk: Умовний спосіб зберігається в багатьох традиційних або ідіоматичних виразах, часто без попереднього дієслова головного речення, що виражає команду чи пропозицію. Вони зазвичай є формульними.

source: Declining Use in Modern English
ru: Снижение использования в современном английском
uk: Зменшення Використання у Сучасній Англійській Мові

source: In modern, informal English, the subjunctive mood is often replaced by other constructions, particularly:
ru: В современном, неформальном английском языке сослагательное наклонение часто заменяется другими конструкциями, в частности:
uk: У сучасній, неформальній англійській мові умовний спосіб часто замінюється іншими конструкціями, зокрема:

source: Modal verbs
ru: Модальные глаголы
uk: Модальні дієслова

source: Formal Subjunctive:
ru: Формальное сослагательное наклонение:
uk: Формальний Умовний Спосіб:

source: Informal Equivalent:
ru: Неформальный эквивалент:
uk: Неформальний Еквівалент:

source: Indicative forms (especially after \
ru: Формы изъявительного наклонения (особенно после \
uk: Дійсні форми (особливо після \

source: Commonly used, though technically less formal
ru: Часто используется, хотя технически менее формально
uk: Поширено вживається, хоча технічно менш формально

source: Despite this trend, understanding the subjunctive mood is essential for comprehending formal texts, classic literature, and for maintaining a high level of grammatical precision in your own writing.
ru: Несмотря на эту тенденцию, понимание сослагательного наклонения необходимо для осмысления официальных текстов, классической литературы и для поддержания высокого уровня грамматической точности в вашем собственном письме.
uk: Незважаючи на цю тенденцію, розуміння умовного способу є важливим для сприйняття формальних текстів, класичної літератури та для підтримки високого рівня граматичної точності у власному письмі.

source: Table of Irregular Verbs
ru: Таблица неправильных глаголов
uk: Таблиця Неправильних Дієслів

source: Irregular verbs are a fundamental part of English grammar, as they do not follow the standard <span class=\
ru: Неправильные глаголы являются фундаментальной частью английской грамматики, поскольку они не следуют стандартному правилу добавления ***-ed*** <span class=\
uk: Неправильні дієслова є фундаментальною частиною англійської граматики, оскільки вони не дотримуються стандартного <span class=\

source: Below is a comprehensive table of common irregular verbs, showing their base form (V1), past simple (V2), and past participle (V3).
ru: Ниже приведена полная таблица распространенных неправильных глаголов, показывающая их основную форму (V1), простое прошедшее время (V2) и причастие прошедшего времени (V3).
uk: Нижче наведено повну таблицю поширених неправильних дієслів, що показує їхню основну форму (V1), простий минулий час (V2) та дієприкметник минулого часу (V3).

source: Base Form (V1)
ru: Основная форма (V1)
uk: Основна Форма (V1)

source: Past Simple (V2)
ru: Простое прошедшее время (V2)
uk: Простий Минулий Час (V2)

source: Past Participle (V3)
ru: Причастие прошедшего времени (V3)
uk: Дієприкметник Минулого Часу (V3)

source: Exceptions to the Sequence of Tenses Rule
ru: Исключения из правила согласования времен
uk: Винятки з Правила Узгодження Часів

source: The Sequence of Tenses
ru: Согласование времен (The Sequence of Tenses)
uk: Узгодження Часів

source: Exceptions
ru: Исключения
uk: Винятки

source: While the <span class=\
ru: Хотя ***Общее правило согласования времен*** <span class=\
uk: Хоча <span class=\

source: 1. Universal Truths or Scientific Facts
ru: 1. Всеобщие истины или научные факты
uk: 1. Загальновизнані Істини або Наукові Факти

source: If the statement in the subordinate clause expresses a <span class=\
ru: Если утверждение в придаточном предложении выражает ***вечную истину, закон природы или общеизвестный факт*** <span class=\
uk: Якщо твердження в підрядному реченні виражає <span class=\

source: Example 1 (Scientific Fact):
ru: Пример 1 (Научный факт):
uk: Приклад 1 (Науковий Факт):

source: Even though \
ru: Даже если \
uk: Незважаючи на те, що \

source: Example 2 (General Truth):
ru: Пример 2 (Всеобщая истина):
uk: Приклад 2 (Загальна Істина):

source: 2. Statements that are Still True or Relevant in the Present
ru: 2. Утверждения, которые до сих пор верны или актуальны в настоящем
uk: 2. Твердження, які Все Ще Є Правдивими Або Актуальними У Теперішньому Часі

source: When the action or state described in the subordinate clause is <span class=\
ru: Когда действие или состояние, описанное в придаточном предложении, является ***актуальным или истинным в момент сообщения*** <span
uk: Коли дія або стан, описані в підрядному реченні, є <span class=\

source: Example 1 (Current Location):
ru: Пример 1 (Текущее местоположение):
uk: Приклад 1 (Поточне Місцезнаходження):

source: If she still lives in London now.
ru: Если она все еще живет в Лондоне сейчас.
uk: Якщо вона все ще живе в Лондоні зараз.

source: Alternatively (and also correct):
ru: Альтернативно (и тоже правильно):
uk: Альтернативно (і також правильно):

source: This doesn't explicitly state if she still lives there, but is grammatically correct.
ru: Это явно не указывает, живет ли она там до сих пор, но грамматически верно.
uk: Це явно не стверджує, чи вона все ще там живе, але є граматично правильним.

source: Example 2 (Ongoing State/Situation):
ru: Пример 2 (Продолжающееся состояние/ситуация):
uk: Приклад 2 (Тривалий Стан/Ситуація):

source: If he is still busy at the moment of reporting.
ru: Если он все еще занят в момент сообщения.
uk: Якщо він все ще зайнятий у момент повідомлення.

source: If the challenges are ongoing.
ru: Если проблемы продолжаются.
uk: Якщо проблеми тривають.

source: Example 3 (Preferences/Opinions):
ru: Пример 3 (Предпочтения/Мнения):
uk: Приклад 3 (Вподобання/Думки):

source: If this preference still holds true.
ru: Если это предпочтение все еще остается верным.
uk: Якщо це вподобання все ще є правдивим.

source: 3. Unreal Conditionals (Hypothetical Situations)
ru: 3. Нереальные условные предложения (гипотетические ситуации)
uk: 3. Нереальні Умовні Речення (Гіпотетичні Ситуації)

source: The tenses used in <span class=\
ru: Времена, используемые в ***условных предложениях 2-го и 3-го типов*** <span class=\
uk: Часи, що використовуються в <span class=\

source: Example 1 (Type 2 Conditional - Unreal Present/Future):
ru: Пример 1 (Условное предложение типа 2 – Нереальное настоящее/будущее):
uk: Приклад 1 (Умовне речення Типу 2 - Нереальне Теперішнє/Майбутнє):

source: Example 2 (Type 3 Conditional - Unreal Past):
ru: Пример 2 (Условное предложение типа 3 – Нереальное прошлое):
uk: Приклад 2 (Умовне речення Типу 3 - Нереальне Минуле):

source: 4. Modal Verbs
ru: 4. Модальные глаголы
uk: 4. Модальні Дієслова

source: Some modal verbs <span class=\
ru: Некоторые модальные глаголы ***не меняются (не смещаются)*** <span class=\
uk: Деякі модальні дієслова <span class=\

source: already past of \
ru: уже являются прошедшей формой \
uk: вже минулий час від \

source: already the conditional form
ru: уже являются условной формой
uk: вже умовна форма

source: already the conditional form or for advice
ru: уже являются условной формой или используются для совета
uk: вже умовна форма або для поради

source: can change to
ru: может измениться на
uk: може змінитися на

source: for obligation
ru: для выражения обязательства
uk: для зобов'язання

source: or remain
ru: или остаться
uk: або залишитися

source: for deduction
ru: для выражения дедукции
uk: для висновку

source: 5. Specific Time Reference (Optional Backshift for Past Simple)
ru: 5. Конкретная ссылка на время (опциональное смещение для Past Simple)
uk: 5. Конкретна Часова Згадка (Необов'язкове Зміщення Для Past Simple)

source: When the subordinate clause includes a <span class=\
ru: Когда придаточное предложение включает ***конкретную ссылку на время*** <span class=\
uk: Коли підрядне речення містить <span class=\

source: Common and correct
ru: Распространено и правильно
uk: Поширено та правильно

source: Also correct:
ru: Также правильно:
uk: Також правильно:

source: Understanding these exceptions allows for more precise and natural use of English tenses in complex sentences, particularly in reported speech.
ru: Понимание этих исключений позволяет более точно и естественно использовать английские времена в сложных предложениях, особенно в косвенной речи.
uk: Розуміння цих винятків дозволяє більш точно та природно використовувати англійські часи у складних реченнях, особливо в непрямій мові.

source: This section explains the rules for how tenses are used in a main clause and a subordinate clause when the main clause is in a past tense.
ru: В этом разделе объясняются правила использования времен в главном и придаточном предложениях, когда главное предложение стоит в прошедшем времени.
uk: Цей розділ пояснює правила використання часів у головному та підрядному реченні, коли головне речення стоїть у минулому часі.

source: General Rule for Sequence of Tenses
ru: Общее правило согласования времен
uk: Загальне Правило Узгодження Часів

source: The Core Principle
ru: Основной принцип
uk: Основний Принцип

source: The general rule is simple: <span class=\
ru: Общее правило простое: ***если глагол в главном предложении стоит в одном из прошедших времен, то и глагол в придаточном предложении должен стоять в одном из прошедших времен*** <span class=\
uk: Загальне правило просте: <span class=\

source: Direct Speech:
ru: Прямая речь:
uk: Пряма Мова:

source: Present tense in direct speech
ru: Настоящее время в прямой речи
uk: Теперішній час у прямій мові

source: Reported Speech (Indirect Speech):
ru: Косвенная речь (Reported Speech):
uk: Непряма Мова (Reported Speech / Indirect Speech):
