Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: The zero article (the absence of 'a', 'an', or 'the') is used when you are talking about nouns in a general, non-specific sense. This is particularly important for plural countable nouns and uncountable nouns.
ru: Нулевой артикль (отсутствие 'a', 'an' или 'the') используется, когда вы говорите о существительных в общем, неопределенном смысле. Это особенно важно для исчисляемых существительных во множественном числе и неисчисляемых существительных.
uk: Нульовий артикль (відсутність 'a', 'an' або 'the') використовується, коли ви говорите про іменники в загальному, неспецифічному сенсі. Це особливо важливо для злічуваних іменників у множині та незлічуваних іменників.

source: 1. Plural Countable Nouns (in a General Sense)
ru: 1. Исчисляемые существительные во множественном числе (в общем смысле)
uk: 1. Злічувані іменники у множині (в загальному сенсі)

source: When you are referring to an entire class of things or people, and not specific ones, you do not use an article.
ru: Когда вы ссылаетесь на целый класс вещей или людей, а не на конкретные, вы не используете артикль.
uk: Коли ви посилаєтеся на цілий клас речей або людей, а не на конкретні, ви не використовуєте артикль.

source: Zero Article (General)
ru: Нулевой артикль (Общий)
uk: Нульовий артикль (Загальний)

source: With 'The' (Specific)
ru: С 'The' (Конкретный)
uk: З 'The' (Конкретний)

source: <strong>Explanation:</strong> In the first column, we are talking about dogs and books in general. In the second, we are specifying a particular group of dogs or books.
ru: <strong>Пояснение:</strong> В первом столбце мы говорим о собаках и книгах в целом. Во втором мы уточняем конкретную группу собак или книг.
uk: <strong>Пояснення:</strong> У першій колонці ми говоримо про собак і книги взагалі. У другій ми вказуємо на конкретну групу собак або книг.

source: 2. Uncountable Nouns (in a General Sense)
ru: 2. Неисчисляемые существительные (в общем смысле)
uk: 2. Незлічувані іменники (в загальному сенсі)

source: <strong>Explanation:</strong> The zero article is used for the concept of 'money' and 'information.' 'The' is used when we are talking about a specific amount of money or a specific set of information.
ru: <strong>Пояснение:</strong> Нулевой артикль используется для концепций 'деньги' и 'информация'. 'The' используется, когда речь идет о конкретной сумме денег или конкретном наборе информации.
uk: <strong>Пояснення:</strong> Нульовий артикль використовується для понять 'гроші' та 'інформація'. 'The' використовується, коли ми говоримо про конкретну суму грошей або конкретний набір інформації.

source: The Zero Article: With Proper Nouns
ru: Нулевой артикль: С именами собственными
uk: Нульовий артикль: З власними назвами

source: With Proper Nouns
ru: С именами собственными
uk: З власними назвами

source: Proper nouns, which are unique names of people, places, and organizations, generally do not take an article. This is because they are already specific by their very nature.
ru: Имена собственные, которые являются уникальными названиями людей, мест и организаций, обычно не требуют артикля. Это связано с тем, что они уже конкретны по своей природе.
uk: Власні назви, які є унікальними іменами людей, місць та організацій, зазвичай не вимагають артикля. Це тому, що вони вже є конкретними за своєю природою.

source: 1. Names of People and Titles
ru: 1. Имена людей и титулы
uk: 1. Імена людей та звання

source: Do not use an article with personal names or titles, unless a specific rule applies (e.g., family names).
ru: Не используйте артикль с личными именами или титулами, если не применяется конкретное правило (например, для фамилий).
uk: Не використовуйте артикль з особистими іменами або званнями, якщо не застосовується конкретне правило (наприклад, прізвища).

source: <strong>Exception:</strong> Use <span class=\
ru: <strong>Исключение:</strong> Используйте <span class=\
uk: <strong>Виняток:</strong> Використовуйте <span class=\

source: 2. Most Countries, Cities, and Continents
ru: 2. Большинство стран, городов и континентов
uk: 2. Більшість країн, міст та континентів

source: As a general rule, we do not use an article with the names of most countries, cities, or continents.
ru: Как общее правило, мы не используем артикль с названиями большинства стран, городов или континентов.
uk: Як правило, ми не використовуємо артикль з назвами більшості країн, міст чи континентів.

source: Countries:
ru: Страны:
uk: Країни:

source: Cities:
ru: Города:
uk: Міста:

source: Continents:
ru: Континенты:
uk: Континенти:

source: <strong>Exceptions:</strong> Remember to use <span class=\
ru: <strong>Исключения:</strong> Не забывайте использовать <span class=\
uk: <strong>Винятки:</strong> Не забувайте використовувати <span class=\

source: 3. Single Mountains, Islands, and Lakes
ru: 3. Отдельные горы, острова и озера
uk: 3. Одиничні гори, острови та озера

source: Unlike mountain ranges or groups of islands, individual geographic features typically do not take an article.
ru: В отличие от горных хребтов или групп островов, отдельные географические объекты обычно не требуют артикля.
uk: На відміну від гірських хребтів чи груп островів, окремі географічні об'єкти зазвичай не вимагають артикля.

source: Zero Article (Single)
ru: Нулевой артикль (Отдельный)
uk: Нульовий артикль (Одиничний)

source: With 'The' (Group/Range)
ru: С 'The' (Группа/Хребет)
uk: З 'The' (Група/Хребет)

source: Articles are a type of determiner that always precede a noun (or a noun phrase) to specify its definiteness or indefiniteness. They are among the most frequently used words in English and are crucial for clear communication.
ru: Артикли — это тип определителя, который всегда предшествует существительному (или именной фразе), чтобы указать на его определенность или неопределенность. Они являются одними из наиболее часто используемых слов в английском языке и имеют решающее значение для четкого общения.
uk: Артиклі — це тип детермінативів, які завжди передують іменнику (або іменній фразі), щоб уточнити його означеність чи неозначеність. Вони є одними з найбільш вживаних слів в англійській мові та мають вирішальне значення для чіткого спілкування.

source: Articles: Definition, Types, and Usage
ru: Артикли: Определение, типы и использование
uk: Артиклі: Визначення, типи та вживання

source: Definition and Components of Complex Sentences
ru: Определение и составляющие сложноподчиненных предложений
uk: Визначення та складові складних речень

source: Complex Sentences
ru: Сложноподчиненные предложения
uk: Складні речення

source: Definition and Components
ru: Определение и составляющие
uk: Визначення та складові

source: Complex Sentences: Structure and Function
ru: Сложноподчиненные предложения: Структура и функция
uk: Складні речення: Структура та функція

source: Key Components
ru: Ключевые составляющие
uk: Ключові складові

source: Independent Clause
ru: Независимое предложение (главное)
uk: Головне речення

source: A complete thought that can stand alone as a sentence. Contains a subject and predicate.
ru: Законченная мысль, которая может существовать как отдельное предложение. Содержит подлежащее и сказуемое.
uk: Повна думка, яка може існувати як самостійне речення. Містить підмет і присудок.

source: Dependent Clause
ru: Зависимое предложение (придаточное)
uk: Підрядне речення

source: Cannot stand alone; begins with a subordinating conjunction or relative pronoun. Contains a subject and verb but doesn't express a complete thought.
ru: Не может существовать самостоятельно; начинается с подчинительного союза или относительного местоимения. Содержит подлежащее и глагол, но не выражает законченную мысль.
uk: Не може існувати самостійно; починається з підрядного сполучника або відносного займенника. Містить підмет і дієслово, але не виражає повної думки.

source: Types of Dependent Clauses
ru: Типы придаточных предложений
uk: Типи підрядних речень

source: 1. Adverbial Clauses
ru: 1. Придаточные предложения (обстоятельственные)
uk: 1. Прислівникові підрядні речення

source: Function as adverbs; answer questions like when, where, why, how. Begin with subordinating conjunctions:
ru: Выполняют функцию наречий; отвечают на вопросы 'когда', 'где', 'почему', 'как'. Начинаются с подчинительных союзов:
uk: Функціонують як прислівники; відповідають на питання коли, де, чому, як. Починаються з підрядних сполучників:

source: 2. Relative (Adjective) Clauses
ru: 2. Относительные (определительные) придаточные
uk: 2. Відносні (прикметникові) підрядні речення

source: Function as adjectives; describe nouns. Begin with relative pronouns:
ru: Выполняют функцию прилагательных; описывают существительные. Начинаются с относительных местоимений:
uk: Функціонують як прикметники; описують іменники. Починаються з відносних займенників:

source: 3. Noun Clauses
ru: 3. Придаточные предложения (дополнительные/именные)
uk: 3. Іменникові підрядні речення

source: Function as nouns; can be subjects, objects, or complements. Begin with:
ru: Выполняют функцию существительных; могут быть подлежащими, дополнениями или именными частями сказуемого. Начинаются с:
uk: Функціонують як іменники; можуть бути підметами, додатками або доповненнями. Починаються з:

source: Sentence Patterns
ru: Модели предложений
uk: Синтаксичні моделі

source: Common Mistakes
ru: Распространенные ошибки
uk: Поширені помилки

source: Why Use Complex Sentences?
ru: Зачем использовать сложноподчиненные предложения?
uk: Навіщо використовувати складні речення?

source: Show relationships between ideas (cause/effect, time, contrast)
ru: Показать взаимосвязь между идеями (причина/следствие, время, контраст)
uk: Показати зв'язок між ідеями (причина/наслідок, час, контраст)

source: Add variety to your writing style
ru: Добавить разнообразие в стиль письма
uk: Додати різноманітності до вашого стилю письма

source: Express more sophisticated thoughts
ru: Выражать более сложные мысли
uk: Висловлювати більш витончені думки

source: Combine information efficiently
ru: Эффективно объединять информацию
uk: Ефективно поєднувати інформацію

source: Create emphasis by positioning key information
ru: Расставлять акценты, располагая ключевую информацию
uk: Створювати акцент, розташовуючи ключову інформацію

source: Back to Complex Sentences
ru: Обратно к сложноподчиненным предложениям
uk: Повернутися до Складних речень

source: Definition and Structure of Compound Sentences
ru: Определение и структура сложносочиненных предложений
uk: Визначення та структура складносурядних речень

source: Compound Sentences in English
ru: Сложносочиненные предложения в английском языке
uk: Складносурядні речення в англійській мові

source: Key Characteristics
ru: Ключевые характеристики
uk: Ключові характеристики

source: Contains <span class=\
ru: Содержит <span class=\
uk: Містить <span class=\

source: Clauses are joined by <span class=\
ru: Предложения соединены <span class=\
uk: Речення з'єднані <span class=\

source: Expresses related ideas of equal importance
ru: Выражает связанные идеи одинаковой важности
uk: Виражає пов'язані ідеї однакової важливості

source: Each clause could stand alone as a complete sentence
ru: Каждое предложение может существовать как самостоятельное законченное предложение
uk: Кожне речення може існувати як самостійне речення

source: Structure Patterns
ru: Модели структуры
uk: Синтаксичні моделі

source: 1. With Coordinating Conjunctions (FANBOYS)
ru: 1. С сочинительными союзами (FANBOYS)
uk: 1. За допомогою сурядних сполучників (FANBOYS)

source: The seven coordinating conjunctions are:
ru: Семь сочинительных союзов:
uk: Сім сурядних сполучників:

source: Pattern:
ru: Модель:
uk: Модель:

source: 2. With Semicolons
ru: 2. С точкой с запятой
uk: 2. За допомогою крапки з комою

source: 3. With Conjunctive Adverbs
ru: 3. С союзными наречиями
uk: 3. За допомогою сполучних прислівників

source: Common Conjunctive Adverbs:
ru: Распространенные союзные наречия:
uk: Поширені сполучні прислівники:

source: Why Use Compound Sentences?
ru: Зачем использовать сложносочиненные предложения?
uk: Навіщо використовувати складносурядні речення?

source: To show that ideas are related and equally important
ru: Чтобы показать, что идеи связаны и одинаково важны
uk: Щоб показати, що ідеї пов'язані та однаково важливі

source: To create more fluid writing by combining short, choppy sentences
ru: Чтобы создать более плавный текст, объединяя короткие, отрывистые предложения
uk: Щоб створити більш плавне письмо шляхом поєднання коротких, уривчастих речень

source: To express more complex relationships between ideas
ru: Чтобы выразить более сложные взаимосвязи между идеями
uk: Щоб висловити більш складні зв'язки між ідеями

source: To improve the rhythm and flow of your writing
ru: Чтобы улучшить ритм и плавность вашего письма
uk: Щоб покращити ритм і плинність вашого письма

source: Using Coordinating Conjunctions (FANBOYS)
ru: Использование сочинительных союзов (FANBOYS)
uk: Використання сурядних сполучників (FANBOYS)

source: Using Coordinating Conjunctions
ru: Использование сочинительных союзов
uk: Використання сурядних сполучників

source: Coordinating Conjunctions (FANBOYS)
ru: Сочинительные союзы (FANBOYS)
uk: Сурядні сполучники (FANBOYS)

source: Coordinating conjunctions (FANBOYS) are used to connect words, phrases, or independent clauses of equal grammatical importance in a sentence. They are essential for creating <span class=\
ru: Сочинительные союзы (FANBOYS) используются для соединения слов, фраз или независимых предложений равной грамматической важности в предложении. Они необходимы для создания <span class=\
uk: Сурядні сполучники (FANBOYS) використовуються для з'єднання слів, фраз або головних речень рівної граматичної важливості в реченні. Вони є необхідними для створення <span class=\

source: The FANBOYS Acronym
ru: Акроним FANBOYS
uk: Акронім FANBOYS

source: For
ru: For (ибо, потому что)
uk: For (бо, тому що)

source: And
ru: And (и)
uk: And (і, та)

source: Nor
ru: Nor (также не)
uk: Nor (ані, ні)

source: But
ru: But (но)
uk: But (але)

source: Or
ru: Or (или)
uk: Or (або, чи)

source: Yet
ru: Yet (тем не менее, однако)
uk: Yet (проте, однак)

source: So
ru: So (поэтому)
uk: So (тому, отже)

source: Usage Rules
ru: Правила использования
uk: Правила вживання

source: Use a <span class=\
ru: Используйте <span class=\
uk: Використовуйте <span class=\

source: No comma is needed when connecting words or phrases
ru: Запятая не нужна при соединении слов или фраз
uk: Кома не потрібна при з'єднанні слів чи фраз

source: Each conjunction expresses a specific relationship between ideas:
ru: Каждый союз выражает определенную связь между идеями:
uk: Кожен сполучник виражає конкретний зв'язок між ідеями:

source: indicates reason or cause (similar to 'because')
ru: указывает на причину или основание (аналогично 'because')
uk: вказує на причину (подібно до 'because')

source: adds information
ru: добавляет информацию
uk: додає інформацію

source: presents a negative alternative
ru: представляет отрицательную альтернативу
uk: представляє негативну альтернативу

source: shows contrast
ru: показывает контраст
uk: показує контраст

source: presents alternatives
ru: представляет альтернативы
uk: представляє альтернативи

source: shows unexpected contrast
ru: показывает неожиданный контраст
uk: показує несподіваний контраст

source: indicates result or consequence
ru: указывает на результат или следствие
uk: вказує на результат або наслідок

source: Detailed Usage with Examples
ru: Подробное использование с примерами
uk: Детальне вживання з прикладами

source: Indicates reason or cause (similar to 'because'). More formal and less common in spoken English.
ru: Указывает на причину или основание (аналогично 'because'). Более формален и менее распространен в разговорной речи.
uk: Вказує на причину (подібно до 'because'). Більш формальний і менш поширений у розмовній англійській.

source: Adds information or connects similar ideas.
ru: Добавляет информацию или соединяет схожие идеи.
uk: Додає інформацію або поєднує подібні ідеї.

source: Connects two negative alternatives. Note that verb comes before subject after 'nor'.
ru: Соединяет две отрицательные альтернативы. Обратите внимание, что после 'nor' глагол стоит перед подлежащим.
uk: Поєднує дві негативні альтернативи. Зверніть увагу, що дієслово стоїть перед підметом після 'nor'.

source: Shows contrast between two different ideas.
ru: Показывает контраст между двумя разными идеями.
uk: Показує контраст між двома різними ідеями.

source: Presents alternatives or possibilities.
ru: Представляет альтернативы или возможности.
uk: Представляє альтернативи або можливості.

source: Shows unexpected contrast (similar to 'but').
ru: Показывает неожиданный контраст (аналогично 'but').
uk: Показує несподіваний контраст (подібно до 'but').

source: Indicates result or consequence.
ru: Указывает на результат или следствие.
uk: Вказує на результат або наслідок.

source: Practice Tips
ru: Советы для практики
uk: Поради для практики

source: Try rewriting simple sentences using different FANBOYS conjunctions
ru: Попробуйте переписать простые предложения, используя разные союзы FANBOYS
uk: Спробуйте переписати прості речення, використовуючи різні сполучники FANBOYS

source: When proofreading, check for comma splices and add appropriate conjunctions
ru: При корректуре проверяйте на наличие ошибок с запятыми (comma splices) и добавляйте соответствующие союзы
uk: Під час коректури перевіряйте наявність з'єднання комами та додайте відповідні сполучники

source: Vary your conjunctions to express different relationships between ideas
ru: Варьируйте союзы, чтобы выразить различные взаимосвязи между идеями
uk: Урізноманітнюйте свої сполучники, щоб виражати різні зв'язки між ідеями

source: Read aloud to check if the conjunctions create natural-sounding connections
ru: Читайте вслух, чтобы проверить, создают ли союзы естественное звучание связи
uk: Читайте вголос, щоб перевірити, чи створюють сполучники природне звучання зв'язків

source: Mixed Conditionals
ru: Смешанные условные предложения
uk: Змішані умовні речення

source: Mixed Conditionals: Bridging Past and Present
ru: Смешанные условные предложения: Соединяя прошлое и настоящее
uk: Змішані умовні речення: Поєднання минулого та сьогодення

source: Mixed conditionals combine elements of second and third conditionals to express hypothetical situations where the time in the if-clause is different from the time in the main clause.
ru: Смешанные условные предложения сочетают элементы второго и третьего типов условных предложений для выражения гипотетических ситуаций, когда время в придаточном предложении условия (if-clause) отличается от времени в главном предложении.
uk: Змішані умовні речення поєднують елементи другого та третього умовних речень для вираження гіпотетичних ситуацій, коли час у підрядному реченні умови відрізняється від часу в головному реченні.

source: Why Use Mixed Conditionals?
ru: Зачем использовать смешанные условные предложения?
uk: Навіщо використовувати змішані умовні речення?

source: To show how a past action affects the present
ru: Чтобы показать, как прошлое действие влияет на настоящее
uk: Щоб показати, як минула дія впливає на сьогодення

source: To express regret about past decisions and their current consequences
ru: Чтобы выразить сожаление о прошлых решениях и их текущих последствиях
uk: Щоб висловити жаль щодо минулих рішень та їхніх поточних наслідків

source: To imagine how present circumstances would be different if past events had occurred differently
ru: Чтобы представить, как нынешние обстоятельства отличались бы, если бы прошлые события произошли по-другому
uk: Щоб уявити, якими були б нинішні обставини, якби минулі події відбулися інакше

source: To create more nuanced hypothetical situations
ru: Чтобы создавать более тонкие гипотетические ситуации
uk: Щоб створювати більш тонкі гіпотетичні ситуації

source: Type 1: Past Condition → Present Result
ru: Тип 1: Условие в прошлом → Результат в настоящем
uk: Тип 1: Умова в минулому → Результат у теперішньому

source: The most common mixed conditional combines a third conditional if-clause with a second conditional result clause.
ru: Наиболее распространенный смешанный тип условных предложений сочетает придаточное условия третьего типа с главным предложением результата второго типа.
uk: Найпоширеніше змішане умовне речення поєднує умовне речення умови третього типу з реченням результату другого типу.

source: would + base verb
ru: would + инфинитив (base verb)
uk: would + базова форма дієслова

source: Structure Meaning
ru: Значение структуры
uk: Значення структури

source: If something had happened differently in the past, the present situation would be different now.
ru: Если бы что-то произошло по-другому в прошлом, нынешняя ситуация была бы другой сейчас.
uk: Якби щось сталося інакше в минулому, теперішня ситуація була б іншою.

source: formal inversion
ru: формальная инверсия
uk: формальна інверсія

source: Common Uses:
ru: Распространенное использование:
uk: Поширені вживання:

source: Expressing regret about past decisions
ru: Выражение сожаления о прошлых решениях
uk: Вираження жалю щодо минулих рішень

source: Imagining how current life would be different
ru: Представление того, как текущая жизнь отличалась бы
uk: Уявлення того, яким було б нинішнє життя інакше

source: Explaining present consequences of past actions
ru: Объяснение нынешних последствий прошлых действий
uk: Пояснення теперішніх наслідків минулих дій

source: Type 2: Present Condition → Past Result
ru: Тип 2: Условие в настоящем → Результат в прошлом
uk: Тип 2: Умова в теперішньому → Результат у минулому

source: This less common type combines a second conditional if-clause with a third conditional result clause.
ru: Этот менее распространенный тип сочетает придаточное условия второго типа с главным предложением результата третьего типа.
uk: Цей менш поширений тип поєднує умовне речення умови другого типу з реченням результату третього типу.

source: would have + past participle
ru: would have + причастие прошедшего времени (past participle)
uk: would have + дієприкметник минулого часу

source: If the present situation were different, something would have happened differently in the past.
ru: Если бы нынешняя ситуация была другой, что-то произошло бы по-другому в прошлом.
uk: Якби теперішня ситуація була іншою, щось сталося б інакше в минулому.

source: Explaining past outcomes based on current characteristics
ru: Объяснение прошлых результатов на основе нынешних характеристик
uk: Пояснення минулих результатів на основі теперішніх характеристик

source: Connecting permanent traits to specific past events
ru: Связь постоянных характеристик с конкретными событиями в прошлом
uk: Поєднання постійних рис із конкретними минулими подіями

source: Hypothesizing about how past results depended on unchanging factors
ru: Выдвижение гипотез о том, как прошлые результаты зависели от неизменных факторов
uk: Висунення гіпотез про те, як минулі результати залежали від незмінних факторів

source: Comparing Mixed Conditional Types
ru: Сравнение типов смешанных условных предложений
uk: Порівняння типів змішаних умовних речень

source: If-clause
ru: Придаточное условия (If-clause)
uk: Умовна частина (If-clause)

source: Main Clause
ru: Главное предложение
uk: Головна частина

source: Time Relationship
ru: Временная связь
uk: Часовий зв'язок

source: Using Relative Pronouns
uk: Використання відносних займенників

source: Relative Pronouns: Connecting Clauses
uk: Відносні займенники: З'єднання речень

source: Relative pronouns introduce <span class=\
uk: Відносні займенники вводять <span class=\

source: Common Relative Pronouns
uk: Поширені відносні займенники

source: Pronoun
ru: Местоимение
uk: Займенник

source: Subject for people
uk: Підмет для людей
