Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Required in Chicago, APA, MLA styles
ru: Требуется в стилях Chicago, APA, MLA
uk: Обов'язкова в стилях Chicago, APA, MLA

source: Common in journalism (AP style)
ru: Распространено в журналистике (стиль AP)
uk: Поширена в журналістиці (стиль AP)

source: 2. Lists of Phrases and Clauses
ru: 2. Списки фраз и предложений
uk: 2. Списки фраз і речень

source: Commas separate longer list items for clarity:
ru: Запятые разделяют более длинные элементы списка для ясности:
uk: Коми розділяють довші елементи списку для ясності:

source: 3. Complex List Items
ru: 3. Сложные элементы списка
uk: 3. Складні елементи списку

source: When list items contain internal commas, use semicolons as separators:
ru: Когда элементы списка содержат внутренние запятые, используйте точки с запятой в качестве разделителей:
uk: Коли елементи списку містять внутрішні коми, використовуйте крапки з комою як роздільники:

source: When the Oxford Comma is Essential
ru: Когда оксфордская запятая необходима
uk: Коли Оксфордська кома є суттєвою

source: These cases demonstrate why the Oxford comma matters for clarity:
ru: Эти случаи демонстрируют, почему оксфордская запятая важна для ясности:
uk: Ці випадки демонструють, чому Оксфордська кома важлива для ясності:

source: 1. Preventing Ambiguity
ru: 1. Предотвращение двусмысленности
uk: 1. Запобігання двозначності

source: Without the Oxford comma, some lists become confusing:
ru: Без оксфордской запятой некоторые списки становятся запутанными:
uk: Без Оксфордської коми деякі списки стають заплутаними:

source: Ambiguous Without
ru: Двусмысленно Без
uk: Двозначно без

source: Clear With
ru: Ясно С
uk: Зрозуміло з

source: 2. Legal and Technical Writing
ru: 2. Юридические и технические тексты
uk: 2. Юридичне та технічне письмо

source: Precision is crucial in these contexts:
ru: Точность имеет решающее значение в этих контекстах:
uk: Точність є вирішальною в цих контекстах:

source: These situations require special attention with list commas:
ru: Эти ситуации требуют особого внимания при использовании запятых в списках:
uk: Ці ситуації вимагають особливої уваги до ком у списках:

source: 1. Two-Item Lists
ru: 1. Списки из двух элементов
uk: 1. Списки з двох елементів

source: Generally no comma needed for two items joined by 'and' or 'or':
ru: Обычно запятая не требуется для двух элементов, соединенных 'and' или 'or':
uk: Зазвичай кома не потрібна для двох елементів, з'єднаних сполучниками 'and' або 'or':

source: Exception: When the items are long or contain internal commas:
ru: Исключение: Когда элементы длинные или содержат внутренние запятые:
uk: Виняток: Коли елементи довгі або містять внутрішні коми:

source: 2. Lists Ending with 'etc.' or 'and so on'
ru: 2. Списки, заканчивающиеся на 'etc.' или 'and so on'
uk: 2. Списки, що закінчуються на 'etc.' або 'and so on'

source: Place a comma before these terms when they conclude a list:
ru: Ставьте запятую перед этими терминами, когда они завершают список:
uk: Ставте кому перед цими термінами, коли вони завершують список:

source: 3. Vertical Lists
ru: 3. Вертикальные списки
uk: 3. Вертикальні списки

source: In vertical lists, commas are typically replaced by line breaks:
ru: В вертикальных списках запятые обычно заменяются разрывами строк:
uk: У вертикальних списках коми зазвичай замінюються розривами рядків:

source: Required materials:
ru: Необходимые материалы:
uk: Необхідні матеріали:

source: For complete sentences in vertical lists, use proper punctuation:
ru: Для полных предложений в вертикальных списках используйте правильную пунктуацию:
uk: Для повних речень у вертикальних списках використовуйте правильну пунктуацію:

source: Project goals:
ru: Цели проекта:
uk: Цілі проєкту:

source: Be mindful of these frequent mistakes with list commas:
ru: Помните об этих частых ошибках с запятыми в списках:
uk: Зверніть увагу на ці часті помилки з комами в списках:

source: Use Oxford comma for clarity in formal writing
ru: Используйте оксфордскую запятую для ясности в формальном письме
uk: Використовуйте Оксфордську кому для ясності у формальному письмі

source: No comma after conjunction
ru: Нет запятой после союза
uk: Без коми після сполучника

source: Use semicolons when items contain commas
ru: Используйте точки с запятой, когда элементы содержат запятые
uk: Використовуйте крапку з комою, коли елементи містять коми

source: Comma - Non-Essential Information
ru: Запятая - Несущественная информация
uk: Кома - Несуттєва інформація

source: Comma: Non-Essential Information
ru: Запятая: Несущественная информация
uk: Кома: Несуттєва інформація

source: Commas for Non-Essential Information
ru: Запятые для несущественной информации
uk: Коми для несуттєвої інформації

source: Commas play a crucial role in setting off information that adds extra details to a sentence but isn't necessary for its core meaning. This is called <span class="
uk: Коми відіграють вирішальну роль у виділенні інформації, яка додає додаткові деталі до речення, але не є необхідною для його основного значення. Це називається <span class="

source: Core Concept
ru: Основная концепция
uk: Основна концепція

source: Non-essential elements can be removed without changing the fundamental meaning of the sentence. These are always set off with commas.
ru: Несущественные элементы могут быть удалены без изменения основного смысла предложения. Они всегда выделяются запятыми.
uk: Несуттєві елементи можна вилучити, не змінюючи фундаментального значення речення. Вони завжди виділяються комами.

source: The information is <span class="
uk: Інформація є <span class="

source: The clause often begins with <span class="
uk: Речення часто починається з <span class="

source: The sentence would remain grammatically correct without it
ru: Предложение останется грамматически правильным без него
uk: Речення залишиться граматично правильним без цього

source: Types of Non-Essential Elements
ru: Типы несущественных элементов
uk: Типи несуттєвих елементів

source: Non-Restrictive Relative Clauses
ru: Неограничительные относительные придаточные предложения
uk: Необмежувальні відносні речення

source: These clauses provide extra information about a noun that's already clearly identified.
ru: Эти придаточные предложения предоставляют дополнительную информацию о существительном, которое уже четко идентифицировано.
uk: Ці речення надають додаткову інформацію про іменник, який вже чітко ідентифікований.

source: Example:
ru: Пример:
uk: Приклад:

source: (We know which car - the additional information about its location isn't necessary to identify it)
ru: (Мы знаем, какая машина – дополнительная информация о её местоположении не нужна для её идентификации)
uk: (Ми знаємо, яка машина - додаткова інформація про її місцезнаходження не є необхідною для її ідентифікації)

source: Appositives
ru: Приложения
uk: Прикладки

source: Noun phrases that rename or explain another noun right beside it.
ru: Именные фразы, которые переименовывают или объясняют другое существительное, стоящее рядом с ним.
uk: Іменникові фрази, які перейменовують або пояснюють інший іменник, що стоїть поруч.

source: Parenthetical Expressions
ru: Вводные выражения
uk: Вставні вирази

source: Words or phrases that interrupt the flow of a sentence.
ru: Слова или фразы, которые прерывают поток предложения.
uk: Слова або фрази, які переривають плин речення.

source: Essential vs. Non-Essential Comparison
ru: Сравнение: Существенный против Несущественного
uk: Порівняння суттєвого та несуттєвого

source: Non-Essential
ru: Несущественный
uk: Несуттєве

source: Essential
ru: Существенный
uk: Суттєве

source: Commas
ru: Запятые
uk: Коми

source: Required
ru: Требуются
uk: Обов'язкові

source: Not used
ru: Не используются
uk: Не використовуються

source: Can be removed without changing core meaning
ru: Могут быть удалены без изменения основного смысла
uk: Може бути видалена без зміни основного значення

source: Cannot be removed - changes meaning
ru: Не могут быть удалены — меняют смысл
uk: Не може бути видалена - змінює значення

source: Relative Pronouns
ru: Относительные местоимения
uk: Відносні займенники

source: Identify whether these sentences need commas for non-essential information:
ru: Определите, нужны ли в этих предложениях запятые для выделения несущественной информации:
uk: Визначте, чи потрібні в цих реченнях коми для виділення несуттєвої інформації:

source: Dash - Emphasis and Interruption
ru: Тире - Выделение и Прерывание
uk: Тире - Наголос та Переривання

source: Dash: Emphasis and Interruption
ru: Тире: Выделение и Прерывание
uk: Тире: Наголос та Переривання

source: The Dash: Usage and Rules
ru: Тире: Использование и Правила
uk: Тире: Використання та Правила

source: 1. Primary Uses of the Em Dash
ru: 1. Основные области применения длинного тире (Em Dash)
uk: 1. Основні використання довгого тире (em dash)

source: A. Emphasis and Dramatic Pause
ru: A. Выделение и Драматическая Пауза
uk: A. Наголос та Драматична Пауза

source: Dashes create stronger breaks than commas, adding dramatic emphasis to the enclosed text.
ru: Тире создают более сильные разрывы, чем запятые, добавляя драматическое выделение к заключенному тексту.
uk: Тире створює сильніші розриви, ніж коми, додаючи драматичного наголосу до тексту в дужках.

source: B. Interruptions and Abrupt Changes
ru: B. Прерывания и Резкие Изменения
uk: B. Переривання та Раптові Зміни

source: Dashes can indicate an interruption in thought or speech.
ru: Тире могут указывать на прерывание мысли или речи.
uk: Тире може вказувати на переривання думки або мовлення.

source: 2. Parenthetical and Additional Information
ru: 2. Вводная и Дополнительная Информация
uk: 2. Вставна та Додаткова Інформація

source: A. Parenthetical Statements
ru: A. Вводные высказывания
uk: A. Вставні Висловлювання

source: Dashes can set off parenthetical information with more emphasis than commas or parentheses.
ru: Тире могут выделять вводную информацию с бо́льшим акцентом, чем запятые или скобки.
uk: Тире може виділяти вставну інформацію з більшим наголосом, ніж коми або круглі дужки.

source: B. Appositives with Extra Emphasis
ru: B. Приложения с дополнительным выделением
uk: B. Прикладки з Додатковим Наголосом

source: Dashes highlight appositives (renaming phrases) more dramatically than commas.
ru: Тире выделяют приложения (переименовывающие фразы) более драматично, чем запятые.
uk: Тире виділяє прикладки (фрази, що перейменовують) більш драматично, ніж коми.

source: Dash vs. Other Punctuation
ru: Тире против другой пунктуации
uk: Тире порівняно з Іншими Знаками Пунктуації

source: Standard separation
ru: Стандартное разделение
uk: Стандартне розділення

source: Parentheses
ru: Скобки
uk: Круглі дужки

source: Subdued, supplementary info
ru: Сдержанная, дополнительная информация
uk: Приглушена, додаткова інформація

source: Dramatic, emphasized info
ru: Драматическая, выделенная информация
uk: Драматична, наголошена інформація

source: 3. Special Cases and Rules
ru: 3. Особые случаи и правила
uk: 3. Особливі Випадки та Правила

source: A. En Dash Usage
ru: A. Использование короткого тире (En Dash)
uk: A. Використання середнього тире (en dash)

source: The shorter en dash (–) has specific uses:
ru: Более короткое короткое тире (–) имеет специфические области применения:
uk: Коротше середнє тире (–) має специфічні використання:

source: Number ranges:
ru: Диапазоны чисел:
uk: Діапазони чисел:

source: Connections between words:
ru: Связи между словами:
uk: Зв'язки між словами:

source: Scores and conflicts:
ru: Счета и конфликты:
uk: Рахунки та конфлікти:

source: B. Spacing Rules
ru: B. Правила расстановки пробелов
uk: B. Правила Інтервалу

source: Style guides differ on spacing around dashes:
ru: Справочники по стилю различаются в правилах расстановки пробелов вокруг тире:
uk: Стильові посібники різняться щодо інтервалів навколо тире:

source: AP Style:
ru: Стиль AP:
uk: Стиль AP:

source: space before and after em dash
ru: пробел до и после длинного тире
uk: пробіл до та після довгого тире

source: Chicago Manual:
ru: Справочник Chicago:
uk: Посібник Чикаго:

source: no spaces around em dash
ru: нет пробелов вокруг длинного тире
uk: без пробілів навколо довгого тире

source: En dashes:
ru: Короткие тире:
uk: Середні тире:

source: typically have spaces around them
ru: обычно имеют пробелы вокруг них
uk: зазвичай мають пробіли навколо них

source: Exclamation Mark - Commands and Exclamations
ru: Восклицательный знак - Приказы и Восклицания
uk: Знак Оклику - Команди та Вигуки

source: Exclamation Mark: Commands
ru: Восклицательный знак: Приказы
uk: Знак Оклику: Команди

source: Commands and Exclamations in English
ru: Приказы и восклицания в английском языке
uk: Команди та Вигуки в Англійській Мові

source: Forceful Commands
ru: Энергичные приказы
uk: Рішучі Команди

source: Exclamation marks give commands a sense of urgency or importance:
ru: Восклицательные знаки придают приказам ощущение срочности или важности:
uk: Знаки оклику надають командам відчуття терміновості чи важливості:

source: Often begin with a verb (imperative form)
ru: Часто начинаются с глагола (повелительная форма)
uk: Часто починаються з дієслова (наказової форми)

source: Typically short and direct
ru: Обычно короткие и прямые
uk: Зазвичай короткі та прямі

source: May omit the subject (implied 'you')
ru: Могут опускать подлежащее (подразумеваемое 'ты'/'вы')
uk: Можуть опускати підмет (мається на увазі 'ти/ви')

source: Types of Exclamatory Sentences
ru: Типы восклицательных предложений
uk: Типи Окличних Речень

source: What/How Exclamations
ru: Восклицания с 'What'/'How'
uk: Вигуки з 'What/How'

source: Begin with 'what' or 'how' to express strong emotion:
ru: Начинаются с 'what' или 'how' для выражения сильной эмоции:
uk: Починаються з 'what' або 'how' для вираження сильної емоції:

source: Standalone words expressing sudden emotion:
ru: Отдельные слова, выражающие внезапную эмоцию:
uk: Окремі слова, що виражають раптову емоцію:

source: Emphatic Declaratives
ru: Эмфатические повествовательные предложения
uk: Емфатичні Розповідні Речення

source: Regular statements with added emotional weight:
ru: Обычные утверждения с добавленным эмоциональным весом:
uk: Звичайні висловлювання з доданою емоційною вагою:

source: Usage Guidelines
ru: Рекомендации по использованию
uk: Настанови щодо Використання

source: With Exclamation
ru: С восклицательным знаком
uk: З Окликом

source: Without Exclamation
ru: Без восклицательного знака
uk: Без Оклику

source: Warnings
ru: Предупреждения
uk: Попередження

source: Instructions
ru: Инструкции
uk: Інструкції

source: Emotional Speech
ru: Эмоциональная речь
uk: Емоційна Промова

source: Rhetorical Questions
ru: Риторические вопросы
uk: Риторичні Питання

source: Add exclamation marks where appropriate and identify the type:
ru: Добавьте восклицательные знаки, где это уместно, и определите тип:
uk: Додайте знаки оклику, де це доречно, і визначте тип:

source: Exclamation Mark - Strong Emotion
ru: Восклицательный знак - Сильная эмоция
uk: Знак Оклику - Сильна Емоція

source: Exclamation Mark: Strong Emotion
ru: Восклицательный знак: Сильная эмоция
uk: Знак Оклику: Сильна Емоція

source: The Exclamation Mark in English
ru: Восклицательный знак в английском языке
uk: Знак Оклику в Англійській Мові

source: Exclamation marks serve several key purposes in English:
ru: Восклицательные знаки служат нескольким ключевым целям в английском языке:
uk: Знаки оклику виконують кілька ключових функцій в англійській мові:

source: Strong emotion:
ru: Сильная эмоция:
uk: Сильна емоція:

source: Commands:
ru: Приказы:
uk: Команди:

source: Interjections:
ru: Междометия:
uk: Вигуки:

source: That's incredible
ru: Это невероятно
uk: Це неймовірно

source: Types of Exclamations
ru: Типы восклицаний
uk: Типи Вигуків

source: Emotional Statements
ru: Эмоциональные утверждения
uk: Емоційні Висловлювання

source: Express strong feelings like joy, anger, or surprise:
ru: Выражают сильные чувства, такие как радость, гнев или удивление:
uk: Виражають сильні почуття, такі як радість, гнів чи здивування:

source: Imperatives with Force
ru: Императивы с силой
uk: Наказові Речення з Силою

source: Strong commands or warnings:
ru: Сильные приказы или предупреждения:
uk: Сильні команди чи попередження:

source: Exclamatory Sentences
ru: Восклицательные предложения
uk: Окличні Речення

source: Sentences beginning with 'What' or 'How':
ru: Предложения, начинающиеся с 'What' или 'How':
uk: Речення, що починаються з 'What' або 'How':

source: Appropriate Use
ru: Подходящее использование
uk: Належне Використання

source: Inappropriate Use
ru: Неподходящее использование
uk: Неналежне Використання

source: Fiction/Dialogue
ru: Художественная литература/Диалог
uk: Художня Література/Діалог

source: Multiple Marks
ru: Множественные знаки
uk: Кілька Знаків

source: Combined Marks
ru: Комбинированные знаки
uk: Комбіновані Знаки

source: Add exclamation marks where appropriate:
ru: Добавьте восклицательные знаки, где это уместно:
uk: Додайте знаки оклику, де це доречно:

source: Full Stop (Period) - Abbreviations
ru: Точка (Full Stop/Period) - Сокращения
uk: Крапка - Скорочення

source: Full Stop: Abbreviations
ru: Точка: Сокращения
uk: Крапка: Скорочення

source: Full Stop (Period) in Abbreviations and Acronyms
ru: Точка (Period) в сокращениях и акронимах
uk: Крапка у Скороченнях та Акронімах

source: The use of full stops in abbreviations varies significantly between style guides and English variants, with American English generally using more periods in abbreviations than British English.
ru: Использование точек в сокращениях значительно варьируется между справочниками по стилю и вариантами английского языка; в американском английском, как правило, используется больше точек в сокращениях, чем в британском английском.
uk: Використання крапок у скороченнях значно різниться між стильовими посібниками та варіантами англійської мови, при цьому американська англійська зазвичай використовує більше крапок у скороченнях, ніж британська англійська.

source: General Rules for Abbreviations
ru: Общие правила для сокращений
uk: Загальні Правила для Скорочень

source: Full stops are used differently depending on the type of abbreviation and English variant:
ru: Точки используются по-разному в зависимости от типа сокращения и варианта английского языка:
uk: Крапки використовуються по-різному залежно від типу скорочення та варіанту англійської мови:

source: 1. Initialisms vs. Acronyms
ru: 1. Инициализмы против Акронимов
uk: 1. Ініціалізм порівняно з Акронімом

source: Initialisms (pronounced as individual letters) and acronyms (pronounced as words) have different conventions:
ru: Инициализмы (произносимые по отдельным буквам) и акронимы (произносимые как слова) имеют разные условности:
uk: Ініціалізми (вимовляються як окремі літери) та акроніми (вимовляються як слова) мають різні конвенції:

source: Periods after each letter
ru: Точки после каждой буквы
uk: Крапки після кожної літери

source: No periods
ru: Без точек
uk: Без крапок

source: No periods in any variant
ru: Нет точек ни в одном из вариантов
uk: Без крапок у будь-якому варіанті

source: 2. Latin Abbreviations
ru: 2. Латинские сокращения
uk: 2. Латинські Скорочення

source: Common Latin abbreviations typically use periods in all English variants:
ru: Распространенные латинские сокращения обычно используют точки во всех вариантах английского языка:
uk: Поширені латинські скорочення зазвичай використовують крапки в усіх варіантах англійської мови:

source: 3. Titles and Measurements
ru: 3. Звания и Измерения
uk: 3. Звання та Вимірювання

source: Usage varies between American and British English:
ru: Использование варьируется между американским и британским английским:
uk: Використання різниться між американською та британською англійською:

source: American
ru: Американский
uk: Американська

source: British
ru: Британский
uk: Британська

source: Modern Trends and Style Guides
ru: Современные тенденции и справочники по стилю
uk: Сучасні Тенденції та Стильові Посібники

source: Contemporary usage shows these patterns in different contexts:
ru: Современное использование демонстрирует следующие закономерности в различных контекстах:
uk: Сучасне використання демонструє такі закономірності в різних контекстах:

source: 1. Digital Communication
ru: 1. Цифровое общение
uk: 1. Цифрове Спілкування

source: Periods are increasingly omitted in informal digital communication:
ru: Точки всё чаще опускаются в неформальном цифровом общении:
uk: Крапки все частіше опускаються в неформальному цифровому спілкуванні:

source: 2. Academic and Formal Writing
ru: 2. Академическое и Формальное письмо
uk: 2. Академічне та Офіційне Письмо

source: Style guides differ in their recommendations:
ru: Справочники по стилю различаются в своих рекомендациях:
uk: Стильові посібники різняться у своїх рекомендаціях:

source: Approach
ru: Подход
uk: Підхід

source: Minimal periods
ru: Минимальное количество точек
uk: Мінімум крапок

source: Traditional periods
ru: Традиционные точки
uk: Традиційні крапки

source: No periods in acronyms
ru: Нет точек в акронимах
uk: Без крапок в акронімах

source: These situations require special attention:
ru: Эти ситуации требуют особого внимания:
uk: Ці ситуації вимагають особливої уваги:

source: 1. Abbreviations at Sentence End
ru: 1. Сокращения в конце предложения
uk: 1. Скорочення в Кінці Речення

source: When an abbreviation ends a sentence, use only one period:
ru: Когда сокращение завершает предложение, используйте только одну точку:
uk: Коли скорочення закінчує речення, використовуйте лише одну крапку:

source: 2. Plural Abbreviations
ru: 2. Множественное число сокращений
uk: 2. Множина Скорочень

source: Form plurals of abbreviations without apostrophes:
ru: Образуйте множественное число сокращений без апострофов:
uk: Утворюйте множину скорочень без апострофів:

source: 3. Measurements and Symbols
ru: 3. Измерения и Символы
uk: 3. Вимірювання та Символи

source: Units of measurement typically don't use periods:
ru: Единицы измерения, как правило, не используют точки:
uk: Одиниці вимірювання зазвичай не використовують крапки:

source: Be mindful of these frequent mistakes:
ru: Помните об этих частых ошибках:
uk: Зверніть увагу на ці поширені помилки:

source: Be consistent - either all periods or none
ru: Будьте последовательны - либо все точки, либо ни одной
uk: Будьте послідовними - або всі крапки, або жодної

source: The comma follows the period in 'etc.'
ru: Запятая ставится после точки в 'etc.'
uk: Кома йде після крапки в 'etc.'

source: Don't omit the final period in academic titles
ru: Не опускайте последнюю точку в академических званиях
uk: Не опускайте останню крапку в академічних званнях

source: Full Stop (Period) - Declarative Sentences
ru: Точка (Full Stop/Period) - Повествовательные предложения
uk: Крапка - Розповідні Речення

source: Full Stop: Declarative Sentences
ru: Точка: Повествовательные предложения
uk: Крапка: Розповідні Речення

source: The Full Stop (Period) in Declarative Sentences
ru: Точка (Period) в повествовательных предложениях
uk: Крапка в Розповідних Реченнях
