Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Prevent/protect from: The fence prevents trespassers from entering.
ru: Prevent/protect from: The fence prevents trespassers from entering (Забор не дает злоумышленникам проникнуть).

source: Different from: My view is different from yours.
ru: Different from: My view is different from yours (Мое мнение отличается от твоего).

source: Creator vs. Purpose: The essay was written by the student. The essay was written for the contest.
ru: Создатель против цели: The essay was written by the student (Эссе было написано студентом). The essay was written for the contest (Эссе было написано для конкурса).

source: Duration vs. Deadline: I will study for three hours. I will finish by three o'clock.
ru: Продолжительность против крайнего срока: I will study for three hours (Я буду учиться три часа). I will finish by three o'clock (Я закончу к трем часам).

source: Origin vs. Purpose: I got this letter from her. I got this gift for her.
ru: Происхождение против цели: I got this letter from her (Я получил это письмо от нее). I got this gift for her (Я получил этот подарок для нее).

source: Fill in the blanks with the correct preposition.
ru: Заполните пропуски правильным предлогом.

source: With 'That': This is the project that I worked on.
ru: С 'That': This is the project that I worked on (Это проект, над которым я работал).

source: With 'Which/Whom': The city which I travel to most is Paris.
ru: С 'Which/Whom': The city which I travel to most is Paris (Город, в который я езжу чаще всего, это Париж).

source: Phrasal verbs in passive always strand: The situation was looked into.
ru: Фразовые глаголы в пассиве всегда располагаются в конце: The situation was looked into (Ситуация была изучена).

source: Some formal alternatives exist but sound unnatural: Into what was the situation looked?
ru: Существуют некоторые формальные альтернативы, но они звучат неестественно: Into what was the situation looked? (Во что была изучена ситуация?)

source: Fronting the preposition creates awkward constructions: We need a box in which to put the toys. (Awkward)
ru: Вынос предлога вперед создает неловкие конструкции: We need a box in which to put the toys. (Неловко)

source: Single-word prepositions that show basic relationships: at, on, in, by, for, from, of, with
ru: Предлоги из одного слова, которые показывают базовые отношения: at, on, in, by, for, from, of, with

source: Examples in Context: The keys are on the table.
ru: Примеры в контексте: The keys are on the table (Ключи на столе).

source: Formed by prefixing a preposition to another word: above, along, among, before, behind, beneath
ru: Образуются путем добавления префикса к другому слову: above, along, among, before, behind, beneath (над, вдоль, среди, до, позади, под)

source: Multi-word phrases that function as single prepositions: in addition to, due to, on account of, prior to
ru: Фразы из нескольких слов, которые функционируют как единые предлоги: in addition to (в дополнение к), due to (из-за), on account of (по причине), prior to (до)

source: Common Prepositions: Time, Place, Direction, Manner, Cause
ru: Общие предлоги: Время, место, направление, образ действия, причина

source: Agent/Instrument: The house was designed by an architect. He wrote with a pen.
ru: Действующее лицо/Инструмент: The house was designed by an architect (Дом был спроектирован архитектором). He wrote with a pen (Он писал ручкой).

source: While traditionally discouraged, ending sentences with prepositions is common and often necessary in natural English: What are you talking about?
ru: Хотя традиционно это не поощряется, окончание предложений предлогами является обычным и часто необходимым в естественном английском: What are you talking about? (О чем ты говоришь?)

source: Confusing Similar Prepositions: In vs. At
ru: Путаница похожих предлогов: In vs. At

source: In: suggests being inside boundaries
ru: In: предполагает нахождение внутри границ

source: At: suggests a specific point
ru: At: предполагает конкретную точку

source: On: for specific days/dates
ru: On: для конкретных дней/дат

source: At: for clock times
ru: At: для времени по часам

source: Structural Examples: Under the **big** table.
ru: Структурные примеры: Under the **big** table (Под **большим** столом).

source: Answer the question 'Which one?'
ru: Отвечают на вопрос 'Какой?'

source: Required by the verb: They depend on the funding.
ru: Требуется глаголом: They depend on the funding (Они зависят от финансирования).

source: Optional information: They walked on the path.
ru: Необязательная информация: They walked on the path (Они шли по тропинке).

source: Verbal Complements: She listened to the music.
ru: Глагольные дополнения: She listened to the music (Она слушала музыку).

source: Passive Constructions: The issue was dealt with.
ru: Пассивные конструкции: The issue was dealt with (Проблема была решена).

source: Comparative Structures: He is good at math.
ru: Сравнительные структуры: He is good at math (Он хорош в математике).

source: Core Meanings and Uses: The prepositions 'Of' is crucial for showing relationships of belonging, composition, and reference.
ru: Основные значения и использования: Предлог 'Of' имеет решающее значение для демонстрации отношений принадлежности, состава и ссылки.

source: Possession: The capital of France is Paris.
ru: Владение: The capital of France is Paris (Столица Франции — Париж).

source: Composition: A glass of water.
ru: Состав: A glass of water (Стакан воды).

source: Reference: The problem of inflation.
ru: Ссылка: The problem of inflation (Проблема инфляции).

source: Part of a group: One of my friends lives here.
ru: Часть группы: One of my friends lives here (Один из моих друзей живет здесь).

source: For specific times: At the time of the explosion.
ru: Для конкретного времени: At the time of the explosion (Во время взрыва).

source: To show qualities: A man of great intelligence.
ru: Для показа качеств: A man of great intelligence (Человек большого ума).

source: From a specific past time until now: I have worked here since 2018.
ru: С определенного прошлого момента до настоящего времени: I have worked here since 2018 (Я работаю здесь с 2018 года).

source: Reason/cause: Since it's raining, we should stay inside.
ru: Причина/повод: Since it's raining, we should stay inside (Поскольку идет дождь, нам следует остаться внутри).

source: Continuation: He has been learning French since last year.
ru: Продолжение: He has been learning French since last year (Он изучает французский с прошлого года).

source: Movement toward a place: We went to the market.
ru: Движение к месту: We went to the market (Мы пошли на рынок).

source: Recipient: Give the letter to him.
ru: Получатель: Give the letter to him (Отдай письмо ему).

source: Time limit: The sale runs to Friday.
ru: Ограничение по времени: The sale runs to Friday (Распродажа продлится до пятницы).

source: Ratio/comparison: The ratio of debt to assets.
ru: Соотношение/сравнение: The ratio of debt to assets (Соотношение долга к активам).

source: Many verbs require this preposition: listen to, speak to, refer to
ru: Многие глаголы требуют этот предлог: listen to (слушать), speak to (говорить), refer to (ссылаться)

source: Common with feelings and reactions: kind to, friendly to
ru: Распространен с чувствами и реакциями: kind to (добр к), friendly to (дружелюбен к)

source: Direction vs. location: go to the store (direction) vs. be at the store (location)
ru: Направление против местоположения: go to the store (направление) vs. be at the store (местоположение)

source: Key Applications: The preposition 'With' indicates relationships of togetherness, instrumentality, and possession.
ru: Ключевые применения: Предлог 'With' указывает на отношения совместности, инструментальности и обладания.

source: Accompaniment: I went to the cinema with him.
ru: Сопровождение: I went to the cinema with him (Я пошел в кино с ним).

source: Instrument: He cut the wood with a saw.
ru: Инструмент: He cut the wood with a saw (Он распилил дерево пилой).

source: Manner: She spoke with enthusiasm.
ru: Образ действия: She spoke with enthusiasm (Она говорила с энтузиазмом).

source: Possession: A man with a long beard.
ru: Обладание: A man with a long beard (Человек с длинной бородой).

source: Describing feelings: sick with worry, mad with anger
ru: Описывает чувства: sick with worry (болен от беспокойства), mad with anger (безумен от гнева)

source: Suffering from: dealing with poverty, struggling with depression
ru: Страдание от: dealing with poverty (справляться с бедностью), struggling with depression (бороться с депрессией)

source: In agreement: agree with, comply with
ru: В согласии: agree with (соглашаться с), comply with (соблюдать)

source: 'Of' vs. 'From': The chair is made of wood (material). I received a gift from her (source).
ru: 'Of' против 'From': The chair is made of wood (стул сделан из дерева - материал). I received a gift from her (Я получил от нее подарок - источник).

source: 'Since' vs. 'For': I've been waiting since 2 p.m. (starting point). I've been waiting for two hours (duration).
ru: 'Since' против 'For': I've been waiting since 2 p.m. (Я жду с 14:00 - начальная точка). I've been waiting for two hours (Я жду два часа - продолжительность).

source: 'To' vs. 'With': We walked to the office (movement). We walked with our friends (accompaniment).
ru: 'To' против 'With': We walked to the office (Мы шли в офис - движение). We walked with our friends (Мы гуляли с друзьями - сопровождение).

source: Answer the questions 'Which one?' or 'What kind?'
ru: Отвечают на вопросы 'Какой?' или 'Какого рода?'

source: Answer questions like 'Where?', 'When?', 'How?', or 'Why?'
ru: Отвечают на вопросы типа 'Где?', 'Когда?', 'Как?' или 'Почему?'

source: Sentences often contain multiple prepositional phrases that work together: The book [on the table] [with the red cover] belongs to me.
ru: Предложения часто содержат множественные предложные фразы, которые работают вместе: The book [on the table] [with the red cover] belongs to me (Книга [на столе] [с красной обложкой] принадлежит мне).

source: Stranded Prepositions: While acceptable in speech, avoid in formal writing
ru: Концевое расположение предлога: Хотя приемлемо в речи, избегайте в формальном письме

source: Misplaced Modifiers: Keep adjective phrases close to the nouns they modify
ru: Неправильно расположенные определения: Держите фразы-прилагательные близко к существительным, которые они определяют

source: Core Time Prepositions: At, On, In, For, Since
ru: Основные предлоги времени: At, On, In, For, Since

source: At: for precise times (at 3pm)
ru: At: для точного времени (в 15:00)

source: On: for days/dates (on Monday)
ru: On: для дней/дат (в понедельник)

source: In: for months/years/seasons (in summer)
ru: In: для месяцев/лет/времен года (летом)

source: For: duration (for two hours)
ru: For: продолжительность (в течение двух часов)

source: Since: from past to present (since 2010)
ru: Since: с прошлого до настоящего (с 2010 года)

source: Nuanced Time Relationships: Before, After, During, Until
ru: Нюансированные временные отношения: Before (до), After (после), During (во время), Until (до)

source: Earlier than: Before the meeting, I drank coffee.
ru: Раньше, чем: Before the meeting, I drank coffee (До встречи я выпил кофе).

source: Later than: After the rain, the sun came out.
ru: Позже, чем: After the rain, the sun came out (После дождя выглянуло солнце).

source: Throughout: During the speech, he took notes.
ru: На протяжении: During the speech, he took notes (Во время речи он делал заметки).

source: Basic Spatial Concepts: In, On, At, Under, Between
ru: Основные пространственные концепции: In, On, At, Under, Between

source: In: enclosed space (in the room)
ru: In: замкнутое пространство (в комнате)

source: On: surface contact (on the wall)
ru: On: контакт с поверхностью (на стене)

source: At: specific point (at the door)
ru: At: конкретная точка (у двери)

source: Under: below something (under the table)
ru: Under: под чем-то (под столом)

source: Between: in the middle of two (between the houses)
ru: Between: посреди двух (между домами)

source: Advanced Spatial Concepts: Over, Among, Near
ru: Расширенные пространственные концепции: Over (над), Among (среди), Near (рядом)

source: Over: suggests being covered (a blanket over the child)
ru: Over: предполагает быть покрытым (одеяло над ребенком)

source: Among: implies being surrounded (among the trees)
ru: Among: подразумевает окружение (среди деревьев)

source: Near: indicates close proximity (near the school)
ru: Near: указывает на непосредственную близость (рядом со школой)

source: Direct Cause: from illness, due to weather
ru: Прямая причина: from illness (от болезни), due to weather (из-за погоды)

source: Reason/Purpose: for food, on account of a debt
ru: Причина/Цель: for food (для еды), on account of a debt (из-за долга)

source: Agent in Passive: written by an author
ru: Действующее лицо в пассиве: written by an author (написано автором)

source: Nuanced Causal Prepositions: Due to, Owing to, Because of
ru: Нюансированные причинные предлоги: Due to, Owing to, Because of

source: Due to: formal cause (The delay was due to weather)
ru: Due to: формальная причина (The delay was due to weather - Задержка произошла из-за погоды)

source: Owing to: similar to 'due to' but less common (Owing to the snow, the flight was delayed)
ru: Owing to: похоже на 'due to', но менее распространено (Owing to the snow, the flight was delayed - Из-за снега рейс был задержан)

source: Thanks to: often positive (We succeeded thanks to teamwork)
ru: Thanks to: часто положительное (We succeeded thanks to teamwork - Мы добились успеха благодаря командной работе)

source: With: using instrument (Write with a pen)
ru: With: с использованием инструмента (Write with a pen - Писать ручкой)

source: By: means/method (Travel by train)
ru: By: средство/метод (Travel by train - Путешествовать на поезде)

source: In: style/manner (Speak in whispers)
ru: In: стиль/манера (Speak in whispers - Говорить шепотом)

source: Like: similarity (Act like a professional)
ru: Like: сходство (Act like a professional - Вести себя как профессионал)

source: Special Manner Expressions: in private, with ease, by hand
ru: Особые выражения образа действия: in private (наедине), with ease (с легкостью), by hand (вручную)

source: Core Examples: in, on, at, by, for, from, of, with
ru: Основные примеры: in, on, at, by, for, from, of, with (в, на, у/в, к, для, от, из, с)

source: Most versatile and frequently used preposition type
ru: Самый универсальный и часто используемый тип предлогов

source: Contextual Examples: The keys are **on** the shelf. She looked **at** the map.
ru: Примеры в контексте: The keys are **on** the shelf (Ключи **на** полке). She looked **at** the map (Она посмотрела **на** карту).

source: Formation Patterns: above, below, behind, inside, outside, within
ru: Модели образования: above (над), below (под), behind (позади), inside (внутри), outside (снаружи), within (в пределах)

source: Usage Examples: The ball is **inside** the box. He was hiding **behind** the curtain.
ru: Примеры использования: The ball is **inside** the box (Мяч **внутри** коробки). He was hiding **behind** the curtain (Он прятался **за** занавеской).

source: Common Structures: in front of, due to, on account of, according to, by means of
ru: Общие структуры: in front of (перед), due to (из-за), on account of (по причине), according to (согласно), by means of (посредством)

source: Practical Examples: We stopped **due to** the heavy fog. **According to** the report, sales rose.
ru: Практические примеры: We stopped **due to** the heavy fog (Мы остановились **из-за** сильного тумана). **According to** the report, sales rose (Согласно отчету, продажи выросли).

source: Type: Simple, Compound, Phrasal
ru: Тип: Простой, Составной, Фразовый

source: Simple: Single morpheme
ru: Простой: Одна морфема

source: Compound: Prefix + root
ru: Составной: Префикс + корень

source: Phrasal: Multiple words
ru: Фразовый: Несколько слов

source: Flexibility: High (many uses), Medium, Low (fixed phrases)
ru: Гибкость: Высокая (много применений), Средняя, Низкая (фиксированные фразы)

source: Simple: Often multiple meanings
ru: Простой: Часто множественные значения

source: Compound: More specific
ru: Составной: Более специфичен

source: Phrasal: Very specific
ru: Фразовый: Очень специфичен

source: Simple Prepositions: For basic, everyday relationships, When multiple interpretations are possible, In idiomatic expressions
ru: Простые предлоги: Для базовых, повседневных отношений, Когда возможны множественные толкования, В идиоматических выражениях

source: Compound Prepositions: When precise spatial relationships are needed, With specific verbs they commonly pair with, To avoid ambiguity of simple prepositions
ru: Составные предлоги: Когда необходимы точные пространственные отношения, С конкретными глаголами, с которыми они обычно сочетаются, Для избежания двусмысленности простых предлогов

source: Phrasal Prepositions: For formal or academic writing, When expressing complex relationships, In set phrases and formal expressions
ru: Фразовые предлоги: Для формального или академического письма, При выражении сложных отношений, В устойчивых выражениях и формальных оборотах

source: Core Examples: She put the keys **in** the drawer. The team worked **until** midnight.
ru: Основные примеры: She put the keys **in** the drawer (Она положила ключи **в** ящик). The team worked **until** midnight (Команда работала **до** полуночи).

source: Formal Examples: This is the subject **about** which we spoke. **To** whom was the letter addressed?
ru: Формальные примеры: This is the subject **about** which we spoke (Это предмет, **о** котором мы говорили). **To** whom was the letter addressed? (**Кому** было адресовано письмо?)

source: In casual speech and writing, prepositions sometimes appear at the end of clauses: This is the subject we spoke **about**. Who was the letter addressed **to**?
ru: В непринужденной речи и письме предлоги иногда появляются в конце предложений: This is the subject we spoke **about** (Это предмет, о котором мы говорили). Who was the letter addressed **to**? (Кому было адресовано письмо?)

source: Formal: The person **with whom** I spoke was helpful.
ru: Формально: The person **with whom** I spoke was helpful (Человек, **с которым** я говорил, был полезным).

source: Informal: The person I spoke **with** was helpful.
ru: Неформально: The person I spoke **with** was helpful (Человек, с которым я говорил, был полезным).

source: Formal: **For** what purpose was the key used?
ru: Формально: **For** what purpose was the key used? (**Для** какой цели использовался ключ?)

source: Informal: What purpose was the key used **for**?
ru: Неформально: What purpose was the key used **for**? (Для какой цели использовался ключ?)

source: In passive voice, prepositions remain with their original verbs: The issue was **dealt with**.
ru: В пассивном залоге предлоги остаются при своих исходных глаголах: The issue was **dealt with** (Проблема была **рассмотрена**).

source: Incorrect: John and **me** went to the store.
ru: Неправильно: John and **me** went to the store (Джон и **меня** пошли в магазин).

source: Correct: John and **I** went to the store.
ru: Правильно: John and **I** went to the store (Джон и **я** пошли в магазин).

source: Incorrect: She gave the files to my partner and **I**.
ru: Неправильно: She gave the files to my partner and **I** (Она отдала файлы моему партнеру и **я**).

source: Correct: She gave the files to my partner and **me**.
ru: Правильно: She gave the files to my partner and **me** (Она отдала файлы моему партнеру и **мне**).

source: The pronoun is part of the subject, so it needs to be in the subjective case (**I**).
ru: Местоимение является частью подлежащего, поэтому оно должно быть в субъектном падеже (**I**).

source: The pronoun is part of the object of the preposition (**to**), so it needs the objective case (**me**).
ru: Местоимение является частью дополнения предлога (**to**), поэтому ему нужен объектный падеж (**me**).

source: <strong>Tip:</strong> Remove the other person's name to check if the pronoun sounds right on its own. (e.g., <span class="text-danger">Me went to the store</span> vs. **I** went to the store).
ru: <strong>Совет:</strong> Уберите имя другого человека, чтобы проверить, правильно ли звучит местоимение само по себе. (напр., <span class="text-danger">Me went to the store</span> (Меня пошел в магазин) против **I** went to the store (Я пошел в магазин)).

source: Ambiguous: John told David that **he** needed to take the day off.
ru: Двусмысленно: John told David that **he** needed to take the day off (Джон сказал Дэвиду, что **он** должен взять выходной).

source: Clear: John told David, "**I** need to take the day off." (or specify John/David)
ru: Ясно: John told David, "**I** need to take the day off." (Джон сказал Дэвиду: "**Мне** нужно взять выходной") (или уточнить, Джон/Дэвид)

source: Ambiguous: When the cover was placed on the bowl, it cracked.
ru: Двусмысленно: When the cover was placed on the bowl, **it** cracked (Когда крышку положили на миску, **она** треснула).

source: Clear: When the cover was placed on the bowl, **the bowl** cracked.
ru: Ясно: When the cover was placed on the bowl, **the bowl** cracked (Когда крышку положили на миску, **миска** треснула).

source: Incorrect: The manager and **myself** reviewed the report.
ru: Неправильно: The manager and **myself** reviewed the report (Менеджер и **сам я** просмотрели отчет).

source: Correct: The manager and **I** reviewed the report.
ru: Правильно: The manager and **I** reviewed the report (Менеджер и **я** просмотрели отчет).

source: Incorrect: Give the documents to James or **yourself**.
ru: Неправильно: Give the documents to James or **yourself** (Отдайте документы Джеймсу или **себе**).

source: Correct: Give the documents to James or **you**.
ru: Правильно: Give the documents to James or **you** (Отдайте документы Джеймсу или **вам**).

source: The pronoun is an object; it should be in the objective case (**I** is subjective, **me** is objective).
ru: Местоимение является объектом; оно должно быть в объектном падеже (**I** — субъектное, **me** — объектное).

source: The pronoun refers to a different person than the subject (**you**), so use a personal pronoun (**me**).
ru: Местоимение относится к другому лицу, нежели подлежащее (**you**), поэтому используйте личное местоимение (**me**).

source: A pronoun is a word that replaces a noun or a noun phrase. The word that the pronoun replaces is called its <span class="text-success">antecedent</span>.
ru: Местоимение — это слово, которое заменяет существительное или именную фразу. Слово, которое заменяет местоимение, называется его <span class="text-success">антецедентом (предшествующим словом)</span>.

source: Without Pronouns: **Mary** called **Mary**'s mother and asked **Mary**'s mother for advice.
ru: Без местоимений: **Mary** called **Mary**'s mother and asked **Mary**'s mother for advice (**Мэри** позвонила маме **Мэри** и попросила у мамы **Мэри** совета).

source: With Pronouns: **Mary** called **her** mother and asked **her** for advice.
ru: С местоимениями: **Mary** called **her** mother and asked **her** for advice (**Мэри** позвонила **своей** маме и попросила у **нее** совета).
