Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: A simple sentence is the most basic and fundamental sentence structure in English. It consists of a single independent clause and expresses a complete thought. All sentences, regardless of their complexity, are built upon this foundation.
ru: Простое предложение — это самая базовая и фундаментальная структура предложения в английском языке. Оно состоит из одной независимой части и выражает законченную мысль. Все предложения, независимо от их сложности, строятся на этой основе.
uk: Просте речення — це найбільш базова та фундаментальна структура речення в англійській мові. Воно складається з одного незалежного речення та виражає повну думку. Усі речення, незалежно від їхньої складності, будуються на цій основі.

source: Classification and Types
ru: Классификация и типы
uk: Класифікація та типи

source: By Purpose (Declarative, Interrogative, etc.)
ru: По цели (повествовательное, вопросительное и т. д.)
uk: За метою висловлювання (розповідні, питальні, тощо)

source: By Structure (Simple/Compound Subject/Predicate)
ru: По структуре (простое/составное подлежащее/сказуемое)
uk: За структурою (Простий/Складений Підмет/Присудок)

source: The Active Voice
ru: Активный залог
uk: Активний стан

source: <b>The Active Voice</b> is the most common and direct grammatical voice in English. In an active sentence, the <b>subject performs the action</b> of the verb, and the object receives that action. It emphasizes the doer of the action.
ru: <b>Активный залог</b> — это наиболее распространенный и прямой грамматический залог в английском языке. В активном предложении <b>подлежащее выполняет действие</b> глагола, а дополнение принимает это действие. Он акцентирует внимание на исполнителе действия.
uk: <b>Активний стан</b> є найбільш поширеним і прямим граматичним станом в англійській мові. У реченні в активному стані **підмет виконує дію** дієслова, а додаток приймає цю дію. Він наголошує на виконавцеві дії.

source: Forms of the Active Voice
ru: Формы активного залога
uk: Форми активного стану

source: The active voice is incredibly versatile and can be formed using
ru: Активный залог невероятно универсален и может быть образован с использованием
uk: Активний стан є надзвичайно універсальним і може утворюватися за допомогою

source: all standard verb tenses
ru: всех стандартных глагольных времен
uk: усіх стандартних дієслівних часів

source: in English. The key characteristic is that the subject of the sentence is the agent performing the action.
ru: в английском языке. Ключевая характеристика заключается в том, что подлежащее предложения является агентом, выполняющим действие.
uk: в англійській мові. Ключова характеристика полягає в тому, що підмет речення є агентом, який виконує дію.

source: General Formula:
ru: Общая формула:
uk: Загальна формула:

source: Subject + Verb (+ Object)
ru: Подлежащее + Глагол (+ Дополнение)
uk: Підмет + Дієслово (+ Додаток)

source: The
uk: Підмет

source: subject
ru: подлежащее
uk: підмет

source: is the doer of the action.
ru: является исполнителем действия.
uk: є виконавцем дії.

source: verb
ru: глагол
uk: дієслово

source: shows the action performed by the subject.
ru: показывает действие, выполняемое подлежащим.
uk: показує дію, виконану підметом.

source: object
ru: дополнение
uk: додаток

source: if present
ru: если присутствует
uk: якщо присутній

source: receives the action.
ru: принимает действие.
uk: приймає дію.

source: Active Voice Across Different Tenses:
ru: Активный залог в разных временах:
uk: Активний стан у різних часах:

source: 1. Simple Tenses
ru: 1. Простые времена
uk: 1. Прості часи

source: Present Simple Active:
ru: Настоящее простое время (активный залог):
uk: Активний теперішній простий час (Present Simple Active):

source: Subject + Base Verb (-s/es for 3rd person singular)
ru: Подлежащее + Базовый глагол (-s/es для 3-го лица единственного числа)
uk: Підмет + Базове дієслово (-s/es для 3-ї особи однини)

source: Past Simple Active:
ru: Прошедшее простое время (активный залог):
uk: Активний минулий простий час (Past Simple Active):

source: Subject + Past Simple Verb
ru: Подлежащее + Глагол в прошедшем простом времени
uk: Підмет + Дієслово у минулому простому часі (Past Simple Verb)

source: Future Simple Active:
ru: Будущее простое время (активный залог):
uk: Активний майбутній простий час (Future Simple Active):

source: Subject + will + Base Verb
ru: Подлежащее + will + Базовый глагол
uk: Підмет + will + Базове дієслово

source: 2. Continuous Tenses
ru: 2. Длительные времена
uk: 2. Тривалі часи

source: Present Continuous Active:
ru: Настоящее длительное время (активный залог):
uk: Активний теперішній тривалий час (Present Continuous Active):

source: Subject + am/is/are + -ing Verb
ru: Подлежащее + am/is/are + Глагол с окончанием -ing
uk: Підмет + am/is/are + Дієслово з -ing

source: Past Continuous Active:
ru: Прошедшее длительное время (активный залог):
uk: Активний минулий тривалий час (Past Continuous Active):

source: Subject + was/were + -ing Verb
ru: Подлежащее + was/were + Глагол с окончанием -ing
uk: Підмет + was/were + Дієслово з -ing

source: Future Continuous Active:
ru: Будущее длительное время (активный залог):
uk: Активний майбутній тривалий час (Future Continuous Active):

source: Subject + will be + -ing Verb
ru: Подлежащее + will be + Глагол с окончанием -ing
uk: Підмет + will be + Дієслово з -ing

source: 3. Perfect Tenses
ru: 3. Совершенные времена
uk: 3. Доконані часи (Perfect Tenses)

source: Present Perfect Active:
ru: Настоящее совершенное время (активный залог):
uk: Активний теперішній доконаний час (Present Perfect Active):

source: Subject + has/have + Past Participle
ru: Подлежащее + has/have + Причастие прошедшего времени
uk: Підмет + has/have + Дієприкметник минулого часу (Past Participle)

source: Past Perfect Active:
ru: Прошедшее совершенное время (активный залог):
uk: Активний минулий доконаний час (Past Perfect Active):

source: Subject + had + Past Participle
ru: Подлежащее + had + Причастие прошедшего времени
uk: Підмет + had + Дієприкметник минулого часу (Past Participle)

source: Future Perfect Active:
ru: Будущее совершенное время (активный залог):
uk: Активний майбутній доконаний час (Future Perfect Active):

source: Subject + will have + Past Participle
ru: Подлежащее + will have + Причастие прошедшего времени
uk: Підмет + will have + Дієприкметник минулого часу (Past Participle)

source: 4. Perfect Continuous Tenses
ru: 4. Совершенные длительные времена
uk: 4. Доконано-тривалі часи (Perfect Continuous Tenses)

source: Present Perfect Continuous Active:
ru: Настоящее совершенное длительное время (активный залог):
uk: Активний теперішній доконано-тривалий час (Present Perfect Continuous Active):

source: Subject + has/have been + -ing Verb
ru: Подлежащее + has/have been + Глагол с окончанием -ing
uk: Підмет + has/have been + Дієслово з -ing

source: Past Perfect Continuous Active:
ru: Прошедшее совершенное длительное время (активный залог):
uk: Активний минулий доконано-тривалий час (Past Perfect Continuous Active):

source: Subject + had been + -ing Verb
ru: Подлежащее + had been + Глагол с окончанием -ing
uk: Підмет + had been + Дієслово з -ing

source: Future Perfect Continuous Active:
ru: Будущее совершенное длительное время (активный залог):
uk: Активний майбутній доконано-тривалий час (Future Perfect Continuous Active):

source: Subject + will have been + -ing Verb
ru: Подлежащее + will have been + Глагол с окончанием -ing
uk: Підмет + will have been + Дієслово з -ing

source: Use of the Active Voice
ru: Использование активного залога
uk: Використання активного стану

source: The active voice is generally preferred in English writing and speaking because it is
ru: Активный залог обычно предпочтителен в английском письме и речи, потому что он
uk: Активний стан загалом є кращим у письмовому та усному спілкуванні англійською мовою, оскільки він

source: clear, direct, and concise
ru: ясный, прямой и лаконичный
uk: чіткий, прямий та лаконічний

source: It makes sentences easier to understand and more impactful.
ru: . Он делает предложения более легкими для понимания и более выразительными.
uk: Він робить речення простішими для розуміння та більш впливовими.

source: 1. Emphasizing the Doer of the Action
ru: 1. Подчеркивание исполнителя действия
uk: 1. Наголос на виконавці дії

source: When you want to highlight who or what performed the action, the active voice is the natural choice.
ru: Когда вы хотите выделить, кто или что совершил действие, активный залог является естественным выбором.
uk: Коли ви хочете виділити, хто або що виконав дію, активний стан є природним вибором.

source: Focus on the dog
ru: Акцент на собаке
uk: Фокус на собаці

source: Focus on the scientists
ru: Акцент на ученых
uk: Фокус на вчених

source: Focus on \
ru: Акцент на \
uk: Фокус на \

source: 2. Promoting Clarity and Directness
ru: 2. Содействие ясности и прямоте
uk: 2. Сприяння ясності та прямоті

source: Active sentences are typically shorter and more straightforward, making your communication more effective and less ambiguous.
ru: Активные предложения обычно короче и более прямолинейны, что делает ваше общение более эффективным и менее двусмысленным.
uk: Активні речення зазвичай коротші та більш прямолінійні, що робить ваше спілкування ефективнішим та менш двозначним.

source: Clear and direct
ru: Ясно и прямо
uk: Ясно та прямо

source: Compare to passive:
ru: Сравните с пассивным:
uk: Порівняйте з пасивним станом:

source: Takes responsibility
ru: Берет ответственность
uk: Бере на себе відповідальність

source: 3. Making Writing More Dynamic and Engaging
ru: 3. Делает письмо более динамичным и увлекательным
uk: 3. Робить текст більш динамічним та захоплюючим

source: Active voice often results in more vigorous and engaging prose, which is particularly beneficial in storytelling, persuasive writing, and general communication.
ru: Активный залог часто приводит к более энергичной и увлекательной прозе, что особенно полезно в повествовании, убеждающем письме и общем общении.
uk: Активний стан часто призводить до більш енергійної та захоплюючої прози, що особливо корисно в оповіданні, переконливому письмі та загальному спілкуванні.

source: Vivid action
ru: Яркое действие
uk: Жива дія

source: Strong, active statement
ru: Сильное, активное утверждение
uk: Сильне, активне твердження

source: Emphasizes effort and achievement
ru: Подчеркивает усилие и достижение
uk: Наголошує на зусиллях та досягненнях

source: 4. When the Doer is Known and Important
ru: 4. Когда исполнитель известен и важен
uk: 4. Коли виконавець дії відомий і важливий

source: If the identity of the person or thing performing the action is crucial to the meaning of the sentence, the active voice is essential.
ru: Если личность человека или предмета, выполняющего действие, имеет решающее значение для смысла предложения, активный залог необходим.
uk: Якщо особа або річ, що виконує дію, є вирішальною для значення речення, активний стан є необхідним.

source: When to Choose Active Voice:
ru: Когда выбирать активный залог:
uk: Коли обирати активний стан:

source: While the passive voice has its specific uses, the active voice should be your default choice for effective and clear English.
ru: Хотя пассивный залог имеет свои специфические применения, активный залог должен быть вашим выбором по умолчанию для эффективного и ясного английского языка.
uk: Хоча пасивний стан має свої специфічні випадки використання, активний стан має бути вашим вибором за замовчуванням для ефективної та зрозумілої англійської мови.

source: For most everyday communication.
ru: Для большинства повседневного общения.
uk: Для більшості повсякденного спілкування.

source: When you want to assign responsibility clearly.
ru: Когда вы хотите четко назначить ответственность.
uk: Коли ви хочете чітко призначити відповідальність.

source: To create strong, concise, and dynamic sentences.
ru: Для создания сильных, лаконичных и динамичных предложений.
uk: Для створення сильних, лаконічних та динамічних речень.

source: When the agent of the action is important or known.
ru: Когда исполнитель действия важен или известен.
uk: Коли виконавець дії важливий або відомий.

source: Back to Verbs
ru: Назад к глаголам
uk: Назад до Дієслів

source: English verbs are one of the most complex and diverse parts of speech, essential for constructing any sentence. They can be classified according to various criteria, which helps to better understand their functions and usage.
ru: Английские глаголы — одна из самых сложных и разнообразных частей речи, необходимая для построения любого предложения. Они могут быть классифицированы по различным критериям, что помогает лучше понять их функции и использование.
uk: Англійські дієслова є однією з найскладніших і найрізноманітніших частин мови, необхідною для побудови будь-якого речення. Їх можна класифікувати за різними критеріями, що допомагає краще зрозуміти їхні функції та використання.

source: By Meaning and Function:
ru: По значению и функции:
uk: За значенням та функцією:

source: Notional (Main) Verbs:
ru: Знаменательные (основные) глаголы:
uk: Значущі (основні) дієслова:

source: Have independent lexical meaning and denote a specific action, state, process, or relation.
ru: Имеют независимое лексическое значение и обозначают конкретное действие, состояние, процесс или отношение.
uk: Мають самостійне лексичне значення та позначають конкретну дію, стан, процес чи відношення.

source: Auxiliary (Helping) Verbs:
ru: Вспомогательные глаголы:
uk: Допоміжні дієслова:

source: Are used to form complex verb constructions (tenses, voices, moods) and do not have independent lexical meaning.
ru: Используются для образования сложных глагольных конструкций (времен, залогов, наклонений) и не имеют независимого лексического значения.
uk: Використовуються для утворення складних дієслівних конструкцій (часів, станів, способів) і не мають самостійного лексичного значення.

source: (e.g., in 'I <span class=\
ru: (напр., в 'Я <span class=\
uk: (наприклад, у 'I <span class=\

source: Link-Verbs (Copular Verbs):
ru: Глаголы-связки:
uk: Дієслова-зв'язки (Copular Verbs):

source: Connect the subject with the predicative part of the predicate (noun, adjective, pronoun, etc.), indicating the subject's state or characteristic. They partially or completely lose their lexical meaning.
ru: Соединяют подлежащее с предикативной частью сказуемого (существительное, прилагательное, местоимение и т. д.), указывая на состояние или характеристику подлежащего. Они частично или полностью теряют свое лексическое значение.
uk: З'єднують підмет із предикативною частиною присудка (іменником, прикметником, займенником тощо), вказуючи на стан або характеристику підмета. Вони частково або повністю втрачають своє лексичне значення.

source: Modal Verbs:
ru: Модальные глаголы:
uk: Модальні дієслова:

source: Express the speaker's attitude towards an action (possibility, necessity, obligation, permission, etc.), but not the action itself. They do not change form for person or number.
ru: Выражают отношение говорящего к действию (возможность, необходимость, обязанность, разрешение и т. д.), но не само действие. Они не изменяют форму по лицу или числу.
uk: Виражають ставлення мовця до дії (можливість, необхідність, зобов'язання, дозвіл тощо), але не саму дію. Вони не змінюють форму за особою чи числом.

source: By the Presence of a Direct Object:
ru: По наличию прямого дополнения:
uk: За наявністю прямого додатка:

source: Transitive Verbs:
ru: Переходные глаголы:
uk: Перехідні дієслова:

source: Require a direct object, which the action is directed upon.
ru: Требуют прямого дополнения, на которое направлено действие.
uk: Вимагають прямого додатка, на який спрямована дія.

source: Intransitive Verbs:
ru: Непереходные глаголы:
uk: Неперехідні дієслова:

source: Do not require a direct object. The action is performed by the subject itself and does not pass to another object.
ru: Не требуют прямого дополнения. Действие выполняется самим подлежащим и не переходит на другой объект.
uk: Не вимагають прямого додатка. Дія виконується самим підметом і не переходить на інший об'єкт.

source: Some verbs can be both transitive and intransitive depending on the context.
ru: Некоторые глаголы могут быть как переходными, так и непереходными в зависимости от контекста.
uk: Деякі дієслова можуть бути як перехідними, так і неперехідними залежно від контексту.

source: Finite and Non-Finite Forms of the Verb
ru: Личные и неличные формы глагола
uk: Особові та неособові форми дієслова

source: English verbs can appear in two main categories of forms: <span class=\
ru: Английские глаголы могут принимать две основные категории форм: <span class=\
uk: Англійські дієслова можуть мати дві основні категорії форм: <span class=\

source: Finite Verbs (Личные формы глагола)
ru: Личные глаголы (Finite Verbs)
uk: Особові дієслова (Finite Verbs)

source: Key characteristics of finite verbs:
ru: Ключевые характеристики личных глаголов:
uk: Ключові характеристики особових дієслів:

source: They agree with their subject in person and number (e.g., <i><span class=\
ru: Они согласуются со своим подлежащим по лицу и числу (напр., <i><span class=\
uk: Вони узгоджуються зі своїм підметом в особі та числі (наприклад, <i><span class=\

source: They indicate a specific tense (e.g., <i><span class=\
ru: Они указывают на конкретное время (напр., <i><span class=\
uk: Вони вказують на конкретний час (наприклад, <i><span class=\

source: They can stand alone as the main verb of a sentence or clause.
ru: Они могут выступать в качестве основного глагола предложения или части.
uk: Вони можуть виступати самостійно як основне дієслово речення або підрядного речення.

source: They typically form questions and negatives using auxiliary verbs (like \
ru: Они обычно образуют вопросы и отрицания с помощью вспомогательных глаголов (таких как \
uk: Зазвичай вони утворюють питання та заперечення за допомогою допоміжних дієслів (як \

source: Present Simple, 3rd person singular
ru: Present Simple, 3-е лицо единственного числа
uk: Теперішній простий час, 3-тя особа однини

source: Past Continuous, 3rd person plural
ru: Past Continuous, 3-е лицо множественного числа
uk: Минулий тривалий час, 3-тя особа множини

source: Future Simple, 3rd person singular
ru: Future Simple, 3-е лицо единственного числа
uk: Майбутній простий час, 3-тя особа однини

source: Present Perfect, 1st person singular
ru: Present Perfect, 1-е лицо единственного числа
uk: Теперішній доконаний час, 1-ша особа однини

source: Every complete sentence in English must contain at least one finite verb.
ru: Каждое законченное предложение в английском языке должно содержать хотя бы один личный глагол.
uk: Кожне повне речення в англійській мові повинно містити принаймні одне особове дієслово.

source: Non-Finite Verbs (Неличные формы глагола)
ru: Неличные глаголы (Non-Finite Verbs)
uk: Неособові дієслова (Non-Finite Verbs)

source: The three main types of non-finite verbs are:
ru: Три основных типа неличных глаголов:
uk: Три основні типи неособових дієслів:

source: Infinitives:
ru: Инфинитивы:
uk: Інфінітиви:

source: The base form of the verb, often preceded by \
ru: Базовая форма глагола, часто предшествуемая \
uk: Базова форма дієслова, перед якою часто стоїть \

source: As a noun:
ru: В качестве существительного:
uk: Як іменник:

source: As an adjective:
ru: В качестве прилагательного:
uk: Як прикметник:

source: As an adverb:
ru: В качестве наречия:
uk: Як прислівник:

source: Bare infinitive after modal verbs:
ru: Голый инфинитив после модальных глаголов:
uk: Голий інфінітив після модальних дієслів:

source: Gerunds:
ru: Герундий:
uk: Герундій:

source: The -ing form of a verb used as a noun.
ru: Форма глагола с окончанием -ing, используемая в качестве существительного.
uk: Форма дієслова на -ing, що використовується як іменник.

source: Participles:
ru: Причастия:
uk: Дієприкметники:

source: Present Participle (-ing form):
ru: Причастие настоящего времени (форма -ing):
uk: Дієприкметник теперішнього часу (форма на -ing):

source: Used as part of continuous tenses or as an adjective.
ru: Используется как часть длительных времен или как прилагательное.
uk: Використовується як частина тривалих часів або як прикметник.

source: Part of verb phrase
ru: Часть глагольной фразы
uk: Частина дієслівної фрази

source: Past Participle (-ed, -en, etc. form):
ru: Причастие прошедшего времени (форма -ed, -en и т. д.):
uk: Дієприкметник минулого часу (форма на -ed, -en, тощо):

source: Used as part of perfect tenses, in the passive voice, or as an adjective.
ru: Используется как часть совершенных времен, в пассивном залоге или как прилагательное.
uk: Використовується як частина доконаних часів, у пасивному стані або як прикметник.

source: Part of passive voice
ru: Часть пассивного залога
uk: Частина пасивного стану

source: Understanding the distinction between finite and non-finite verbs is fundamental for complex sentence construction and grammatical accuracy in English.
ru: Понимание различия между личными и неличными глаголами является основополагающим для построения сложных предложений и грамматической точности в английском языке.
uk: Розуміння різниці між особовими та неособовими дієсловами є фундаментальним для побудови складних речень та граматичної точності в англійській мові.

source: The Future Continuous
ru: Будущее длительное время (Future Continuous)
uk: Майбутній тривалий час (Future Continuous)

source: The Future Continuous (Future Progressive)
ru: Будущее длительное время (Future Continuous/Progressive)
uk: Майбутній тривалий час (Future Continuous / Future Progressive)

source: Formation of the Future Continuous
ru: Образование Future Continuous
uk: Утворення Майбутнього тривалого часу (Future Continuous)

source: The Future Continuous is formed using the auxiliary verbs <span class=\
ru: Future Continuous образуется с помощью вспомогательных глаголов <span class=\
uk: Майбутній тривалий час утворюється за допомогою допоміжних дієслів <span class=\

source: 1. Affirmative Sentences
ru: 1. Утвердительные предложения
uk: 1. Стверджувальні речення

source: Person / Number
ru: Лицо / Число
uk: Особа / Число

source: Auxiliary 1
ru: Вспомогательный 1
uk: Допоміжне дієслово 1

source: Auxiliary 2
ru: Вспомогательный 2
uk: Допоміжне дієслово 2

source: Contractions:
ru: Сокращения:
uk: Скорочення:

source: In informal speech and writing, contractions are common:
ru: В неформальной речи и письме часто используются сокращения:
uk: У неформальному мовленні та письмі поширені скорочення:

source: 2. Negative Sentences
ru: 2. Отрицательные предложения
uk: 2. Заперечні речення

source: To form negative sentences, we place <span class=\
ru: Чтобы образовать отрицательные предложения, мы ставим <span class=\
uk: Щоб утворити заперечні речення, ми ставимо <span class=\

source: 3. Interrogative Sentences (Questions)
ru: 3. Вопросительные предложения (Вопросы)
uk: 3. Питальні речення

source: To form questions, we invert the subject and \
ru: Чтобы образовать вопросы, мы инвертируем подлежащее и \
uk: Для утворення питань ми інвертуємо підмет і \

source: for Wh-questions
ru: для Wh-вопросов
uk: для Wh-питань

source: Uses of the Future Continuous
ru: Использование Future Continuous
uk: Використання Майбутнього тривалого часу (Future Continuous)

source: The Future Continuous is used to express:
ru: Future Continuous используется для выражения:
uk: Майбутній тривалий час використовується для вираження:

source: Actions that Will Be in Progress at a Specific Time in the Future:
ru: Действия, которые будут происходить в определенный момент в будущем:
uk: Дій, які будуть відбуватися (будуть у процесі) у певний час у майбутньому:
