Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: When modifiers are separated for emphasis or clarity
ru: Когда определители разделены для выделения или ясности
uk: Коли модифікатори розділені для підкреслення або ясності

source: Special Cases and Challenges
ru: Особые случаи и сложности
uk: Особливі випадки та проблеми

source: 1. Adjective Order
ru: 1. Порядок прилагательных
uk: 1. Порядок прикметників

source: English follows a specific sequence for multiple adjectives:
ru: В английском языке соблюдается определенная последовательность для нескольких прилагательных:
uk: В англійській мові дотримується певна послідовність для кількох прикметників:

source: 2. Restrictive vs Non-restrictive
ru: 2. Ограничительные против неограничительных
uk: 2. Обмежувальні проти необмежувальних

source: Direct and Indirect Objects
ru: Прямые и косвенные дополнения
uk: Прямі та непрямі додатки

source: Objects complete the meaning of transitive verbs, with
uk: Додатки доповнюють значення перехідних дієслів, з

source: Essential for completing the meaning of transitive verbs
ru: Существенны для завершения значения переходных глаголов
uk: Необхідний для завершення значення перехідних дієслів

source: Can be nouns, pronouns, or noun phrases
ru: Могут быть существительными, местоимениями или именными фразами
uk: Може бути іменником, займенником або іменниковою фразою

source: Becomes the subject when converted to passive voice
ru: Становится подлежащим при преобразовании в пассивный залог
uk: Стає підметом при перетворенні на пасивний стан

source: Identification Test:
ru: Тест на определение:
uk: Тест на ідентифікацію:

source: Try converting the sentence to passive voice - the direct object will become the subject:
ru: Попробуйте преобразовать предложение в пассивный залог — прямое дополнение станет подлежащим:
uk: Спробуйте перетворити речення на пасивний стан - прямий додаток стане підметом:

source: Always appears between the verb and the direct object
ru: Всегда появляется между глаголом и прямым дополнением
uk: Завжди стоїть між дієсловом і прямим додатком

source: Can be replaced with a prepositional phrase (to/for + object)
ru: Может быть заменено предложной фразой (to/for + дополнение)
uk: Може бути замінений прийменниковою фразою (to/for + додаток)

source: Only appears when there is also a direct object
ru: Появляется только при наличии прямого дополнения
uk: З'являється лише тоді, коли є також прямий додаток

source: Alternative Form:
ru: Альтернативная форма:
uk: Альтернативна форма:

source: Indirect objects can be converted to prepositional phrases:
ru: Косвенные дополнения могут быть преобразованы в предложные фразы:
uk: Непрямі додатки можуть бути перетворені на прийменникові фрази:

source: After verb (or after indirect object)
ru: После глагола (или после косвенного дополнения)
uk: Після дієслова (або після непрямого додатка)

source: Between verb and direct object
ru: Между глаголом и прямым дополнением
uk: Між дієсловом і прямим додатком

source: Yes (with transitive verbs)
ru: Да (с переходными глаголами)
uk: Так (з перехідними дієсловами)

source: No (optional)
ru: Нет (необязательно)
uk: Ні (необов'язково)

source: Becomes subject
ru: Становится подлежащим
uk: Стає підметом

source: Remains in prepositional phrase
ru: Остается в предложной фразе
uk: Залишається в прийменниковій фразі

source: 1. Verbs with Dual Patterns
ru: 1. Глаголы с двойными моделями
uk: 1. Дієслова з подвійними моделями

source: Some verbs can take either pattern with minimal meaning change:
ru: Некоторые глаголы могут принимать любую из моделей с минимальным изменением значения:
uk: Деякі дієслова можуть приймати обидві моделі з мінімальною зміною значення:

source: 2. Verbs That Require Indirect Objects
ru: 2. Глаголы, требующие косвенных дополнений
uk: 2. Дієслова, які вимагають непрямих додатків

source: Some verbs nearly always appear with indirect objects:
ru: Некоторые глаголы почти всегда появляются с косвенными дополнениями:
uk: Деякі дієслова майже завжди з’являються з непрямими додатками:

source: 3. Common Mistakes
ru: 3. Распространенные ошибки
uk: 3. Поширені помилки

source: Definition and Purpose of the Object
ru: Определение и назначение дополнения
uk: Визначення та призначення додатка

source: The Object in English Grammar
ru: Дополнение в английской грамматике
uk: Додаток в англійській граматиці

source: Core Characteristics of Objects
ru: Основные характеристики дополнений
uk: Основні характеристики додатків

source: Always associated with
uk: Завжди пов'язаний з

source: May be single words or complex constructions
ru: Может быть отдельными словами или сложными конструкциями
uk: Може бути одним словом або складною конструкцією

source: Essential for completing the meaning of many verbs
ru: Существенно для завершения значения многих глаголов
uk: Необхідний для завершення значення багатьох дієслів

source: Types of Objects
ru: Типы дополнений
uk: Типи додатків

source: 1. Direct Objects
ru: 1. Прямые дополнения
uk: 1. Прямі додатки

source: The primary receiver of the verb's action.
ru: Основной получатель действия глагола.
uk: Первинний отримувач дії дієслова.

source: 2. Indirect Objects
ru: 2. Косвенные дополнения
uk: 2. Непрямі додатки

source: The recipient or beneficiary of the direct object.
ru: Получатель или бенефициар прямого дополнения.
uk: Одержувач або бенефіціар прямого додатка.

source: 3. Objects of Prepositions
ru: 3. Дополнения предлогов
uk: 3. Додатки прийменників

source: Nouns/pronouns that complete prepositional phrases.
ru: Существительные/местоимения, которые завершают предложные фразы.
uk: Іменники/займенники, які доповнюють прийменникові фрази.

source: Object Identification Techniques
ru: Методы определения дополнения
uk: Методи ідентифікації додатка

source: Object becomes subject in passive voice
ru: Дополнение становится подлежащим в пассивном залоге
uk: Додаток стає підметом у пасивному стані

source: Replace with object pronouns (me, him, her, etc.)
ru: Заменить объектными местоимениями (me, him, her и т.д.)
uk: Замініть на об'єктні займенники (me, him, her, тощо)

source: Common Mistakes with Objects
ru: Распространенные ошибки с дополнениями
uk: Поширені помилки з додатками

source: Object of a Preposition
ru: Дополнение предлога
uk: Додаток прийменника

source: Core Structure
ru: Основная структура
uk: Основна структура

source: Always follows a preposition (in, on, at, with, to, etc.)
ru: Всегда следует за предлогом (in, on, at, with, to и т.д.)
uk: Завжди стоїть після прийменника (in, on, at, with, to, тощо)

source: Can be a noun, pronoun, gerund, or noun clause
ru: Может быть существительным, местоимением, герундием или именным придаточным предложением
uk: Може бути іменником, займенником, герундієм або іменниковим підрядним реченням

source: Never a verb in its base form
ru: Никогда не является глаголом в его основной форме
uk: Ніколи не є дієсловом у його базовій формі

source: Answers
uk: Відповідає на

source: Types of Prepositional Objects
ru: Типы предложных дополнений
uk: Типи прийменникових додатків

source: 1. Noun Objects
ru: 1. Дополнения-существительные
uk: 1. Іменникові додатки

source: The most common type of prepositional object:
ru: Самый распространенный тип предложного дополнения:
uk: Найпоширеніший тип прийменникового додатка:

source: 2. Pronoun Objects
ru: 2. Дополнения-местоимения
uk: 2. Займенникові додатки

source: Must be in the objective case:
ru: Должны быть в объектном падеже:
uk: Має бути в об’єктному відмінку:

source: 3. Gerund Objects
ru: 3. Дополнения-герундии
uk: 3. Додатки-герундії

source: Verbs in -ing form functioning as nouns:
ru: Глаголы в форме -ing, функционирующие как существительные:
uk: Дієслова у формі на -ing, що функціонують як іменники:

source: 4. Noun Clause Objects
ru: 4. Дополнения-именные придаточные предложения
uk: 4. Додатки-іменникові підрядні речення

source: Whole clauses functioning as objects:
ru: Целые придаточные предложения, функционирующие как дополнения:
uk: Цілі підрядні речення, що функціонують як додатки:

source: Grammatical Functions
ru: Грамматические функции
uk: Граматичні функції

source: Modifies the verb (when she slept)
ru: Модифицирует глагол (когда она спала)
uk: Модифікує дієслово (коли вона спала)

source: Modifies the noun (which man)
ru: Модифицирует существительное (какой человек)
uk: Модифікує іменник (який чоловік)

source: Functions as a noun (subject of sentence)
ru: Функционирует как существительное (подлежащее предложения)
uk: Функціонує як іменник (підмет речення)

source: 1. Multiple Prepositional Phrases
ru: 1. Множественные предложные фразы
uk: 1. Кілька прийменникових фраз

source: Sentences can contain chains of prepositional phrases:
ru: Предложения могут содержать цепочки предложных фраз:
uk: Речення можуть містити ланцюжки прийменникових фраз:

source: 2. Preposition Stranding
ru: 2. Отделение предлога
uk: 2. Залишення прийменника

source: When the object moves but leaves the preposition behind:
ru: Когда дополнение перемещается, но оставляет предлог позади:
uk: Коли додаток переміщується, але залишає прийменник позаду:

source: Position of the Attribute
ru: Позиция определения
uk: Позиція означення

source: Attribute Positioning in English Grammar
ru: Позиционирование определения в английской грамматике
uk: Розташування означень в англійській граматиці

source: The position of attributes relative to the nouns they modify follows specific patterns in English, depending on the type of attribute and its grammatical function.
ru: Позиция определений относительно существительных, которые они модифицируют, следует определенным моделям в английском языке, в зависимости от типа определения и его грамматической функции.
uk: Позиція означень відносно іменників, які вони модифікують, підпорядковується певним закономірностям в англійській мові, залежно від типу означення та його граматичної функції.

source: 1. Pre-positional Attributes
ru: 1. Препозиционные определения (до существительного)
uk: 1. Перепозиційні означення (що стоять перед іменником)

source: Most common position for single-word modifiers
ru: Самая распространенная позиция для однословных определителей
uk: Найпоширеніша позиція для модифікаторів з одного слова

source: Typical for adjectives, determiners, and participles
ru: Типично для прилагательных, определителей и причастий
uk: Типова для прикметників, детермінативів та дієприкметників

source: Follows a specific order when multiple attributes are present
ru: Соблюдает определенный порядок, когда присутствует несколько определений
uk: Дотримується певного порядку, коли присутні кілька означень

source: Generally limited to about 3-4 attributes before becoming awkward
ru: Обычно ограничивается 3-4 определениями, прежде чем стать неуклюжим
uk: Зазвичай обмежується приблизно 3-4 означеннями, перш ніж стати незграбним

source: Adjective Order Rules:
ru: Правила порядка прилагательных:
uk: Правила порядку прикметників:

source: 2. Post-positional Attributes
ru: 2. Постпозиционные определения (после существительного)
uk: 2. Постпозиційні означення (що стоять після іменника)

source: Required for longer modifying phrases
ru: Требуется для более длинных модифицирующих фраз
uk: Необхідні для довших модифікуючих фраз

source: Typical for prepositional phrases and relative clauses
ru: Типично для предложных фраз и относительных придаточных предложений
uk: Типова для прийменникових фраз та відносних підрядних речень

source: Used with certain adjectives (especially those beginning with 'a-')
ru: Используется с некоторыми прилагательными (особенно начинающимися с 'a-')
uk: Використовується з певними прикметниками (особливо тими, що починаються з 'a-')

source: Common with indefinite pronouns (something, anyone)
ru: Распространено с неопределенными местоимениями (something, anyone)
uk: Поширена з неозначеними займенниками (something, anyone)

source: 3. Discontinuous Attributes
ru: 3. Разрывные определения
uk: 3. Розірвані означення

source: Occurs when an attribute is split around the noun
ru: Возникает, когда определение разделено вокруг существительного
uk: Виникає, коли означення розділяється навколо іменника

source: Common with compound adjectives
ru: Распространено со сложными прилагательными
uk: Поширена зі складеними прикметниками

source: Used for emphasis or stylistic purposes
ru: Используется для выделения или стилистических целей
uk: Використовується для підкреслення або стилістичних цілей

source: Sometimes required for grammatical correctness
ru: Иногда требуется для грамматической правильности
uk: Іноді необхідна для граматичної правильності

source: Position Comparison Table
ru: Сравнительная таблица позиций
uk: Таблиця порівняння позицій

source: Position Type
ru: Тип позиции
uk: Тип позиції

source: Typical Forms
ru: Типичные формы
uk: Типові форми

source: Adjectives, determiners, participles
ru: Прилагательные, определители, причастия
uk: Прикметники, детермінативи, дієприкметники

source: Most common position
ru: Самая распространенная позиция
uk: Найпоширеніша позиція

source: Phrases, clauses, certain adjectives
ru: Фразы, придаточные предложения, некоторые прилагательные
uk: Фрази, підрядні речення, певні прикметники

source: Required for longer modifiers
ru: Требуется для более длинных определителей
uk: Необхідна для довших модифікаторів

source: Compound adjectives, comparatives
ru: Сложные прилагательные, сравнительные степени
uk: Складені прикметники, ступені порівняння

source: Used for emphasis or clarity
ru: Используется для выделения или ясности
uk: Використовується для підкреслення або ясності

source: 1. Meaning Changes with Position
ru: 1. Изменение значения в зависимости от позиции
uk: 1. Зміна значення залежно від позиції

source: Some adjectives change meaning based on position:
ru: Некоторые прилагательные меняют значение в зависимости от позиции:
uk: Деякі прикметники змінюють значення залежно від позиції:

source: 2. Multiple Attribute Placement
ru: 2. Размещение нескольких определений
uk: 2. Розміщення кількох означень

source: When combining different types of attributes:
ru: При объединении различных типов определений:
uk: При поєднанні різних типів означень:

source: Determiners first (the, a, some)
ru: Сначала определители (the, a, some)
uk: Спершу детермінативи (the, a, some)

source: Pre-noun adjectives in proper order
ru: Препозиционные прилагательные в правильном порядке
uk: Прикметники перед іменником у належному порядку

source: Noun being modified
ru: Модифицируемое существительное
uk: Іменник, який модифікується

source: Post-noun modifiers
ru: Постпозиционные определители
uk: Модифікатори після іменника

source: Types of Adverbial Modifiers
ru: Типы обстоятельств
uk: Типи прислівникових модифікаторів

source: Comprehensive Classification of Adverbial Modifiers
ru: Всесторонняя классификация обстоятельств
uk: Комплексна класифікація прислівникових модифікаторів

source: Adverbial modifiers can be systematically categorized based on their semantic functions and the specific information they contribute to sentence meaning.
ru: Обстоятельства могут быть систематически классифицированы на основе их семантических функций и конкретной информации, которую они вносят в значение предложения.
uk: Прислівникові модифікатори можна систематично класифікувати на основі їхніх семантичних функцій та конкретної інформації, яку вони вносять у значення речення.

source: 1. Time Adverbials
ru: 1. Обстоятельства времени
uk: 1. Прислівники часу

source: Subtypes:
ru: Подтипы:
uk: Підтипи:

source: 2. Place Adverbials
ru: 2. Обстоятельства места
uk: 2. Прислівники місця

source: 3. Manner Adverbials
ru: 3. Обстоятельства образа действия
uk: 3. Прислівники способу дії

source: 4. Cause/Reason Adverbials
ru: 4. Обстоятельства причины
uk: 4. Прислівники причини

source: 5. Additional Adverbial Types
ru: 5. Дополнительные типы обстоятельств
uk: 5. Додаткові типи прислівникових модифікаторів

source: A. Degree Adverbials
ru: A. Обстоятельства степени
uk: A. Прислівники ступеня

source: B. Focus Adverbials
ru: B. Фокусирующие обстоятельства
uk: B. Фокусні прислівники

source: C. Sentence Adverbials
ru: C. Предложенческие обстоятельства
uk: C. Прислівники речення

source: D. Connective Adverbials
ru: D. Соединительные обстоятельства
uk: D. З'єднувальні прислівники

source: Functional Comparison
ru: Функциональное сравнение
uk: Функціональне порівняння

source: Question
ru: Вопрос
uk: Питання

source: Common Forms
ru: Распространенные формы
uk: Поширені форми

source: Adverbs, noun phrases, clauses
ru: Наречия, именные фразы, придаточные предложения
uk: Прислівники, іменникові фрази, підрядні речення

source: Adverbs, prepositional phrases
ru: Наречия, предложные фразы
uk: Прислівники, прийменникові фрази

source: Prepositional phrases, clauses
ru: Предложные фразы, придаточные предложения
uk: Прийменникові фрази, підрядні речення

source: 1. Multiple Adverbials
ru: 1. Множественные обстоятельства
uk: 1. Кілька прислівникових модифікаторів

source: Typical order when combining different types:
uk: Типовий порядок при поєднанні різних типів:

source: 2. Position Variations
ru: 2. Вариации позиции
uk: 2. Варіації позиції

source: Some adverbial types are more flexible in position than others:
ru: Некоторые типы обстоятельств более гибки в позиции, чем другие:
uk: Деякі типи прислівників є більш гнучкими в позиції, ніж інші:

source: What Can Be an Adverbial Modifier?
ru: Что может быть обстоятельством?
uk: Що може бути прислівниковим модифікатором?

source: Grammatical Forms Functioning as Adverbial Modifiers
ru: Грамматические формы, функционирующие как обстоятельства
uk: Граматичні форми, що функціонують як прислівникові модифікатори

source: Adverbial modifiers can be realized through various grammatical structures, each providing different types of information about actions, qualities, or circumstances.
ru: Обстоятельства могут быть реализованы через различные грамматические структуры, каждая из которых предоставляет различные типы информации о действиях, качествах или обстоятельствах.
uk: Прислівникові модифікатори можуть бути реалізовані через різні граматичні структури, кожна з яких надає різні типи інформації про дії, якості або обставини.

source: Typically formed by adding
uk: Зазвичай утворюються додаванням

source: Can modify verbs, adjectives, other adverbs, or entire sentences
ru: Могут модифицировать глаголы, прилагательные, другие наречия или целые предложения
uk: Можуть модифікувати дієслова, прикметники, інші прислівники або цілі речення

source: Often flexible in sentence position
ru: Часто гибки в позиции в предложении
uk: Часто гнучкі в позиції речення

source: Some irregular forms don't follow the -ly pattern
ru: Некоторые нерегулярные формы не следуют образцу -ly
uk: Деякі неправильні форми не дотримуються шаблону -ly

source: 2. Prepositional Phrases
ru: 2. Предложные фразы
uk: 2. Прийменникові фрази

source: Function as adverbials of time, place, manner, etc.
ru: Функционируют как обстоятельства времени, места, образа действия и т.д.
uk: Функціонують як прислівники часу, місця, способу дії тощо

source: Often equivalent to adverb clauses
ru: Часто эквивалентны придаточным предложениям обстоятельства
uk: Часто еквівалентні прислівниковим підрядним реченням

source: Can be moved to different positions in the sentence
ru: Могут быть перемещены в разные позиции в предложении
uk: Можуть бути переміщені на різні позиції в реченні

source: Can sometimes be replaced with single-word adverbs
ru: Иногда могут быть заменены однословными наречиями
uk: Іноді можуть бути замінені прислівниками з одного слова

source: 3. Subordinate (Adverbial) Clauses
ru: 3. Придаточные (обстоятельственные) предложения
uk: 3. Підрядні (прислівникові) речення

source: Introduced by subordinating conjunctions
ru: Вводятся подчинительными союзами
uk: Вводяться підрядними сполучниками

source: Can express time, condition, purpose, etc.
ru: Могут выражать время, условие, цель и т.д.
uk: Можуть виражати час, умову, мету тощо

source: Often movable within the sentence
ru: Часто подвижны внутри предложения
uk: Часто рухомі в межах речення

source: Can be reduced to participial phrases in some cases
ru: В некоторых случаях могут быть сокращены до причастных оборотов
uk: У деяких випадках можуть бути зведені до дієприкметникових фраз

source: 4. Other Adverbial Structures
ru: 4. Другие обстоятельственные структуры
uk: 4. Інші прислівникові структури

source: A. Infinitive Phrases
ru: A. Инфинитивные фразы
uk: A. Інфінітивні фрази

source: B. Noun Phrases
ru: B. Именные фразы
uk: B. Іменникові фрази

source: C. Participial Phrases
ru: C. Причастные обороты
uk: C. Дієприкметникові фрази

source: D. Absolute Phrases
ru: D. Абсолютные фразы
uk: D. Абсолютні фрази

source: Equivalent To
ru: Эквивалентно
uk: Еквівалентно

source: Special Notes
ru: Особые примечания
uk: Особливі примітки

source: 1. Position Variations
ru: 1. Вариации позиции
uk: 1. Варіації позиції

source: Different adverbial forms have different positional flexibility:
ru: Различные обстоятельственные формы имеют разную позиционную гибкость:
uk: Різні прислівникові форми мають різну гнучкість позиції:

source: What Can Be an Attribute?
ru: Что может быть определением?
uk: Що може бути означенням?

source: Grammatical Forms That Can Function as Attributes
ru: Грамматические формы, которые могут функционировать как определения
uk: Граматичні форми, що можуть функціонувати як означення

source: Attributes can be expressed through various grammatical forms, each providing different types of information about the nouns they modify.
ru: Определения могут быть выражены через различные грамматические формы, каждая из которых предоставляет различные типы информации о существительных, которые они модифицируют.
uk: Означення можуть бути виражені через різні граматичні форми, кожна з яких надає різні типи інформації про іменники, які вони модифікують.

source: Most common attributive form
ru: Самая распространенная форма определения
uk: Найпоширеніша атрибутивна форма

source: Typically precede the noun they modify
ru: Обычно предшествуют существительному, которое они модифицируют
uk: Зазвичай передують іменнику, який вони модифікують

source: Can be gradable (comparative/superlative forms)
ru: Могут быть градируемыми (сравнительные/превосходные формы)
uk: Можуть бути градованими (форми порівняльного/найвищого ступеня)

source: Can be compound (dark-blue, ice-cold)
ru: Могут быть составными (dark-blue, ice-cold)
uk: Можуть бути складеними (dark-blue, ice-cold)

source: 2. Nouns and Noun Phrases
ru: 2. Существительные и именные фразы
uk: 2. Іменники та іменникові фрази

source: A. Possessive Nouns
ru: A. Притяжательные существительные
uk: A. Присвійні іменники

source: B. Noun Modifiers
ru: B. Существительные-модификаторы
uk: B. Іменникові модифікатори

source: C. Compound Nouns
ru: C. Составные существительные
uk: C. Складені іменники

source: 3. Participles
ru: 3. Причастия
uk: 3. Дієприкметники

source: A. Present Participles (-ing)
ru: A. Причастия настоящего времени (-ing)
uk: A. Дієприкметники теперішнього часу (-ing)

source: B. Past Participles (-ed/irregular)
ru: B. Причастия прошедшего времени (-ed/нерегулярные)
uk: B. Дієприкметники минулого часу (-ed/неправильні)

source: Always follow the noun they modify
ru: Всегда следуют за существительным, которое они модифицируют
uk: Завжди стоять після іменника, який вони модифікують

source: Can be restrictive or non-restrictive
ru: Могут быть ограничительными или неограничительными
uk: Можуть бути обмежувальними або необмежувальними

source: Often equivalent to relative clauses
ru: Часто эквивалентны относительным придаточным предложениям
uk: Часто еквівалентні відносним підрядним реченням

source: 5. Other Attributive Forms
ru: 5. Другие формы определения
uk: 5. Інші форми означень
