Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: To break into pieces; to fail completely
ru: Развалиться на куски; полностью потерпеть неудачу
uk: Розбитися на шматки; зазнати повного провалу

source: To understand or solve something
ru: Понять или решить что-либо
uk: Зрозуміти або вирішити щось

source: To complete a form or document
ru: Заполнить форму или документ
uk: Заповнити форму або документ

source: To discover information
ru: Обнаруживать информацию
uk: Знайти інформацію

source: To escape or avoid punishment for something wrong
ru: Избежать или уйти от наказания за что-либо неправильное
uk: Уникнути покарання за щось погане

source: To manage to live or do things with difficulty
ru: Справляться с жизнью или делами с трудом
uk: Справлятися з життям або робити щось з труднощами

source: To give something to someone for free
ru: Отдать что-либо кому-либо бесплатно
uk: Віддавати щось комусь безкоштовно

source: To continue
ru: Продолжать
uk: Продовжувати

source: To happen
ru: Происходить
uk: Відбуватися

source: To become an adult
ru: Становиться взрослым
uk: Ставати дорослим

source: To spend time with friends informally (informal)
ru: Проводить время с друзьями неформально (неформально)
uk: Проводити час із друзями неофіційно (неформально)

source: To wait (especially on the phone)
ru: Подождать (особенно по телефону)
uk: Зачекати (особливо по телефону)

source: To continue doing something
ru: Продолжать что-либо делать
uk: Продовжувати робити щось

source: To disappoint someone
ru: Разочаровывать кого-либо
uk: Розчарувати когось

source: To investigate or examine thoroughly
ru: Расследовать или изучать досконально
uk: Ретельно розслідувати або перевіряти

source: To faint or lose consciousness
ru: Потерять сознание или лишиться чувств
uk: Знепритомніти або втратити свідомість

source: The Present Continuous
ru: Настоящее продолженное время (The Present Continuous)
uk: Теперішній Тривалий Час (Present Continuous)

source: The Present Continuous (Present Progressive)
ru: Настоящее продолженное время (The Present Continuous / Present Progressive)
uk: Теперішній Тривалий Час (Present Continuous/Present Progressive)

source: Formation of the Present Continuous
ru: Образование Present Continuous
uk: Утворення Теперішнього Тривалого Часу

source: The Present Continuous is formed using the auxiliary verb <span class=\
ru: Present Continuous образуется с помощью вспомогательного глагола <span class=\
uk: Теперішній Тривалий Час утворюється за допомогою допоміжного дієслова <span class=\

source: Uses of the Present Continuous
ru: Использование Present Continuous
uk: Використання Теперішнього Тривалого Часу

source: The Present Continuous is used to express:
ru: Present Continuous используется для выражения:
uk: Теперішній Тривалий Час використовується для вираження:

source: Actions Happening at the Moment of Speaking:
ru: 1. Действия, происходящие в момент речи:
uk: Дії, Що Відбуваються В Момент Розмови:

source: Describes activities that are in progress right now.
ru: Описывает действия, которые происходят прямо сейчас.
uk: Описує дії, які тривають прямо зараз.

source: Common adverbs:
ru: Распространенные наречия:
uk: Поширені прислівники:

source: Temporary Actions or Situations:
ru: 2. Временные действия или ситуации:
uk: Тимчасові Дії Або Ситуації:

source: Describes activities that are ongoing for a limited period, not necessarily at the exact moment of speaking.
ru: Описывает действия, которые продолжаются в течение ограниченного периода, не обязательно в точный момент речи.
uk: Описує дії, які тривають протягом обмеженого періоду, не обов'язково в точний момент розмови.

source: Not necessarily studying at this precise second
ru: Не обязательно учится именно в эту секунду
uk: Не обов'язково навчається саме в цю секунду

source: Future Arrangements or Plans:
ru: 3. Будущие договоренности или планы:
uk: Майбутні Домовленості Або Плани:

source: Used for definite plans and arrangements in the near future, often with a specific time or date mentioned.
ru: Используется для определенных планов и договоренностей в ближайшем будущем, часто с упоминанием конкретного времени или даты.
uk: Використовується для чітких планів та домовленостей на найближче майбутнє, часто із зазначенням конкретного часу або дати.

source: Annoyance or Criticism
ru: 4. Раздражение или критика
uk: Роздратування або Критика

source: with
ru: с
uk: з

source: Used to complain about a habitual action that is annoying or irritating.
ru: Используется для жалоб на привычное действие, которое раздражает.
uk: Використовується для скарги на звичну дію, яка є набридливою або дратівливою.

source: Changing or Developing Situations:
ru: 5. Изменяющиеся или развивающиеся ситуации:
uk: Ситуації, Що Змінюються Або Розвиваються:

source: To describe trends or developments that are happening around the present time.
ru: Для описания тенденций или разработок, которые происходят в настоящее время.
uk: Для опису тенденцій або подій, які відбуваються навколо теперішнього часу.

source: Verbs Not Used in Continuous Tenses (Stative Verbs)
ru: Глаголы, не используемые в продолженных временах (Stative Verbs)
uk: Дієслова, Не Використовувані У Тривалих Часах (Стативні Дієслова)

source: As mentioned with the Present Simple, certain verbs (stative verbs) typically describe states, emotions, senses, possession, or opinions, rather than actions. These verbs are generally <span class=\
ru: Как упоминалось в Present Simple, некоторые глаголы (глаголы состояния) обычно описывают состояния, эмоции, чувства, владение или мнения, а не действия. Эти глаголы, как правило, **не используются** <span class=\
uk: Як зазначалося щодо Present Simple, певні дієслова (стативні дієслова) зазвичай описують стани, емоції, відчуття, володіння або думки, а не дії. Ці дієслова, як правило, <span class=\

source: for possession
ru: для владения
uk: для володіння

source: meaning seem
ru: со значением казаться
uk: означає здаватися

source: Some stative verbs can be used in continuous forms when they express an action or a temporary behavior (e.g., <i><span class=\
ru: Некоторые глаголы состояния могут использоваться в продолженных формах, когда они выражают действие или временное поведение (например, <i><span class=\
uk: Деякі стативні дієслова можуть використовуватися в тривалих формах, коли вони виражають дію або тимчасову поведінку (наприклад, <i><span class=\

source: Understanding the Present Continuous helps you accurately describe actions in progress, temporary situations, and future plans in English.
ru: Понимание Present Continuous помогает вам точно описывать действия в процессе, временные ситуации и планы на будущее в английском языке.
uk: Розуміння Present Continuous допомагає вам точно описувати дії в процесі, тимчасові ситуації та майбутні плани в англійській мові.

source: The Present Perfect
ru: Настоящее совершенное время (The Present Perfect)
uk: Теперішній Доконаний Час (Present Perfect)

source: Formation of the Present Perfect
ru: Образование Present Perfect
uk: Утворення Теперішнього Доконаного Часу

source: The Present Perfect is formed using the auxiliary verb <span class=\
ru: Present Perfect образуется с помощью вспомогательного глагола <span class=\
uk: Теперішній Доконаний Час утворюється за допомогою допоміжного дієслова <span class=\

source: Main Verb (Past Participle V3)
ru: Основной глагол (Причастие прошедшего времени V3)
uk: Основне Дієслово (Дієприкметник Минулого Часу V3)

source: Uses of the Present Perfect
ru: Использование Present Perfect
uk: Використання Теперішнього Доконаного Часу

source: The Present Perfect is used to express:
ru: Present Perfect используется для выражения:
uk: Теперішній Доконаний Час використовується для вираження:

source: Actions Completed in the Recent Past with a Present Result:
ru: 1. Действия, завершенные в недавнем прошлом, с результатом в настоящем:
uk: Дії, Завершені У Недавньому Минулому З Результатом У Теперішньому Часі:

source: The action happened in the past, but its effect or consequence is still relevant or visible now. The exact time of the action is not important.
ru: Действие произошло в прошлом, но его эффект или следствие все еще актуально или видно сейчас. Точное время действия не важно.
uk: Дія відбулася в минулому, але її ефект або наслідок все ще актуальний або помітний зараз. Точний час дії не важливий.

source: Result: I don't have them now.
ru: Результат: У меня их сейчас нет.
uk: Результат: Зараз їх у мене немає.

source: Result: Her leg is still broken now.
ru: Результат: Ее нога все еще сломана сейчас.
uk: Результат: Її нога все ще зламана.

source: Result: We have no electricity now.
ru: Результат: У нас сейчас нет электричества.
uk: Результат: Зараз у нас немає електрики.

source: Experiences / Life Experiences:
ru: 2. Опыт / Жизненный опыт:
uk: Досвід / Життєвий Досвід:

source: Actions that happened at some point in a person's life up to the present. Often used with
ru: Действия, которые произошли в какой-то момент в жизни человека до настоящего времени. Часто используется с
uk: Дії, які відбулися в певний момент життя людини до теперішнього часу. Часто використовується з

source: in questions
ru: в вопросах
uk: у питаннях

source: Actions Started in the Past and Continuing to the Present:
ru: 3. Действия, начавшиеся в прошлом и продолжающиеся до настоящего момента:
uk: Дії, Що Розпочалися У Минулому І Тривають До Теперішнього Часу:

source: Used with
ru: Используется с
uk: Використовується з

source: duration
ru: длительность
uk: тривалість

source: starting point
ru: начальный момент
uk: початкова точка

source: to describe actions or states that began in the past and are still ongoing.
ru: для описания действий или состояний, которые начались в прошлом и до сих пор продолжаются.
uk: для опису дій або станів, які розпочалися в минулому і все ще тривають.

source: She still lives here.
ru: Она до сих пор здесь живет.
uk: Вона все ще тут живе.

source: They still know each other.
ru: Они до сих пор знают друг друга.
uk: Вони все ще знають одне одного.

source: Actions Completed in a Period of Time That Is Not Yet Finished:
ru: 4. Действия, завершенные в период времени, который еще не закончился:
uk: Дії, Завершені У Період Часу, Який Ще Не Закінчився:

source: Used with time expressions like
ru: Используется с временными выражениями, такими как
uk: Використовується з часовими виразами, такими як

source: Today is not over yet.
ru: Сегодня еще не закончилось.
uk: Сьогодні ще не закінчилося.

source: For actions completed a very short time ago.
ru: Для действий, завершенных очень короткое время назад.
uk: Для дій, завершених дуже короткий час тому.

source: For actions that happened sooner than expected.
ru: Для действий, которые произошли раньше, чем ожидалось.
uk: Для дій, які відбулися раніше, ніж очікувалося.

source: In negative sentences and questions, meaning \
ru: В отрицательных и вопросительных предложениях, означающее \
uk: У заперечних реченнях та питаннях, що означає \

source: Present Perfect vs. Past Simple
ru: Present Perfect против Past Simple
uk: Present Perfect проти Past Simple

source: A common point of confusion is when to use the Present Perfect versus the Past Simple.
ru: Частым источником путаницы является то, когда использовать Present Perfect, а когда Past Simple.
uk: Поширеною причиною плутанини є те, коли використовувати Present Perfect, а коли Past Simple.

source: Focuses on the <i>result</i> or <i>connection to the present</i>. The time is unspecified or ongoing.
ru: Акцент на ***результате*** или ***связи с настоящим***. Время не указано или период времени продолжается.
uk: Зосереджується на <i>результаті</i> або <i>зв'язку з теперішнім часом</i>. Час є невизначеним або триваючим.

source: I don't have them now - current result
ru: У меня их сейчас нет — текущий результат
uk: Зараз їх у мене немає — поточний результат

source: Focuses on the <i>action</i> itself, completed at a <i>specific time</i> in the past.
ru: Акцент на самом ***действии***, завершенном в ***определенное время*** в прошлом.
uk: Зосереджується на самій <i>дії</i>, завершеній у <i>певний час</i> у минулому.

source: The action happened yesterday, the focus is on the past event
ru: Действие произошло вчера, акцент на прошлом событии
uk: Дія сталася вчора, акцент на минулій події

source: If you mention a specific past time (e.g.,
ru: Если вы упоминаете конкретное прошедшее время (например,
uk: Якщо ви згадуєте конкретний минулий час (наприклад,

source: you must use the Past Simple. If the time is not specified or if the period of time is still ongoing, use the Present Perfect.
ru: вы должны использовать Past Simple. Если время не указано или период времени все еще продолжается, используйте Present Perfect.
uk: ви повинні використовувати Past Simple. Якщо час не вказано або якщо період часу все ще триває, використовуйте Present Perfect.

source: Understanding the nuances of the Present Perfect is essential for precise communication about past events and their ongoing impact.
ru: Понимание нюансов Present Perfect важно для точного общения о прошлых событиях и их продолжающемся влиянии.
uk: Розуміння нюансів Present Perfect є важливим для точного спілкування про минулі події та їхній поточний вплив.

source: Present Perfect Continuous
ru: Настоящее совершенное продолженное время (Present Perfect Continuous)
uk: Теперішній Доконано-Тривалий Час (Present Perfect Continuous)

source: Structure (Формула образования)
ru: Структура (Формула образования)
uk: Структура (Формула утворення)

source: This tense is formed using the auxiliary verb 'to have' in the Present Simple, the Past Participle of 'to be' (<span class=\
ru: Это время образуется с помощью вспомогательного глагола 'to have' в Present Simple, причастия прошедшего времени от 'to be' (<span class=\
uk: Цей час утворюється за допомогою допоміжного дієслова 'to have' у Present Simple, дієприкметника минулого часу від 'to be' (<span class=\

source: Formula: Subject + <span class=\
ru: Формула: Подлежащее + <span class=\
uk: Формула: Підмет + <span class=\

source: Conjugation Examples (Примеры спряжения):
ru: Примеры спряжения (Conjugation Examples):
uk: Приклади Дієвідмінювання (Приклади відмінювання):

source: Affirmative Sentence (Утверждение):
ru: Утвердительное предложение (Affirmative Sentence):
uk: Стверджувальне Речення (Твердження):

source: Negative Sentence (Отрицание):
ru: Отрицательное предложение (Negative Sentence):
uk: Заперечне Речення (Заперечення):

source: Formed by placing 'not' between <span class=\
ru: Образуется путем размещения 'not' между <span class=\
uk: Утворюється шляхом розміщення 'not' між <span class=\

source: Interrogative Sentence (Вопрос):
ru: Вопросительное предложение (Interrogative Sentence):
uk: Питальне Речення (Питання):

source: Formed by placing <span class=\
ru: Образуется путем размещения <span class=\
uk: Утворюється шляхом розміщення <span class=\

source: Usage Rules (Правила употребления)
ru: Правила употребления (Usage Rules)
uk: Правила Використання (Правила вживання)

source: Present Perfect Continuous is used primarily in two situations:
ru: Present Perfect Continuous используется в основном в двух ситуациях:
uk: Present Perfect Continuous використовується насамперед у двох ситуаціях:

source: Action from the past continuing up to the present
ru: 1. Действие из прошлого, продолжающееся до настоящего момента
uk: Дія з минулого, що продовжується до теперішнього часу

source: To describe an action that began at some point in the past and is still ongoing now. The focus is on the <span class=\
ru: Для описания действия, которое началось в какой-то момент в прошлом и до сих пор продолжается. Акцент делается на ***длительности*** <span class=\
uk: Для опису дії, яка розпочалася в певний момент у минулому і все ще триває зараз. Акцент робиться на <span class=\

source: They started ten years ago and still live here.
ru: Они начали десять лет назад и до сих пор здесь живут.
uk: Вони почали десять років тому і все ще живуть тут.

source: The action (trying to call) is still happening or has just stopped.
ru: Действие (попытка позвонить) все еще происходит или только что закончилось.
uk: Дія (спроба зателефонувати) все ще триває або щойно зупинилася.

source: Recent action with visible result in the present
ru: 2. Недавнее действие с видимым результатом в настоящем
uk: Нещодавня дія з видимим результатом у теперішньому часі

source: To describe an action that has recently finished, but the evidence or result of that action is clear in the present.
ru: Для описания действия, которое недавно закончилось, но доказательство или результат этого действия очевидны в настоящем.
uk: Для опису дії, яка нещодавно завершилася, але доказ або результат цієї дії чітко видно у теперішньому часі.

source: Crying (the action) is over, but red eyes (the result) are visible.
ru: Плач (действие) закончился, но красные глаза (результат) видны.
uk: Плач (дія) закінчився, але червоні очі (результат) видимі.

source: The rain has stopped, but the wet street is the result.
ru: Дождь закончился, но мокрая улица — это результат.
uk: Дощ припинився, але мокра вулиця – це результат.

source: Time Markers (Слова-маркеры)
ru: Слова-маркеры (Time Markers)
uk: Часові Маркери (Слова-маркери)

source: This tense is commonly used with the following time expressions, emphasizing the duration:
ru: Это время обычно используется со следующими временными выражениями, подчеркивающими длительность:
uk: Цей час зазвичай використовується з такими часовими виразами, що підкреслюють тривалість:

source: в течение какого-то времени
uk: протягом якогось часу

source: с какого-то момента
uk: з якогось моменту

source: весь день/неделю/год
uk: весь день/тиждень/рік

source: в последнее время
uk: останнім часом

source: Note: If the focus is on the <span class=\
ru: Примечание: Если акцент делается на **количестве** <span class=\
uk: Примітка: Якщо акцент робиться на <span class=\

source: The Present Simple
ru: Простое настоящее время (The Present Simple)
uk: Теперішній Простий Час (Present Simple)

source: Formation of the Present Simple
ru: Образование Present Simple
uk: Утворення Теперішнього Простого Часу

source: The formation of the Present Simple depends on the subject of the sentence.
ru: Образование Present Simple зависит от подлежащего предложения.
uk: Утворення Present Simple залежить від підмета речення.

source: For most verbs, you use the <span class=\
ru: Для большинства глаголов используется <span class=\
uk: Для більшості дієслів використовується <span class=\

source: Verb ending in
ru: Глагол, оканчивающийся на
uk: Дієслово, що закінчується на

source: Spelling Rules for Third Person Singular (-s / -es):
ru: Правила правописания для третьего лица единственного числа (-s / -es):
uk: Правила Правопису Для Третьої Особи Однини (-s / -es):

source: or -zz
ru: или -zz
uk: або -zz

source: add
ru: добавляем
uk: додайте

source: Verbs ending in a
ru: Глаголы, оканчивающиеся на
uk: Дієслова, що закінчуються на

source: consonant + y
ru: согласную + y
uk: приголосна + y

source: change
ru: меняют
uk: змініть

source: vowel + y
ru: гласную + y
uk: голосна + y

source: simply add
ru: просто добавляем
uk: просто додайте

source: To form negative sentences, we use the auxiliary verbs <span class=\
ru: Для образования отрицательных предложений мы используем вспомогательные глаголы <span class=\
uk: Для утворення заперечних речень ми використовуємо допоміжні дієслова <span class=\

source: To form questions, we use the auxiliary verbs <span class=\
ru: Для образования вопросов мы используем вспомогательные глаголы <span class=\
uk: Для утворення питань ми використовуємо допоміжні дієслова <span class=\

source: Question Form
ru: Вопросительная форма
uk: Форма Питання

source: Again, 'to be' and modal verbs form questions differently.
ru: Опять же, 'to be' и модальные глаголы образуют вопросы по-другому.
uk: Знову ж таки, 'to be' та модальні дієслова утворюють питання по-різному.

source: Uses of the Present Simple
ru: Использование Present Simple
uk: Використання Теперішнього Простого Часу

source: The Present Simple is used to express:
ru: Present Simple используется для выражения:
uk: Present Simple використовується для вираження:

source: Habitual Actions or Daily Routines:
ru: 1. Привычные действия или ежедневные рутины:
uk: Звичні Дії Або Щоденні Розпорядки:

source: Things that happen regularly or repeatedly.
ru: Вещи, которые происходят регулярно или повторяются.
uk: Речі, які відбуваються регулярно або повторюються.

source: Facts and Generalizations:
ru: 2. Факты и обобщения:
uk: Факти та Узагальнення:

source: Statements that are always true or widely accepted facts.
ru: Утверждения, которые всегда верны или общепринятые факты.
uk: Твердження, які завжди правдиві або загальновизнані факти.

source: Schedules and Timetables:
ru: 3. Расписания и графики:
uk: Розклади та Графіки:

source: Fixed future events, especially for public transport, cinema, classes, etc.
ru: Фиксированные будущие события, особенно для общественного транспорта, кинотеатров, занятий и т. д.
uk: Фіксовані майбутні події, особливо для громадського транспорту, кінотеатру, занять тощо.

source: Instructions or Directions:
ru: 4. Инструкции или указания:
uk: Інструкції або Вказівки:

source: Used to give commands or explain how to do something.
ru: Используется для отдачи команд или объяснения, как что-то делать.
uk: Використовується для надання команд або пояснення, як щось робити.

source: With Verbs of State (Stative Verbs):
ru: 5. С глаголами состояния (Stative Verbs):
uk: З Дієсловами Стану (Стативними Дієсловами):

source: Verbs that describe states rather than actions (e.g., emotions, possession, senses, opinions). These verbs are generally not used in continuous tenses.
ru: Глаголы, описывающие состояния, а не действия (например, эмоции, владение, чувства, мнения). Эти глаголы, как правило, не используются в продолженных временах.
uk: Дієслова, які описують стани, а не дії (наприклад, емоції, володіння, відчуття, думки). Ці дієслова зазвичай не використовуються у тривалих часах.

source: In Zero and First Conditional Sentences:
ru: 6. В нулевых и первых условных предложениях:
uk: В Умовних Реченнях Нульового та Першого Типу:

source: Zero Conditional (general truths):
ru: Нулевое условное (общие истины):
uk: Нульовий Умовний (загальні істини):

source: First Conditional (future possibility):
ru: Первое условное (будущая возможность):
uk: Перший Умовний (майбутня можливість):

source: Additional Rules and Nuances
ru: Дополнительные правила и нюансы
uk: Додаткові Правила та Нюанси

source: Position of Adverbs of Frequency:
ru: Позиция наречий частоты:
uk: Позиція Прислівників Частоти:

source: Adverbs like <strong>always, often, usually, sometimes, rarely, never</strong> are commonly used with the Present Simple. Their position depends on the type of verb.
ru: Наречия, такие как **always, often, usually, sometimes, rarely, never** (всегда, часто, обычно, иногда, редко, никогда), часто используются с Present Simple. Их позиция зависит от типа глагола.
uk: Прислівники, такі як <strong>always, often, usually, sometimes, rarely, never</strong> (завжди, часто, зазвичай, іноді, рідко, ніколи), зазвичай використовуються з Present Simple. Їхня позиція залежить від типу дієслова.

source: Before the main verb:
ru: Перед основным глаголом:
uk: Перед основним дієсловом:

source: Verbs of State vs. Verbs of Action:
ru: Глаголы состояния против глаголов действия:
uk: Дієслова Стану проти Дієслів Дії:
