Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Modifies rather than transforms
ru: Модифицирует, а не преобразует
uk: Модифікує, а не трансформує

source: Can modify different elements
ru: Может модифицировать разные элементы
uk: Може модифікувати різні елементи

source: Identification Tests
ru: Тесты на идентификацию
uk: Тести на ідентифікацію

source: Adverbs can often move; particles cannot:
uk: Прислівники часто можуть рухатися; частки не можуть:

source: 2. Meaning Test
uk: 2. Тест на значення

source: Does it create a new verb meaning?
uk: Чи створює це нове значення дієслова?

source: 3. Separation Test
uk: 3. Тест на розділення

source: Can it separate from the verb with an object?
uk: Чи може воно відокремитися від дієслова за допомогою доповнення?

source: Confusing separable particles with adverbs:
uk: Плутанина роздільних часток з прислівниками:

source: Misplacing adverbs in phrasal verbs:
uk: Неправильне розташування прислівників у фразових дієсловах:

source: Overlooking idiomatic meanings:
uk: Ігнорування ідіоматичних значень:

source: Particles vs. Prepositions
ru: Частицы против предлогов
uk: Частки проти прийменників

source: Particles vs. Prepositions: Key Differences
ru: Частицы против предлогов: Ключевые различия
uk: Частки проти прийменників: Ключові відмінності

source: Many words in English can function as both particles and prepositions, creating confusion for learners. Understanding their distinct roles is crucial for mastering phrasal verbs and sentence structure.
ru: Многие слова в английском языке могут функционировать как частицы и предлоги, что создает путаницу для обучающихся. Понимание их различных ролей имеет решающее значение для освоения фразовых глаголов и структуры предложения.
uk: Багато слів в англійській мові можуть функціонувати як частки, так і як прийменники, створюючи плутанину для тих, хто вивчає мову. Розуміння їхніх різних ролей є вирішальним для опанування фразових дієслів та структури речень.

source: 1. Particles in English
ru: 1. Частицы в английском языке
uk: 1. Частки в англійській мові

source: Particles are small words that combine with verbs to create phrasal verbs with new meanings. They don't take objects and are inseparable parts of the verb phrase.
ru: Частицы — это небольшие слова, которые сочетаются с глаголами для создания фразовых глаголов с новыми значениями. Они не принимают дополнений и являются неразрывными частями глагольной фразы.
uk: Частки — це маленькі слова, які поєднуються з дієсловами, щоб створити фразові дієслова з новим значенням. Вони не приймають доповнень і є невід'ємними частинами дієслівної фрази.

source: New meaning
uk: Нове значення

source: Modify or complete the meaning of the main verb
ru: Модифицируют или дополняют значение основного глагола
uk: Модифікують або доповнюють значення основного дієслова

source: Don't have their own objects (though the verb may have one)
ru: Не имеют своих собственных дополнений (хотя глагол может иметь таковое)
uk: Не мають власних доповнень (хоча дієслово може мати)

source: Often appear after the verb's object in transitive phrasal verbs
ru: Часто появляются после дополнения глагола в переходных фразовых глаголах
uk: Часто з'являються після доповнення дієслова у перехідних фразових дієсловах

source: Can be moved after the object in separable phrasal verbs
ru: Могут быть перемещены после дополнения в разделяемых фразовых глаголах
uk: Можуть бути переміщені після доповнення у роздільних фразових дієсловах

source: 2. Prepositions in English
ru: 2. Предлоги в английском языке
uk: 2. Прийменники в англійській мові

source: Prepositions show relationships between nouns/pronouns and other words in a sentence. They always have objects and indicate location, time, direction, etc.
ru: Предлоги показывают отношения между существительными/местоимениями и другими словами в предложении. Они всегда имеют дополнения и указывают местоположение, время, направление и т. д.
uk: Прийменники показують зв'язки між іменниками/займенниками та іншими словами у реченні. Вони завжди мають доповнення та вказують на місце, час, напрямок тощо.

source: Always followed by a noun/pronoun (the prepositional object)
ru: Всегда следуют за существительным/местоимением (предложным дополнением)
uk: Завжди супроводжуються іменником/займенником (прийменниковим доповненням)

source: Cannot be separated from their objects
ru: Не могут быть отделены от своих дополнений
uk: Не можуть бути відокремлені від своїх доповнень

source: Convey clear spatial, temporal, or logical relationships
ru: Передают четкие пространственные, временные или логические отношения
uk: Передають чіткі просторові, часові або логічні зв'язки

source: Comparative Analysis
ru: Сравнительный анализ
uk: Порівняльний аналіз

source: Relationship to Verb
ru: Отношение к глаголу
uk: Зв'язок з дієсловом

source: Forms phrasal verb with new meaning
ru: Образует фразовый глагол с новым значением
uk: Утворює фразове дієслово з новим значенням

source: Independent of verb
ru: Независим от глагола
uk: Незалежний від дієслова

source: Object Required
ru: Требуется дополнение
uk: Потрібне доповнення

source: No
ru: Нет
uk: Ні

source: Yes
ru: Да
uk: Так

source: Position Flexibility
ru: Гибкость позиции
uk: Гнучкість позиції

source: Can often move after object
ru: Часто может перемещаться после дополнения
uk: Часто може переміщатися після доповнення

source: Fixed before object
ru: Фиксирован перед дополнением
uk: Фіксований перед доповненням

source: Stress in Speech
ru: Ударение в речи
uk: Наголос у мовленні

source: Usually stressed
ru: Обычно ударный
uk: Зазвичай наголошений

source: Usually unstressed
ru: Обычно безударный
uk: Зазвичай ненаголошений

source: 3. Words That Can Be Both
ru: 3. Слова, которые могут быть и тем, и другим
uk: 3. Слова, які можуть бути обома

source: Many common words function as both particles and prepositions. Context determines their role in each sentence.
ru: Многие распространенные слова функционируют как частицы и предлоги. Контекст определяет их роль в каждом предложении.
uk: Багато поширених слів функціонують як частки, так і як прийменники. Контекст визначає їхню роль у кожному реченні.

source: Common Dual-Function Words:
uk: Поширені слова з подвійною функцією:

source: Contrastive Examples:
ru: Контрастные примеры:
uk: Контрастні приклади:

source: usage
uk: використання

source: Particle:
uk: Частка:

source: Preposition:
uk: Прийменник:

source: Practical Identification Tips
ru: Практические советы по идентификации
uk: Практичні поради щодо ідентифікації

source: Test 1: Object Movement
ru: Тест 1: Перемещение дополнения
uk: Тест 1: Рух доповнення

source: If the word can move after a pronoun object, it's a particle:
ru: Если слово может перемещаться после местоименного дополнения, это частица:
uk: Якщо слово може рухатися після доповнення-займенника, це частка:

source: Turn
uk: Увімкни

source: the light → Turn it
uk: світло → Увімкни його

source: Walk
uk: Йди

source: the hill → *Walk it
uk: вгору по пагорбу → *Йди його

source: Test 2: Question Formation
ru: Тест 2: Формирование вопросов
uk: Тест 2: Утворення запитань

source: Prepositional objects can become question subjects; particle objects cannot:
ru: Предложные объекты могут стать объектами вопросов; объекты частиц не могут:
uk: Прийменникові доповнення можуть ставати суб'єктами запитань; доповнення часток не можуть:

source: She sat
uk: Вона сиділа

source: the chair → What did she sit
uk: на стільці → На чому вона сиділа

source: She
uk: Вона

source: the light → *What did she turn
uk: світло → *Що вона увімкнула

source: Test 3: Stress Pattern
ru: Тест 3: Схема ударения
uk: Тест 3: Наголос

source: Particles are typically stressed in speech, while prepositions are unstressed:
ru: Частицы, как правило, ударны в речи, тогда как предлоги — безударны:
uk: Частки зазвичай наголошуються в мовленні, тоді як прийменники є ненаголошеними:

source: Please
uk: Будь ласка

source: the package.
uk: пакет.

source: The cat jumped
uk: Кіт стрибнув

source: the
ru: на
uk: на

source: Types of Particles
ru: Типы частиц
uk: Типи часток

source: Particles serve various grammatical functions in English. Understanding these types helps master sentence structure and meaning.
ru: Частицы выполняют различные грамматические функции в английском языке. Понимание этих типов помогает освоить структуру и значение предложений.
uk: Частки виконують різноманітні граматичні функції в англійській мові. Розуміння цих типів допомагає опанувати структуру речення та його значення.

source: 1. Infinitive Particle (<span class="
uk: 1. Частка інфінітива (<span class="

source: Marks the infinitive form of verbs, creating the 'to + verb' construction:
ru: Обозначает инфинитивную форму глаголов, создавая конструкцию 'to + глагол':
uk: Позначає інфінітивну форму дієслів, створюючи конструкцію 'to + дієслово':

source: Always precedes the base form of a verb
ru: Всегда предшествует основной форме глагола
uk: Завжди передує основній формі дієслова

source: Doesn't carry meaning on its own
ru: Не несет смысла сама по себе
uk: Не має власного значення

source: Essential for many verb constructions
ru: Необходима для многих глагольных конструкций
uk: Важлива для багатьох дієслівних конструкцій

source: Bare infinitives (without 'to') after modal verbs:
uk: Голі інфінітиви (без 'to') після модальних дієслів:

source: Split infinitives (adverbs between 'to' and verb):
uk: Розщеплені інфінітиви (прислівники між 'to' та дієсловом):

source: 2. Negative Particle (<span class="
uk: 2. Заперечна частка (<span class="

source: Creates negative statements by negating verbs or other elements:
ru: Создает отрицательные утверждения, отрицая глаголы или другие элементы:
uk: Створює заперечні висловлювання, заперечуючи дієслова або інші елементи:

source: Usage Patterns:
ru: Модели использования:
uk: Шаблони вживання:

source: After auxiliary verbs in standard negation
uk: Після допоміжних дієслів у стандартному запереченні

source: With non-auxiliary verbs (requires 'do' support)
uk: З неосновними дієсловами (вимагає підтримки 'do')

source: Contracted forms common in speech
uk: Скорочені форми поширені в усному мовленні

source: Positioning Rules:
ru: Правила расположения:
uk: Правила розташування:

source: Before main verbs with auxiliaries
uk: Перед основними дієсловами з допоміжними дієсловами

source: After 'to be' when it's the main verb
uk: Після 'to be', коли воно є основним дієсловом

source: 3. Phrasal Verb Particles
ru: 3. Частицы фразовых глаголов
uk: 3. Частки фразових дієслів

source: Combine with verbs to create new meanings, often idiomatic:
ru: Сочетаются с глаголами для создания новых значений, часто идиоматических:
uk: Поєднуються з дієсловами для створення нових значень, часто ідіоматичних:

source: Common Particles:
uk: Поширені частки:

source: Types of Phrasal Verbs:
ru: Типы фразовых глаголов:
uk: Типи фразових дієслів:

source: Intransitive
uk: Неперехідні

source: No direct object
uk: Без прямого доповнення

source: Transitive separable
uk: Перехідні роздільні

source: Object can separate verb and particle
uk: Доповнення може розділяти дієслово та частку

source: Transitive inseparable
uk: Перехідні нероздільні

source: Particle must stay with verb
uk: Частка повинна залишатися з дієсловом

source: 4. Discourse Particles
ru: 4. Дискурсивные частицы
uk: 4. Дискурсивні частки

source: Organize conversation flow and express attitudes:
ru: Организуют ход беседы и выражают отношение:
uk: Організовують потік розмови та виражають ставлення:

source: Common Functions:
ru: Общие функции:
uk: Поширені функції:

source: Hesitation markers:
uk: Маркери вагання:

source: Response signals:
uk: Сигнали відповіді:

source: Emphasis markers:
uk: Маркери наголосу:

source: Conversation managers:
uk: Керування розмовою:

source: Usage Notes:
ru: Примечания по использованию:
uk: Примітки щодо вживання:

source: More common in spoken than written English
ru: Более распространены в устной, чем в письменной речи
uk: Більш поширені в усному, ніж у письмовому мовленні

source: Often considered informal
ru: Часто считаются неформальными
uk: Часто вважаються неформальними

source: Vary significantly by dialect and region
ru: Значительно варьируются в зависимости от диалекта и региона
uk: Значно відрізняються залежно від діалекту та регіону

source: Help maintain conversational rhythm
ru: Помогают поддерживать ритм беседы
uk: Допомагають підтримувати ритм розмови

source: What is a Particle?
ru: Что такое частица?
uk: Що таке частка?

source: Uninflected:
uk: Незмінна:

source: Doesn't change form (no conjugation or declension)
uk: Не змінює форми (без відмінювання чи схиляння)

source: Grammatical function:
uk: Граматична функція:

source: Modifies or connects other words
uk: Модифікує або з'єднує інші слова

source: Small size:
uk: Невеликий розмір:

source: Typically one or two syllables
uk: Зазвичай один або два склади

source: Essential meaning:
uk: Важливе значення:

source: Often crucial to sentence structure
uk: Часто вирішальна для структури речення

source: Multi-functional:
uk: Багатофункціональна:

source: Can serve different purposes in different contexts
uk: Може виконувати різні функції в різних контекстах

source: Common Types of Particles
ru: Распространенные типы частиц
uk: Поширені типи часток

source: 1. Infinitive Marker
ru: 1. Маркер инфинитива
uk: 1. Маркер інфінітива

source: The word <span class="
uk: Слово <span class="

source: 2. Negative Particle
ru: 2. Отрицательная частица
uk: 2. Заперечна частка

source: Words that combine with verbs to create new meanings:
uk: Слова, які поєднуються з дієсловами для створення нових значень:

source: Words that organize conversation or add emphasis:
uk: Слова, які організовують розмову або додають наголос:

source: Why Particles Matter
ru: Почему частицы важны
uk: Чому частки важливі

source: Essential for phrasal verbs:
uk: Важливі для фразових дієслів:

source: Often change a verb's meaning completely
uk: Часто повністю змінюють значення дієслова

source: Create infinitives:
uk: Створюють інфінітиви:

source: Necessary for many verb constructions
uk: Необхідні для багатьох дієслівних конструкцій

source: Form negations:
uk: Утворюють заперечення:

source: Fundamental for negative statements
uk: Основоположні для заперечних висловлювань

source: Add nuance:
uk: Додають нюансу:

source: Convey subtle shades of meaning
uk: Передають тонкі відтінки значення

source: Particles vs. Other Parts of Speech
ru: Частицы против других частей речи
uk: Частки проти інших частин мови

source: Comparison
ru: Сравнение
uk: Порівняння

source: Similar Words
uk: Схожі слова

source: Modify verbs, no object required
uk: Модифікують дієслова, не вимагають доповнення

source: Require objects (on the table)
ru: Требуют дополнений (on the table - на столе)
uk: Вимагають доповнень (на столі)

source: Can't move freely in sentence
uk: Не можуть вільно пересуватися в реченні

source: Can often move (quickly ran/ran quickly)
ru: Часто могут перемещаться (quickly ran / ran quickly)
uk: Часто можуть пересуватися (швидко біг/біг швидко)

source: Don't connect clauses
ru: Не соединяют придаточные предложения
uk: Не з'єднують частини речення

source: Connect words/phrases/clauses
ru: Соединяют слова/фразы/придаточные предложения
uk: З'єднують слова/фрази/частини речення

source: A particle is a small, uninflected word that doesn't fit into traditional parts of speech. It plays a crucial grammatical or semantic role, often modifying the meaning of other words in a sentence.
ru: Частица — это небольшое, неизменяемое слово, которое не вписывается в традиционные части речи. Оно играет решающую грамматическую или смысловую роль, часто изменяя значение других слов в предложении.
uk: Частка — це невелике, незмінне слово, яке не вписується у традиційні частини мови. Воно відіграє вирішальну граматичну або смислову роль, часто модифікуючи значення інших слів у реченні.

source: Definition and Classification
ru: Определение и классификация
uk: Визначення та класифікація

source: Types of Particles (Infinitive, Negative, Phrasal, Discourse)
ru: Типы частиц (инфинитивные, отрицательные, фразовые, дискурсивные)
uk: Типи часток (Інфінітивна, Заперечна, Фразова, Дискурсивна)

source: Usage of Particles
ru: Использование частиц
uk: Вживання часток

source: Distinction from Other Parts of Speech
ru: Отличие от других частей речи
uk: Відмінність від інших частин мови

source: Prepositions: About, Above, and Below
ru: Предлоги: About, Above, и Below
uk: Прийменники: About, Above, and Below

source: About, Above, and Below
ru: About, Above, и Below
uk: About, Above та Below

source: Mastering About, Above, and Below
ru: Освоение About, Above, и Below
uk: Опанування About, Above та Below

source: These essential prepositions serve distinct functions in English, from discussing topics to describing spatial relationships. Understanding their nuances will significantly improve your precision in communication.
ru: Эти важные предлоги выполняют различные функции в английском языке, от обсуждения тем до описания пространственных отношений. Понимание их нюансов значительно улучшит вашу точность в общении.
uk: Ці важливі прийменники виконують різні функції в англійській мові, від обговорення тем до опису просторових зв'язків. Розуміння їхніх нюансів значно покращить вашу точність у спілкуванні.

source: 1. About: Topic and Approximation
ru: 1. About: Тема и приближение
uk: 1. About: Тема та наближення

source: Discussing Topics
ru: Обсуждение тем
uk: Обговорення тем

source: When introducing the subject of discussion, thought, or content:
ru: При представлении предмета обсуждения, мысли или содержания:
uk: При введенні предмета обговорення, думки або змісту:

source: Approximate Quantities
ru: Приблизительные количества
uk: Приблизна кількість

source: When indicating rough estimates or approximations:
ru: При указании грубых оценок или приближений:
uk: При зазначенні приблизних оцінок або наближень:

source: Be about to (imminent action):
uk: Be about to (неминуча дія):

source: How about (suggestions):
uk: How about (пропозиції):

source: 2. Above: Superior Position and Beyond
ru: 2. Above: Высшее положение и за пределами
uk: 2. Above: Вища позиція та за межами

source: Physical Position
ru: Физическое положение
uk: Фізичне положення

source: When something is at a higher level than something else, often without direct contact:
ru: Когда что-то находится на более высоком уровне, чем что-то другое, часто без прямого контакта:
uk: Коли щось знаходиться на вищому рівні, ніж щось інше, часто без прямого контакту:

source: Abstract Concepts
ru: Абстрактные концепции
uk: Абстрактні поняття

source: When referring to higher status, rank, or quality:
ru: При указании на более высокий статус, ранг или качество:
uk: При посиланні на вищий статус, ранг або якість:

source: Common Expressions
ru: Распространенные выражения
uk: Поширені вирази

source: Most importantly
uk: Найважливіше

source: Honest and legal
uk: Чесний та законний

source: Too good to be suspected
uk: Занадто гарний, щоб викликати підозру

source: 3. Below: Inferior Position and Under
ru: 3. Below: Низшее положение и под
uk: 3. Below: Нижча позиція та під

source: When something is at a lower level than something else, often without direct contact:
ru: Когда что-то находится на более низком уровне, чем что-то другое, часто без прямого контакта:
uk: Коли щось знаходиться на нижчому рівні, ніж щось інше, часто без прямого контакту:

source: When referring to lower status, rank, or quality:
ru: При указании на более низкий статус, ранг или качество:
uk: При посиланні на нижчий статус, ранг або якість:

source: Comparison with Under
ru: Сравнение с Under
uk: Порівняння з Under

source: Relative position (lower than)
uk: Відносне положення (нижче, ніж)

source: Directly beneath, covered by
uk: Безпосередньо під, покрито чимось

source: Back to Prepositions
ru: Назад к Предлогам
uk: Назад до Прийменників

source: Prepositions: After and Before
ru: Предлоги: After и Before
uk: Прийменники: After та Before

source: After and Before
ru: After и Before
uk: After та Before

source: Mastering After and Before
ru: Освоение After и Before
uk: Опанування After та Before

source: These essential temporal prepositions establish sequence relationships between events, actions, and time periods. Understanding their nuanced usage will significantly improve your temporal precision in English.
ru: Эти важные темпоральные предлоги устанавливают отношения последовательности между событиями, действиями и периодами времени. Понимание их тонкого использования значительно улучшит вашу точность во времени в английском языке.
uk: Ці важливі часові прийменники встановлюють послідовні зв'язки між подіями, діями та періодами часу. Розуміння їхнього нюансованого вживання значно покращить вашу часову точність в англійській мові.

source: After: Subsequent Events
ru: After: Последующие события
uk: After: Наступні події

source: Basic Temporal Usage
ru: Основное темпоральное использование
uk: Основне часове вживання

source: Indicates that something occurs later than another event or time:
ru: Указывает, что что-то происходит позже, чем другое событие или время:
uk: Вказує, що щось відбувається пізніше, ніж інша подія або час:

source: Special Constructions
ru: Специальные конструкции
uk: Спеціальні конструкції

source: After + -ing form:
uk: After + форма на -ing:

source: After + noun (time periods):
uk: After + іменник (періоди часу):

source: After + pronoun:
uk: After + займенник:

source: Despite what was thought
uk: Незважаючи на те, що думали

source: Repeatedly over time
uk: Багаторазово протягом часу

source: After something happened
uk: Після того, як щось трапилося

source: Before: Prior Events
ru: Before: Предшествующие события
uk: Before: Попередні події

source: Indicates that something occurs earlier than another event or time:
ru: Указывает, что что-то происходит раньше, чем другое событие или время:
uk: Вказує, що щось відбувається раніше, ніж інша подія або час:

source: Before + -ing form:
uk: Before + форма на -ing:

source: Before + noun (time periods):
uk: Before + іменник (періоди часу):

source: Before + pronoun:
uk: Before + займенник:

source: Positioning in Sentences
ru: Расположение в предложениях
uk: Розташування у реченнях

source: Initial Position
uk: Початкова позиція

source: Mid Position
uk: Середня позиція

source: Comparative Usage
ru: Сравнительное использование
uk: Порівняльне вживання

source: Time Sequence Visualization
ru: Визуализация последовательности времени
uk: Візуалізація часової послідовності

source: Confusing with 'afterwards' and 'beforehand':
uk: Плутанина з 'afterwards' та 'beforehand':

source: Using with present perfect:
uk: Вживання з теперішнім доконаним часом (present perfect):

source: With Other Time Expressions
ru: С другими выражениями времени
uk: З іншими часовими виразами

source: Soon after
uk: Незабаром після

source: Long before
uk: Задовго до

source: Immediately before
uk: Безпосередньо перед

source: Prepositions: Mastering At, On, and In
ru: Предлоги: Освоение At, On, и In
uk: Прийменники: Опанування At, On та In

source: At, On, and In
ru: At, On, и In
uk: At, On та In

source: The Hierarchy of At, On, and In
ru: Иерархия At, On, и In
uk: Ієрархія At, On та In
