Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: In English, some nouns have distinct forms to specify the gender of a person or an animal. These are known as <span class=\
ru: В английском языке некоторые существительные имеют разные формы для указания пола человека или животного. Они известны как <span class=\

source: While many of these pairs exist, modern English tends to favor gender-neutral terms (e.g., <span class=\
ru: Хотя многие из этих пар существуют, современный английский язык, как правило, предпочитает гендерно-нейтральные термины (например, <span class=\

source: Unlike many other languages, English nouns do not have grammatical gender. Instead, nouns have a <span class=\
ru: В отличие от многих других языков, английские существительные не имеют грамматического рода. Вместо этого существительные имеют <span class=\

source: These nouns refer to male persons or animals. They are typically replaced by the pronoun <span class=\
ru: Эти существительные относятся к мужчинам или животным мужского пола. Они обычно заменяются местоимением <span class=\

source: These nouns refer to female persons or animals. They are replaced by the pronoun <span class=\
ru: Эти существительные относятся к женщинам или животным женского пола. Они заменяются местоимением <span class=\

source: Many nouns in English are of a <span class=\
ru: Многие существительные в английском языке относятся к <span class=\

source: When the gender of a common noun is unknown, modern English often uses singular <span class=\
ru: Когда пол существительного общего рода неизвестен, в современном английском языке часто используется единственное <span class=\

source: Forming the plural of nouns that end in <span class=\
ru: Образование множественного числа существительных, оканчивающихся на <span class=\

source: The rule for nouns ending in <span class=\
ru: Правило для существительных, оканчивающихся на <span class=\

source: If a noun ends in a consonant + <span class=\
ru: Если существительное оканчивается на согласную + <span class=\

source: If a noun ends in a vowel + <span class=\
ru: Если существительное оканчивается на гласную + <span class=\

source: For nouns ending in
ru: Для существительных, оканчивающихся на

source: Many nouns ending in
ru: Многие существительные, оканчивающиеся на

source: Nouns of foreign origin and some common nouns only add
ru: Существительные иностранного происхождения и некоторые общие существительные добавляют только

source: Some nouns ending in
ru: Некоторые существительные, оканчивающиеся на

source: A prepositional phrase always has the following structure:
ru: Предложная фраза всегда имеет следующую структуру:

source: For a singular noun, add <span class=\
ru: Для существительного в единственном числе добавьте <span class=\

source: For a plural noun that ends in <span class=\
ru: Для существительного во множественном числе, которое оканчивается на <span class=\

source: For an irregular plural noun (not ending in <span class=\
ru: Для существительного с нерегулярным множественным числом (не оканчивающегося на <span class=\

source: For a singular noun ending in <span class=\
ru: Для существительного в единственном числе, оканчивающегося на <span class=\

source: For inanimate objects (things that are not alive), it is more common to use the preposition <span class=\
ru: Для неодушевленных предметов (вещей, которые не живы) чаще используется предлог <span class=\

source: However, using the <span class=\
ru: Однако использование <span class=\

source: If two or more people own something together, add <span class=\
ru: Если два или более человека владеют чем-то вместе, добавьте <span class=\

source: Unlike possessive pronouns (<span class=\
ru: В отличие от притяжательных местоимений (<span class=\

source: You do not use an article (a/an, the) before a possessive determiner.
ru: Вы не используете артикль (a/an, the) перед притяжательным определителем.

source: The majority of English nouns form their plural by adding either -s or -es.
ru: Большинство английских существительных образуют множественное число путем добавления либо -s, либо -es.

source: For most nouns, you simply add an -s to the end.
ru: Для большинства существительных вы просто добавляете -s в конец.

source: You add -es to nouns that end in s, ss, x, z, ch, or sh.
ru: Вы добавляете -es к существительным, которые оканчиваются на s, ss, x, z, ch или sh.

source: Linking verbs connect the subject to the subject complement. The most common linking verb is the verb to be.
ru: Глаголы-связки соединяют подлежащее с подлежащим дополнением. Самый распространенный глагол-связка — это глагол to be.

source: In questions, the subject often comes after a helping verb (e.g., is, are, do, does).
ru: В вопросах подлежащее часто стоит после вспомогательного глагола (например, is, are, do, does).

source: Nouns play a crucial role in sentences by performing actions or being affected by them. The main functions of a noun in a sentence are to act as the subject, the object, or the complement.
ru: Существительные играют решающую роль в предложениях, выполняя действия или испытывая их на себе. Основные функции существительного в предложении — выступать в качестве подлежащего, дополнения или комплемента.

source: A noun can also be the object of a preposition, which is the noun that follows a preposition (e.g., The cat slept under the table).
ru: Существительное также может быть дополнением предлога, то есть существительным, которое следует за предлогом (например, The cat slept under the table — Кошка спала под столом).

source: Collective nouns (e.g., team, family) can take a singular or plural verb.
ru: Собирательные существительные (например, team, family — команда, семья) могут принимать глагол в единственном или множественном числе.

source: When two or more subjects are joined by and, use a plural verb.
ru: Когда два или более подлежащих соединены and (и), используйте глагол во множественном числе.

source: When subjects are joined by or or nor, the verb agrees with the noun closer to it.
ru: Когда подлежащие соединены or (или) или nor (ни), глагол согласуется с существительным, которое стоит ближе к нему.

source: Some nouns in English have the same form for both the singular and the plural. These are often called zero plurals.
ru: Некоторые существительные в английском языке имеют одинаковую форму как для единственного, так и для множественного числа. Их часто называют нулевым множественным числом.

source: While fish is the common zero plural, the plural form fishes can be used when referring to different species of fish.
ru: В то время как fish является распространенным нулевым множественным числом, форма множественного числа fishes может использоваться при упоминании разных видов рыб.

source: Cardinal Numerals Functioning as Nouns
ru: Количественные числительные, функционирующие как существительные

source: Don't use articles with these plural forms: <strike>a hundreds</strike> → hundreds
ru: Не используйте артикли с этими формами множественного числа: <strike>a hundreds</strike> → hundreds

source: These forms imply approximation - for exact counts, use the adjective form: one hundred employees.
ru: Эти формы подразумевают приблизительное количество — для точного подсчета используйте форму прилагательного: one hundred employees (сто сотрудников).

source: Cardinal numerals (also known as cardinal numbers) are words that represent specific quantities. They answer the question 'How many?'
ru: Количественные числительные (также известные как cardinal numbers) — это слова, которые обозначают конкретные количества. Они отвечают на вопрос 'Сколько?'

source: Base + suffix -teen
ru: Основа + суффикс -teen

source: -teen numbers have stress on the last syllable: thir<**teen**>
ru: Числа с -teen имеют ударение на последнем слоге: thir<**teen**>

source: Tens numbers have stress on the first syllable: <**for**>ty
ru: Числа десятков имеют ударение на первом слоге: <**for**>ty

source: In compound numbers (21-99), both parts are stressed: <**twenty**>-<**one**>
ru: В составных числах (21–99) обе части ударны: <**twenty**>-<**one**>

source: Using plural forms incorrectly: <strike>threes hundred</strike>
ru: Неправильное использование форм множественного числа: <strike>threes hundred</strike>

source: Forgetting hyphens in compound numbers: <strike>twenty one</strike>
ru: Забывание дефисов в составных числах: <strike>twenty one</strike>

source: Using 'and' incorrectly in American English: <strike>one hundred and fifty</strike>
ru: Неправильное использование 'and' (и) в американском английском: <strike>one hundred and fifty</strike>

source: Use degrees Fahrenheit or Celsius
ru: Используйте градусы по Фаренгейту или Цельсию

source: Always use the definite article the before an ordinal used as a noun.
ru: Всегда используйте определенный артикль the перед порядковым числительным, используемым как существительное.

source: When the noun is expressed, ordinals function as adjectives: the sixth book.
ru: Когда существительное выражено, порядковые числительные функционируют как прилагательные: the sixth book (шестая книга).

source: For dates, the definite article is often omitted in speech but implied.
ru: Для дат определенный артикль часто опускается в речи, но подразумевается.

source: Competitions: three first-place winners
ru: Соревнования: three first-place winners (три победителя, занявших первое место)

source: Sports: five second-place finishes
ru: Спорт: five second-place finishes (пять финишей на втором месте)

source: 30 minutes: never half to
ru: 30 минут: никогда half to

source: In formal writing, always use figures with am or pm.
ru: В формальном письме всегда используйте цифры с am или pm.

source: British English sometimes uses 20.00 hours instead of 8:00 pm.
ru: Британский английский иногда использует 20.00 hours вместо 8:00 pm.

source: For 12:00, specify noon or midnight to avoid confusion.
ru: Для 12:00 указывайте noon (полдень) или midnight (полночь), чтобы избежать путаницы.

source: In the 24-hour system, no AM/PM is needed: 14:30.
ru: В 24-часовой системе AM/PM не требуется: 14:30.

source: Ordinal numerals indicate position or order in a sequence, answering the question 'Which one?'
ru: Порядковые числительные указывают на позицию или порядок в последовательности, отвечая на вопрос 'Который?'

source: Country codes are read as separate digits: zero-four-four
ru: Коды стран читаются как отдельные цифры: zero-four-four (ноль-четыре-четыре)

source: Credit cards: read in groups of 4 digits
ru: Кредитные карты: читаются группами по 4 цифры

source: Passport numbers: letters then digits
ru: Номера паспортов: буквы, затем цифры

source: Serial numbers: read each character separately
ru: Серийные номера: читается каждый символ по отдельности

source: Say 'and' between the whole number and the fraction
ru: Произнесите 'and' (и) между целым числом и дробью

source: March the fifteenth
ru: March the fifteenth (Пятнадцатое марта)

source: not March five
ru: не March five (Пятое марта)

source: Never use the as 'the 1990s'
ru: Никогда не используйте the как 'the 1990s'

source: For years 2001-2009, always use 'two thousand and...'
ru: Для годов 2001-2009 всегда используйте 'two thousand and...'

source: In formal writing, always write dates with the year: March 15, 2024.
ru: В официальном письме всегда пишите даты с годом: March 15, 2024 (15 марта 2024 года).

source: When writing dates numerically, remember the format differences: US 3/15/2024 vs. UK 15/3/2024.
ru: При написании дат цифрами помните о различиях в формате: US 3/15/2024 (США) vs. UK 15/3/2024 (Великобритания).

source: Special case (never one-second)
ru: Особый случай (никогда one-second)

source: Chicago
ru: Чикагский стиль

source: AP Style
ru: Стиль Ассошиэйтед Пресс

source: For most numbers, add '-th' to the cardinal number
ru: К большинству чисел добавьте '-th' к количественному числительному

source: Numbers ending in 'y' change 'y' to 'ie' before adding '-th'
ru: Числа, оканчивающиеся на 'y', меняют 'y' на 'ie' перед добавлением '-th'

source: In formal writing, spell out ordinals under 10: third chapter
ru: В официальном письме пишите прописью порядковые числительные до 10: third chapter (третья глава)

source: Use numerals with suffixes for dates and rankings: 1st place, May 22nd
ru: Используйте цифры с суффиксами для дат и рейтингов: 1st place (1-е место), May 22nd (22 мая)

source: Superscripts are acceptable in informal contexts: 1^st, 2^nd
ru: Верхние индексы приемлемы в неофициальных контекстах: 1^st, 2^nd

source: Incorrect double ordinalization in compounds:
ru: Неправильное двойное образование порядкового числительного в составных числах:

source: Never take plural form in this role: seven days
ru: Никогда не принимают форму множественного числа в этой роли: seven days (семь дней)

source: How many do you need? I need seven.
ru: Сколько тебе нужно? Мне нужно семь.

source: She bought twelve apples but only needed two.
ru: Она купила двенадцать яблок, но ей понадобилось только два.

source: Referring to the numbers themselves: All the tens are missing.
ru: При ссылке на сами числа: Все десятки (числа 10) отсутствуют.

source: All the tens are missing.
ru: Все десятки отсутствуют.

source: Referring to decades: The 1990s
ru: При ссылке на десятилетия: 1990-е годы

source: Referring to age groups: This game is popular with sixes and sevens.
ru: При ссылке на возрастные группы: Эта игра популярна среди шестилетних и семилетних.

source: This game is popular with sixes and sevens.
ru: Эта игра популярна среди шестилеток и семилеток.

source: Referring to playing cards or dice: He rolled three sixes.
ru: При ссылке на игральные карты или кости: Он выбросил три шестерки.

source: He rolled three sixes.
ru: Он выбросил три шестерки.

source: General counting: hundreds of people
ru: Общий счет: сотни людей

source: Referring to digits: Write out your ones, tens, and hundreds.
ru: При ссылке на разряды: Запишите разряды единиц, десятков и сотен.

source: Approximate quantities: thousands of stars
ru: Приблизительные количества: тысячи звезд

source: Hyphenated compound adjectives: a five-meter cable
ru: Прилагательные, образованные с помощью дефиса: five-meter cable (пятиметровый кабель)

source: Non-hyphenated when not modifying a noun: the cable is five meters long
ru: Без дефиса, когда не определяют существительное: the cable is five meters long (кабель имеет длину пять метров)

source: adjective: a six-foot man
ru: прилагательное: a six-foot man (шестифутовый мужчина)

source: noun: he is six feet tall
ru: существительное: he is six feet tall (его рост шесть футов)

source: Singular form for exact amounts: fifty dollars
ru: Единственное число для точных сумм: fifty dollars (пятьдесят долларов)

source: Plural for approximate amounts: hundreds of dollars
ru: Множественное число для приблизительных сумм: hundreds of dollars (сотни долларов)

source: Special forms for some currencies: fifty pence
ru: Особые формы для некоторых валют: fifty pence (пятьдесят пенсов)

source: One is never pluralized
ru: One (один) никогда не образует множественного числа

source: Zero has two plural forms
ru: Zero (ноль) имеет две формы множественного числа

source: mathematics: zero
ru: математика: zero

source: general usage: zeros or zeroes
ru: общее употребление: zeros или zeroes

source: Collective numbers have fixed forms: a dozen eggs
ru: Собирательные числительные имеют фиксированные формы: a dozen eggs (дюжина яиц)

source: when approximate: dozens of eggs
ru: когда приблизительно: dozens of eggs (дюжины яиц)

source: Age description: She's in her twenties.
ru: Описание возраста: She's in her twenties (Ей около двадцати).

source: Sports scores: The final score was six-nill.
ru: Спортивные счета: The final score was six-nill (Финальный счет был шесть-ноль).

source: Mathematical operations: Five multiplied by two equals ten.
ru: Математические операции: Five multiplied by two equals ten (Пять, умноженное на два, равно десяти).

source: Used in most contexts
ru: Используется в большинстве контекстов

source: Used when referring to one of a series
ru: Используется при ссылке на один из серии

source: Specific position: the second time
ru: Конкретная позиция: the second time (второй раз)

source: Another in sequence: a second chance
ru: Другой в последовательности: a second chance (второй шанс)

source: Superlatives: the last chapter
ru: Превосходная степень: the last chapter (последняя глава)

source: Approximation: a third of the votes
ru: Приближение: a third of the votes (треть голосов)

source: Floors, dates, surfaces: on the first floor
ru: Этажи, даты, поверхности: on the first floor (на первом этаже)

source: Physical location: on the third day
ru: Физическое расположение: on the third day (на третий день)

source: Centuries, periods: in the twenty-first century
ru: Века, периоды: in the twenty-first century (в двадцать первом веке)

source: Time periods: in the first month
ru: Периоды времени: in the first month (в первый месяц)

source: Sequences, groups: one of the fifth group
ru: Последовательности, группы: one of the fifth group (один из пятой группы)

source: Partitive meaning: one of the five
ru: Разделительное значение: one of the five (один из пяти)

source: Specific points: at the second stop
ru: Конкретные точки: at the second stop (на второй остановке)

source: Precise locations: at the turn of the century
ru: Точные места: at the turn of the century (на рубеже века)

source: Deadlines: by the second of June
ru: Сроки: by the second of June (ко второму июня)

source: Time limits: by the fifth hour
ru: Ограничения по времени: by the fifth hour (к пятому часу)

source: Omitting 'the' with ordinals: He was the third person.
ru: Опущение 'the' с порядковыми числительными: He was the third person (Он был третьим человеком).

source: Confusing 'in' and 'on' with dates: on the tenth of May
ru: Путаница 'in' и 'on' с датами: on the tenth of May (десятого мая)

source: Misusing articles with proper nouns: World War II, not the World War II
ru: Неправильное использование артиклей с именами собственными: World War II (Вторая мировая война), не the World War II

source: Special cases without articles: first position, adverbial usage
ru: Особые случаи без артиклей: first position (первая позиция), adverbial usage (наречное использование)

source: position: first priority
ru: позиция: first priority (первый приоритет)

source: adverbial: He came first
ru: наречное: He came first (Он пришел первым)

source: British Monarch: Elizabeth II
ru: Британский монарх: Elizabeth II

source: Pope: John Paul II
ru: Папа: John Paul II

source: European Monarch: Louis XIV
ru: Европейский монарх: Louis XIV

source: First of name: Typically written without numeral but spoken as 'the First'
ru: Первый с таким именем: Обычно пишется без цифры, но произносится как 'the First' (Первый)

source: Current monarchs: Spoken without ordinal until their reign ends (e.g., 'King Charles')
ru: Нынешние монархи: Произносятся без порядкового числительного до окончания их правления (например, 'King Charles' - Король Карл)

source: Regnal numbers: Reset for different countries (Elizabeth II was only first Elizabeth of UK, not Scotland)
ru: Порядковые номера правления: Сбрасываются для разных стран (Елизавета II была только первой Елизаветой Великобритании, но не Шотландии)

source: Cultural and Historical References: Henry VIII or the Eighth
ru: Культурные и исторические ссылки: Henry VIII (Генрих VIII) или the Eighth (Восьмой)

source: English king: William III, the third
ru: Английский король: William III (Вильгельм III), the third (Третий)

source: common for movies: Star Wars IV
ru: распространено для фильмов: Star Wars IV (Звездные войны IV)

source: tech products: iPhone 15
ru: технологические продукты: iPhone 15

source: books/legal: Article V
ru: книги/юридические документы: Article V (Статья V)

source: With family names: George Smith IV (spoken as 'the fourth')
ru: С фамилиями: George Smith IV (произносится как 'the fourth' - Четвертый)

source: For centuries: the 20th century (spoken as 'the twentieth')
ru: Для веков: the 20th century (произносится как 'the twentieth' - двадцатый)

source: Never read Roman numerals as cardinals: <strike>Elizabeth Two</strike> → Elizabeth the Second
ru: Никогда не читайте римские цифры как количественные: <strike>Elizabeth Two</strike> → Elizabeth the Second (Елизавета Вторая)

source: For popes, always use ordinal even if numeral isn't present: Pope Francis the First
ru: Для пап всегда используйте порядковое числительное, даже если цифра не указана: Pope Francis the First (Папа Франциск Первый)

source: In American usage, family generations often use suffixes (Jr., Sr.) instead of ordinals
ru: В американском употреблении для семейных поколений часто используются суффиксы (Jr., Sr.) вместо порядковых числительных

source: Always ordinal with 'the': Charles the Third
ru: Всегда порядковое числительное с 'the': Charles the Third (Карл Третий)

source: Cardinal number used: Louis Seize (Louis XVI)
ru: Используется количественное числительное: Louis Seize (Людовик Шестнадцатый)

source: Ordinal with article: Karl der Vierte (Charles IV)
ru: Порядковое числительное с артиклем: Karl der Vierte (Карл Четвертый)

source: Maintain speech flow during pauses: um, uh, well
ru: Поддерживают поток речи во время пауз: um, uh, well

source: Express speaker's perspective: like, maybe, seriously
ru: Выражают точку зрения говорящего: like, maybe, seriously

source: Acknowledge or continue conversation: right, yeah, so
ru: Подтверждают или продолжают разговор: right, yeah, so

source: Topic Shift: So, anyway
ru: Смена темы: So, anyway (Итак, в любом случае)

source: Agreement: Right, yeah
ru: Согласие: Right, yeah (Правильно, да)

source: Formal contexts: Limit discourse markers to more neutral ones
ru: Формальные контексты: Ограничьте дискурсивные маркеры более нейтральными

source: Informal speech: More markers and fillers are acceptable
ru: Неформальная речь: Больше маркеров и заполнителей допустимо

source: Cultural variations: Some markers are region-specific
ru: Культурные различия: Некоторые маркеры являются региональными

source: Overuse: Too many markers can make speech sound uncertain
ru: Чрезмерное использование: Слишком много маркеров может придать речи неуверенный оттенок

source: Inappropriate formality: Using casual markers in formal writing
ru: Неуместная формальность: Использование разговорных маркеров в формальном письме

source: Non-native usage: Misusing culturally specific markers
ru: Неправильное использование носителем другого языка: Неправильное использование культурно специфических маркеров

source: The particle 'to' is used to form the full infinitive, which is the base form of a verb.
ru: Частица 'to' используется для образования полного инфинитива, который является базовой формой глагола.

source: Unconjugated: Doesn't change for tense or subject
ru: Неспрягаемый: Не меняется по времени или субъекту

source: Non-finite: Doesn't indicate time by itself
ru: Неличный: Сам по себе не указывает время

source: Versatile: Can function as noun, adjective, or adverb
ru: Универсальный: Может функционировать как существительное, прилагательное или наречие

source: Many verbs require an infinitive complement: agree, decide, expect
ru: Многие глаголы требуют инфинитивного дополнения: agree (соглашаться), decide (решать), expect (ожидать)

source: Expressing purpose or reaction: happy, easy, difficult
ru: Выражение цели или реакции: happy (счастливый), easy (легкий), difficult (сложный)

source: Answering 'why' questions: I came to help.
ru: Ответ на вопрос 'почему': I came to help (Я пришел помочь).

source: Full Infinitive: to run
ru: Полный инфинитив: to run (бежать)

source: Bare Infinitive: run
ru: Голый инфинитив: run (бежать)
