Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: The placement of comparative adverbs affects meaning and emphasis:
ru: Расположение сравнительных наречий влияет на значение и выделение:
uk: Розміщення порівняльних прислівників впливає на значення та наголос:

source: Effect
ru: Эффект/Воздействие
uk: Ефект

source: After verb
ru: После глагола
uk: Після дієслова

source: Standard comparison
ru: Стандартное сравнение
uk: Стандартне порівняння

source: Beginning
ru: Начало
uk: На початку

source: Emphasizes speed/surprise
ru: Подчеркивает скорость/удивление
uk: Наголошує на швидкості/несподіванці

source: With 'than'
ru: С 'than'
uk: З 'than'

source: Direct comparison between two
ru: Прямое сравнение между двумя
uk: Пряме порівняння між двома

source: With 'the'
ru: С 'the'
uk: З 'the'

source: Superlative comparison among many
ru: Превосходное сравнение среди многих
uk: Найвище порівняння серед багатьох

source: Adverbs: General Positions
ru: Наречия: Общие позиции
uk: Прислівники: Загальні позиції

source: General Positions
ru: Общие позиции
uk: Загальні позиції

source: Adverb Positions in Sentences
ru: Позиции наречий в предложениях
uk: Позиції прислівників у реченнях

source: Adverbs can appear in three main positions within a sentence: front (beginning), mid (middle), and end (final). Each position serves different communicative purposes and follows specific grammatical rules.
ru: Наречия могут появляться в трех основных позициях в предложении: фронтальной (начало), средней (середина) и конечной (конец). Каждая позиция служит различным коммуникативным целям и подчиняется определенным грамматическим правилам.
uk: Прислівники можуть стояти в трьох основних позиціях у реченні: передня (на початку), середня (у середині) та кінцева (в кінці). Кожна позиція слугує різним комунікативним цілям і дотримується конкретних граматичних правил.

source: 1. Front Position (Sentence-Initial)
ru: 1. Фронтальная позиция (В начале предложения)
uk: 1. Передня позиція (на початку речення)

source: Placing an adverb at the beginning of a sentence creates emphasis or provides a transition between ideas. This position is common for:
ru: Размещение наречия в начале предложения создает акцент или обеспечивает переход между идеями. Эта позиция характерна для:
uk: Розміщення прислівника на початку речення створює наголос або забезпечує перехід між ідеями. Ця позиція поширена для:

source: Common Adverb Types in Front Position:
ru: Распространенные типы наречий во фронтальной позиции:
uk: Поширені типи прислівників у передній позиції:

source: Special Rules:
ru: Особые правила:
uk: Особливі правила:

source: When front-position adverbs modify the entire sentence, they're usually followed by a comma
ru: Когда наречия во фронтальной позиции определяют/изменяют все предложение, за ними обычно следует запятая
uk: Коли прислівники в передній позиції модифікують усе речення, за ними зазвичай ставиться кома

source: Negative adverbs in front position often require subject-verb inversion
ru: Отрицательные наречия во фронтальной позиции часто требуют инверсии подлежащего и сказуемого
uk: Негативні прислівники в передній позиції часто вимагають інверсії підмета-присудка

source: 2. Mid Position (Verb-Related)
ru: 2. Средняя позиция (Связанная с глаголом)
uk: 2. Середня позиція (пов’язана з дієсловом)

source: The middle position provides information about the verb without drawing special attention. Key placement rules:
ru: Средняя позиция предоставляет информацию о глаголе, не привлекая особого внимания. Ключевые правила размещения:
uk: Середня позиція надає інформацію про дієслово, не привертаючи особливої уваги. Ключові правила розміщення:

source: Detailed Placement Rules:
ru: Подробные правила размещения:
uk: Детальні правила розміщення:

source: Verb Type
ru: Тип глагола
uk: Тип дієслова

source: Adverb Position
ru: Позиция наречия
uk: Позиція прислівника

source: Simple present/past
ru: Простое настоящее/прошедшее
uk: Простий теперішній/минулий час

source: After the verb
ru: После глагола
uk: Після дієслова

source: With auxiliary verbs
ru: Со вспомогательными глаголами
uk: З допоміжними дієсловами

source: After first auxiliary
ru: После первого вспомогательного
uk: Після першого допоміжного дієслова

source: With 'to be'
ru: С 'to be'
uk: З 'to be'

source: Common Mid-Position Adverbs:
ru: Распространенные наречия в средней позиции:
uk: Поширені прислівники в середній позиції:

source: Frequency adverbs: always, usually, often, sometimes, rarely, never
ru: Наречия частоты: always, usually, often, sometimes, rarely, never (всегда, обычно, часто, иногда, редко, никогда)
uk: Прислівники частоти: always, usually, often, sometimes, rarely, never

source: Degree adverbs: almost, hardly, just, nearly
ru: Наречия степени: almost, hardly, just, nearly (почти, едва ли, только что, почти)
uk: Прислівники ступеня: almost, hardly, just, nearly

source: Certainty adverbs: certainly, definitely, probably
ru: Наречия уверенности: certainly, definitely, probably (безусловно, определенно, вероятно)
uk: Прислівники впевненості: certainly, definitely, probably

source: 3. End Position (Sentence-Final)
ru: 3. Конечная позиция (В конце предложения)
uk: 3. Кінцева позиція (в кінці речення)

source: The most neutral and common position for adverbs, especially those providing details about manner, place, and definite time.
ru: Наиболее нейтральная и распространенная позиция для наречий, особенно тех, которые предоставляют детали об образе действия, месте и определенном времени.
uk: Найбільш нейтральна та поширена позиція для прислівників, особливо тих, що надають деталі про спосіб дії, місце та певний час.

source: Standard Order for Multiple End-Position Adverbs:
ru: Стандартный порядок для нескольких наречий в конечной позиции:
uk: Стандартний порядок для кількох прислівників у кінцевій позиції:

source: Example with Multiple Adverbs:
ru: Пример с несколькими наречиями:
uk: Приклад з кількома прислівниками:

source: Special Cases and Exceptions
ru: Особые случаи и исключения
uk: Особливі випадки та винятки

source: 1. Adverbs That Change Meaning by Position
ru: 1. Наречия, которые меняют значение в зависимости от позиции
uk: 1. Прислівники, що змінюють значення залежно від позиції

source: Front/Mid Position Meaning
ru: Значение во фронтальной/средней позиции
uk: Значення у передній/середній позиції

source: End Position Meaning
ru: Значение в конечной позиции
uk: Значення у кінцевій позиції

source: Emphasizes exclusivity
ru: Подчеркивает исключительность
uk: Наголошує на виключності

source: Modifies the nearest word
ru: Модифицирует ближайшее слово
uk: Модифікує найближче слово

source: Recently or barely
ru: Недавно или едва ли
uk: Нещодавно або ледь

source: Exactly or merely
ru: Точно или просто
uk: Точно або лише

source: 2. Adverbs That Can't Appear in Mid Position
ru: 2. Наречия, которые не могут стоять в средней позиции
uk: 2. Прислівники, які не можуть стояти в середній позиції

source: Adverbs of place: here, there, everywhere
ru: Наречия места: here, there, everywhere (здесь, там, везде)
uk: Прислівники місця: here, there, everywhere

source: Adverbs of definite time: yesterday, tomorrow, at 5pm
ru: Наречия определенного времени: yesterday, tomorrow, at 5pm (вчера, завтра, в 17:00)
uk: Прислівники певного часу: yesterday, tomorrow, at 5pm

source: Adverb Order When Multiple Adverbs Appear
ru: Порядок наречий, когда их несколько
uk: Порядок прислівників, коли їх кілька

source: When using multiple adverbs in end position, they typically follow this sequence:
ru: При использовании нескольких наречий в конечной позиции они обычно следуют такой последовательности:
uk: При використанні кількох прислівників у кінцевій позиції вони зазвичай дотримуються такої послідовності:

source: Order
ru: Порядок
uk: Порядок

source: Adverb Type
ru: Тип наречия
uk: Тип прислівника

source: Manner
ru: Образ действия
uk: Спосіб дії

source: Place
ru: Место
uk: Місце

source: Time
ru: Время
uk: Час

source: Connective Adverbs: Interrogative, Relative, and Conjunctive
ru: Соединительные наречия: вопросительные, относительные и конъюнктивные
uk: Сполучні прислівники: питальні, відносні та сполучні

source: These specialized adverbs serve crucial functions in forming questions, connecting ideas, and establishing relationships between clauses in complex sentences.
ru: Эти специализированные наречия выполняют ключевые функции в постановке вопросов, соединении идей и установлении связей между клаузами в сложных предложениях.
uk: Ці спеціалізовані прислівники виконують вирішальні функції у формуванні питань, зв’язуванні ідей та встановленні зв’язків між реченнями у складних реченнях.

source: 1. Interrogative Adverbs
ru: 1. Вопросительные наречия
uk: 1. Питальні прислівники

source: Forming Information Questions
ru: Формирование информационных вопросов
uk: Формування інформаційних питань

source: Example Questions
ru: Примеры вопросов
uk: Приклади питань

source: Possible Answers
ru: Возможные ответы
uk: Можливі відповіді

source: Asks about place
ru: Спрашивает о месте
uk: Запитує про місце

source: In Paris
ru: В Париже
uk: У Парижі

source: Asks about time
ru: Спрашивает о времени
uk: Запитує про час

source: At 3:15 PM
ru: В 15:15
uk: О 15:15

source: Asks about reason
ru: Спрашивает о причине
uk: Запитує про причину

source: Because I'm happy
ru: Потому что я счастлив
uk: Тому що я щасливий

source: Asks about manner/condition
ru: Спрашивает об образе действия/условии
uk: Запитує про спосіб дії/умову

source: By thinking creatively
ru: Благодаря творческому мышлению
uk: Шляхом творчого мислення

source: Special Interrogative Forms
ru: Особые вопросительные формы
uk: Спеціальні питальні форми

source: For specific qualities
ru: Для конкретных качеств
uk: Для конкретних якостей

source: Informal alternative to 'why'
ru: Неформальная альтернатива 'why'
uk: Неформальна альтернатива 'why'

source: 2. Relative Adverbs
ru: 2. Относительные наречия
uk: 2. Відносні прислівники

source: Connecting Clauses to Nouns
ru: Соединение клауз с существительными
uk: З’єднання речень з іменниками

source: Example Sentences
ru: Примеры предложений
uk: Приклади речень

source: Noun Being Modified
ru: Модифицируемое существительное
uk: Іменник, що модифікується

source: Refers to place
ru: Относится к месту
uk: Відноситься до місця

source: Refers to time
ru: Относится ко времени
uk: Відноситься до часу

source: Refers to reason
ru: Относится к причине
uk: Відноситься до причини

source: Alternative Structures
ru: Альтернативные структуры
uk: Альтернативні структури

source: Preposition + which:
ru: Предлог + which:
uk: Прийменник + which:

source: That or omission:
ru: That или опущение:
uk: That або пропуск:

source: 3. Conjunctive Adverbs
ru: 3. Конъюнктивные наречия
uk: 3. Сполучні прислівники

source: Linking Independent Clauses
ru: Соединение независимых клауз
uk: З’єднання незалежних речень

source: Relationship
ru: Отношение/Связь
uk: Зв’язок

source: Common Adverbs
ru: Распространенные наречия
uk: Поширені прислівники

source: Punctuation
ru: Пунктуация
uk: Пунктуація

source: Addition
ru: Добавление
uk: Додавання

source: Contrast
ru: Контраст
uk: Контраст

source: Cause/Effect
ru: Причина/Следствие
uk: Причина/Наслідок

source: Flexible Positioning
ru: Гибкое позиционирование
uk: Гнучке розміщення

source: Between sentences:
ru: Между предложениями:
uk: Між реченнями:

source: Within sentences:
ru: Внутри предложений:
uk: Всередині речень:

source: Parenthetical use:
ru: Использование в качестве вводной конструкции:
uk: У дужках:

source: Common Errors and Special Notes
ru: Распространенные ошибки и особые примечания
uk: Поширені помилки та особливі примітки

source: Vary your transitional phrases
ru: Варьируйте ваши переходные фразы
uk: Урізноманітнюйте свої перехідні фрази

source: Adverbs: Irregular Forms
ru: Наречия: Неправильные формы
uk: Прислівники: Нерегулярні форми

source: Irregular Adverb Forms in Comparison
ru: Неправильные формы наречий в степенях сравнения
uk: Нерегулярні форми прислівників у порівнянні

source: While most adverbs follow regular patterns for comparison, several important adverbs have completely irregular forms that must be memorized.
ru: В то время как большинство наречий следуют правильным шаблонам для сравнения, некоторые важные наречия имеют полностью неправильные формы, которые необходимо запомнить.
uk: Хоча більшість прислівників дотримуються регулярних схем порівняння, декілька важливих прислівників мають повністю нерегулярні форми, які потрібно запам’ятати.

source: Complete List of Irregular Adverbs
ru: Полный список неправильных наречий
uk: Повний список нерегулярних прислівників

source: These adverbs have unique comparative and superlative forms that don't follow standard patterns:
ru: Эти наречия имеют уникальные сравнительные и превосходные формы, которые не соответствуют стандартным шаблонам:
uk: Ці прислівники мають унікальні порівняльні та найвищі форми, які не дотримуються стандартних схем:

source: Distance
ru: Расстояние
uk: Відстань

source: Quantity
ru: Количество
uk: Кількість

source: Quantity/Degree
ru: Количество/Степень
uk: Кількість/Ступінь

source: Special Cases and Notes
ru: Особые случаи и примечания
uk: Особливі випадки та примітки

source: 1. Far → Farther/Further Distinction
ru: 1. Различие Far → Farther/Further
uk: 1. Far → Farther/Further (Відмінності у вживанні)

source: 2. Late vs. Lately
ru: 2. Late против Lately
uk: 2. Late vs. Lately (Пізно проти Останнім часом)

source: Comparative Usage in Context
ru: Использование сравнительной степени в контексте
uk: Використання порівняльних форм у контексті

source: Comparison of ability/quality
ru: Сравнение способности/качества
uk: Порівняння здібностей/якості

source: Negative comparison
ru: Отрицательное сравнение
uk: Негативне порівняння

source: Comparison of quantity/degree
ru: Сравнение количества/степени
uk: Порівняння кількості/ступеня

source: Comparison of degree/preference
ru: Сравнение степени/предпочтения
uk: Порівняння ступеня/переваги

source: Important Note on 'Good' vs 'Well'
ru: Важное примечание о 'Good' против 'Well'
uk: Важлива примітка щодо 'Good' проти 'Well'

source: Remember that <span class=\
uk: Пам’ятайте, що <span class=\

source: adjective describing 'singer'
ru: прилагательное, описывающее 'singer' (певца)
uk: прикметник, що описує 'singer'

source: adverb describing 'sings'
ru: наречие, описывающее 'sings' (поет)
uk: прислівник, що описує 'sings'

source: adjective describing 'she'
ru: прилагательное, описывающее 'she' (она)
uk: прикметник, що описує 'she'

source: Common Errors with Irregular Adverbs
ru: Распространенные ошибки с неправильными наречиями
uk: Поширені помилки з нерегулярними прислівниками

source: Adverbs: Modifying Entire Sentences
ru: Наречия: Модификация целых предложений
uk: Прислівники: Модифікація цілих речень

source: Mastering Sentence Adverbs
ru: Освоение наречий, модифицирующих предложения
uk: Освоєння прислівників-модифікаторів речень

source: Sentence adverbs provide commentary on entire statements, expressing attitudes, evaluations, or logical connections between ideas. They are essential for sophisticated communication in English.
ru: Наречия, модифицирующие предложения, комментируют целые утверждения, выражая отношения, оценки или логические связи между идеями. Они необходимы для сложной коммуникации на английском языке.
uk: Прислівники-модифікатори речень надають коментарі до цілих тверджень, виражаючи ставлення, оцінки або логічні зв’язки між ідеями. Вони є важливими для складного спілкування в англійській мові.

source: 1. Attitudinal Adverbs
ru: 1. Наречия отношения
uk: 1. Прислівники ставлення

source: Expressing Speaker Perspective
ru: Выражение точки зрения говорящего
uk: Вираження точки зору мовця

source: Certainty
ru: Уверенность
uk: Впевненість

source: Express confidence in statement
ru: Выражают уверенность в утверждении
uk: Виражають впевненість у твердженні

source: Evaluation
ru: Оценка
uk: Оцінка

source: Judge the situation
ru: Оценивают ситуацию
uk: Оцінюють ситуацію

source: Emotion
ru: Эмоция
uk: Емоція

source: Convey feelings
ru: Передают чувства
uk: Передають почуття

source: Hearsay
ru: По слухам
uk: Чутки

source: Indicate secondhand information
ru: Указывают на информацию из вторых рук
uk: Вказують на інформацію з других рук

source: Position Variations
ru: Вариации позиций
uk: Варіації позицій

source: Initial Position:
ru: Начальная позиция:
uk: Початкова позиція:

source: Most common, strongest emphasis
ru: Наиболее распространенная, сильнейший акцент
uk: Найпоширеніша, найсильніший наголос

source: Mid Position:
ru: Средняя позиция:
uk: Середня позиція:

source: Less emphasis, more integrated
ru: Меньше акцента, более интегрированный
uk: Менше наголосу, більш інтегрована

source: Final Position:
ru: Конечная позиция:
uk: Кінцева позиція:

source: Afterthought or softening
ru: Задняя мысль или смягчение
uk: Додаткова думка або пом’якшення

source: 2. Conjunctive Adverbs
ru: 2. Соединительные наречия
uk: 2. Сполучні прислівники

source: Connecting Ideas Logically
ru: Логическое соединение идей
uk: Логічне з’єднання ідей

source: Add information
ru: Добавляют информацию
uk: Додають інформацію

source: Show opposition
ru: Показывают противопоставление
uk: Показують протиставлення

source: Cause-Effect
ru: Причина-Следствие
uk: Причина-Наслідок

source: Show consequence
ru: Показывают следствие
uk: Показують наслідок

source: Sequence
ru: Последовательность
uk: Послідовність

source: Order events
ru: Упорядочивают события
uk: Впорядковують події

source: Punctuation Rules
ru: Правила пунктуации
uk: Правила пунктуації

source: When connecting independent clauses, use a semicolon before and comma after
ru: При соединении независимых клауз используйте точку с запятой перед и запятую после
uk: При з’єднанні незалежних речень використовуйте крапку з комою перед та кому після

source: When beginning a sentence, use a comma after
ru: Начиная предложение, используйте запятую после
uk: Починаючи речення, використовуйте кому після

source: When used parenthetically, set off with commas
ru: При использовании в качестве вводной конструкции выделяйте запятыми
uk: При використанні в дужках відокремлюйте комами

source: 3. Focusing Adverbs
ru: 3. Фокусирующие наречия
uk: 3. Фокусуючі прислівники

source: Highlighting Specific Information
ru: Выделение конкретной информации
uk: Виділення конкретної інформації

source: Restrictive
ru: Ограничительные
uk: Обмежувальні

source: Limit scope
ru: Ограничивают область действия
uk: Обмежують сферу

source: Additive
ru: Добавочные
uk: Додаткові

source: Include additional items
ru: Включают дополнительные элементы
uk: Включають додаткові елементи

source: Particularizers
ru: Особые наречия
uk: Конкретизатори

source: Emphasize specific aspects
ru: Подчеркивают конкретные аспекты
uk: Наголошують на конкретних аспектах

source: Position Affects Meaning
ru: Позиция влияет на значение
uk: Позиція впливає на значення

source: Different positions, different meanings:
ru: Разные позиции, разные значения:
uk: Різні позиції, різні значення:

source: Sentence Adverb Types Compared
ru: Сравнение типов наречий, модифицирующих предложения
uk: Порівняння типів прислівників-модифікаторів речень

source: Attitudinal
ru: Отношения
uk: Ставлення

source: Express speaker's attitude
ru: Выражают отношение говорящего
uk: Виражають ставлення мовця

source: Conjunctive
ru: Соединительные
uk: Сполучні

source: Connect ideas logically
ru: Логически соединяют идеи
uk: Логічно з’єднують ідеї

source: Focusing
ru: Фокусирующие
uk: Фокусуючі

source: Highlight specific information
ru: Выделяют конкретную информацию
uk: Виділяють конкретну інформацію

source: Common Errors with Sentence Adverbs
ru: Распространенные ошибки с наречиями, модифицирующими предложения
uk: Поширені помилки з прислівниками-модифікаторами речень

source: Identify the type of sentence adverb in each example:
ru: Определите тип наречия, модифицирующего предложение, в каждом примере:
uk: Визначте тип прислівника-модифікатора речення в кожному прикладі:

source: Adverbs: Modifying Verbs, Adjectives, and Other Adverbs
ru: Наречия: Модификация глаголов, прилагательных и других наречий
uk: Прислівники: Модифікація дієслів, прикметників та інших прислівників

source: Mastering Adverb Modification
ru: Освоение модификации наречиями
uk: Освоєння модифікації прислівниками

source: Adverbs are versatile modifiers that enhance meaning by describing how, when, where, why, or to what degree actions occur or qualities exist. They can modify verbs, adjectives, other adverbs, and even entire sentences.
ru: Наречия — это универсальные модификаторы, которые усиливают значение, описывая, как, когда, где, почему или в какой степени происходят действия или существуют качества. Они могут модифицировать глаголы, прилагательные, другие наречия и даже целые предложения.
uk: Прислівники — це універсальні модифікатори, які посилюють значення, описуючи, як, коли, де, чому чи якою мірою відбуваються дії чи існують якості. Вони можуть модифікувати дієслова, прикметники, інші прислівники і навіть цілі речення.

source: 1. Modifying Verbs
ru: 1. Модификация глаголов
uk: 1. Модифікація дієслів

source: Core Functions
ru: Основные функции
uk: Основні функції

source: Question Answered
ru: Вопрос, на который отвечает
uk: Відповідь на питання

source: How?
ru: Как?
uk: Як?

source: Manner of action
ru: Образ действия
uk: Спосіб дії

source: When?
ru: Когда?
uk: Коли?

source: Time of action
ru: Время действия
uk: Час дії

source: Where?
ru: Где?
uk: Де?

source: Place of action
ru: Место действия
uk: Місце дії

source: How often?
ru: Как часто?
uk: Як часто?

source: Frequency of action
ru: Частота действия
uk: Частота дії

source: Position Rules for Verb Modification
ru: Правила позиционирования при модификации глаголов
uk: Правила позиції для модифікації дієслів

source: General Rule:
ru: Общее правило:
uk: Загальне правило:

source: Adverbs usually follow the verbs they modify
ru: Наречия обычно следуют за глаголами, которые они модифицируют
uk: Прислівники зазвичай стоять після дієслів, які вони модифікують

source: Exceptions:
ru: Исключения:
uk: Винятки:

source: Frequency adverbs often come before main verbs
ru: Наречия частоты часто ставятся перед основными глаголами
uk: Прислівники частоти часто стоять перед основними дієсловами

source: Adverbs of manner can sometimes precede the verb for emphasis
ru: Наречия образа действия иногда могут предшествовать глаголу для акцента
uk: Прислівники способу дії іноді можуть передувати дієслову для наголосу

source: 2. Modifying Adjectives
ru: 2. Модификация прилагательных
uk: 2. Модифікація прикметників

source: Intensifying and Qualifying
ru: Усиление и квалификация
uk: Посилення та уточнення

source: Intensifiers
ru: Интенсификаторы (Усилители)
uk: Інтенсифікатори

source: Increase degree
ru: Увеличивают степень
uk: Збільшують ступінь

source: Downtoners
ru: Смягчители
uk: Знижувачі

source: Decrease degree
ru: Уменьшают степень
uk: Зменшують ступінь

source: Qualifiers
ru: Квалификаторы
uk: Уточнювачі

source: Modify meaning
ru: Модифицируют значение
uk: Модифікують значення

source: Common Adjective Modifiers
ru: Распространенные модификаторы прилагательных
uk: Поширені модифікатори прикметників

source: Strong intensifiers
ru: Сильные интенсификаторы
uk: Сильні інтенсифікатори

source: Moderate intensifiers
ru: Умеренные интенсификаторы
uk: Помірні інтенсифікатори

source: Approximators
ru: Аппроксиматоры
uk: Апроксиматори

source: 3. Modifying Other Adverbs
ru: 3. Модификация других наречий
uk: 3. Модифікація інших прислівників

source: Degree and Emphasis
ru: Степень и акцент
uk: Ступінь та наголос

source: Intensification
ru: Интенсификация (Усиление)
uk: Інтенсифікація

source: Reduction
ru: Снижение
uk: Зменшення

source: Focus
uk: Фокус
