Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Browser
ru: Браузер
uk: Браузер

source: Operating System
ru: Операционная система
uk: Операційна Система

source: Last Updated
ru: Последнее обновление
uk: Останнє Оновлення

source: Check for Updates
ru: Проверить обновления
uk: Перевірити Наявність Оновлень

source: Copy System Info
ru: Скопировать системную информацию
uk: Копіювати Системну Інформацію

source: files selected
ru: файлов выбрано
uk: файлів вибрано

source: No files selected
ru: Файлы не выбраны
uk: Файлів не вибрано

source: Checking...
ru: Проверка...
uk: Перевірка...

source: You are using the latest version of the application.
ru: Вы используете последнюю версию приложения.
uk: Ви використовуєте останню версію застосунку.

source: System information copied to clipboard!
ru: Системная информация скопирована в буфер обмена!
uk: Системну інформацію скопійовано в буфер обміну!

source: Live chat will open in a new window. Please ensure pop-ups are allowed.
ru: Онлайн-чат откроется в новом окне. Пожалуйста, убедитесь, что всплывающие окна разрешены.
uk: Живий чат відкриється в новому вікні. Будь ласка, переконайтеся, що спливаючі вікна дозволені.

source: Language & Region
ru: Язык и регион
uk: Мова та Регіон

source: Application Language
ru: Язык приложения
uk: Мова Застосунку

source: Timezone
ru: Часовой пояс
uk: Часовий Пояс

source: Reset
ru: Сбросить
uk: Скинути

source: Content Preferences
ru: Настройки контента
uk: Налаштування Вмісту

source: Show translations
ru: Показывать переводы
uk: Показувати переклади

source: Display translations for words and phrases by default
ru: Показывать переводы слов и фраз по умолчанию
uk: Показувати переклади слів та фраз за замовчуванням

source: Show phonetic transcriptions
ru: Показывать фонетическую транскрипцию
uk: Показувати фонетичні транскрипції

source: Display phonetic symbols for pronunciation
ru: Отображать фонетические символы для произношения
uk: Відображати фонетичні символи для вимови

source: Notification Preferences
ru: Настройки уведомлений
uk: Налаштування Сповіщень

source: Email Notifications
ru: Уведомления по Email
uk: Сповіщення Електронною Поштою

source: Receive important notifications via email
ru: Получать важные уведомления по электронной почте
uk: Отримувати важливі сповіщення електронною поштою

source: Push Notifications
ru: Push-уведомления
uk: Push-Сповіщення

source: Get instant notifications on your device
ru: Получать мгновенные уведомления на ваше устройство
uk: Отримувати миттєві сповіщення на вашому пристрої

source: In-App Notifications
ru: Уведомления в приложении
uk: Сповіщення в Застосунку

source: See notifications when you're using the app
ru: Просматривать уведомления при использовании приложения
uk: Бачити сповіщення, коли ви використовуєте застосунок

source: Email Notification Types
ru: Типы Email-уведомлений
uk: Типи Сповіщень Електронною Поштою

source: New Messages
ru: Новые сообщения
uk: Нові Повідомлення

source: Notify me when I receive new messages
ru: Уведомлять меня о получении новых сообщений
uk: Сповіщати мене про отримання нових повідомлень

source: Friend Requests
ru: Запросы в друзья
uk: Запити в Друзі

source: Notify me when I receive friend requests
ru: Уведомлять меня о получении запросов в друзья
uk: Сповіщати мене про отримання запитів у друзі

source: Event Reminders
ru: Напоминания о событиях
uk: Нагадування про Події

source: Notify me about upcoming events
ru: Уведомлять меня о предстоящих событиях
uk: Сповіщати мене про майбутні події

source: Push Notification Types
ru: Типы Push-уведомлений
uk: Типи Push-Сповіщень

source: New Likes
ru: Новые лайки
uk: Нові Вподобання

source: Notify me when someone likes my posts
ru: Уведомлять меня, когда кому-то нравятся мои публикации
uk: Сповіщати мене, коли хтось вподобає мої дописи

source: Comments
ru: Комментарии
uk: Коментарі

source: Notify me about new comments
ru: Уведомлять меня о новых комментариях
uk: Сповіщати мене про нові коментарі

source: Mentions
ru: Упоминания
uk: Згадки

source: Notify me when someone mentions me
ru: Уведомлять меня, когда меня кто-то упоминает
uk: Сповіщати мене, коли хтось мене згадує

source: Save Notification Settings
ru: Сохранить настройки уведомлений
uk: Зберегти Налаштування Сповіщень

source: Privacy Settings
ru: Настройки конфиденциальности
uk: Налаштування Приватності

source: Hide First Name
ru: Скрыть имя
uk: Приховати Ім'я

source: Your first name will not be visible to other users
ru: Ваше имя не будет видно другим пользователям
uk: Ваше ім'я не буде видиме іншим користувачам

source: Hide Last Name
ru: Скрыть фамилию
uk: Приховати Прізвище

source: Your last name will not be visible to other users
ru: Ваша фамилия не будет видна другим пользователям
uk: Ваше прізвище не буде видиме іншим користувачам

source: Hide Birth Date
ru: Скрыть дату рождения
uk: Приховати Дату Народження

source: Your birth date will not be visible to other users
ru: Ваша дата рождения не будет видна другим пользователям
uk: Ваша дата народження не буде видима іншим користувачам

source: Hide Email
ru: Скрыть Email
uk: Приховати Електронну Пошту

source: Your email address will not be visible to other users
ru: Ваш адрес электронной почты не будет виден другим пользователям
uk: Ваша електронна адреса не буде видима іншим користувачам

source: Profile Visibility
ru: Видимость профиля
uk: Видимість Профілю

source: Control who can see your profile
ru: Управляйте тем, кто может видеть ваш профиль
uk: Керуйте тим, хто може бачити ваш профіль

source: Public
ru: Публичный
uk: Публічний

source: Friends only
ru: Только друзьям
uk: Лише друзі

source: Private
ru: Приватный
uk: Приватний

source: Save Privacy Settings
ru: Сохранить настройки конфиденциальности
uk: Зберегти Налаштування Приватності

source: Password & Authentication
ru: Пароль и аутентификация
uk: Пароль та Аутентифікація

source: Password must contain:
ru: Пароль должен содержать:
uk: Пароль повинен містити:

source: At least 8 characters
ru: Минимум 8 символов
uk: Щонайменше 8 символів

source: At least one uppercase letter
ru: Минимум одну заглавную букву
uk: Щонайменше одну велику літеру

source: At least one lowercase letter
ru: Минимум одну строчную букву
uk: Щонайменше одну малу літеру

source: At least one number
ru: Минимум одну цифру
uk: Щонайменше одну цифру

source: At least one special character
ru: Минимум один специальный символ
uk: Щонайменше один спеціальний символ

source: Account Deletion
ru: Удаление аккаунта
uk: Видалення Облікового Запису

source: Once you delete your account, there is no going back. Please be certain.
ru: Как только вы удалите свой аккаунт, пути назад не будет. Пожалуйста, будьте уверены.
uk: Після видалення облікового запису ви не зможете його відновити. Будь ласка, переконайтеся.

source: Delete Account
ru: Удалить аккаунт
uk: Видалити Обліковий Запис

source: Confirm Account Deletion
ru: Подтвердить удаление аккаунта
uk: Підтвердити Видалення Облікового Запису

source: Are you sure you want to delete your account? This action cannot be undone.
ru: Вы уверены, что хотите удалить свой аккаунт? Это действие невозможно отменить.
uk: Ви впевнені, що хочете видалити свій обліковий запис? Цю дію неможливо скасувати.

source: All your data will be permanently removed from our servers.
ru: Все ваши данные будут безвозвратно удалены с наших серверов.
uk: Усі ваші дані будуть назавжди видалені з наших серверів.

source: Delete Account Permanently
ru: Удалить аккаунт навсегда
uk: Видалити Обліковий Запис Назавжди

source: Last updated:
ru: Последнее обновление:
uk: Останнє оновлення:

source: Information We Collect
ru: Информация, которую мы собираем
uk: Інформація, яку ми збираємо

source: We collect the following types of information when you use MyEngSite:
ru: Мы собираем следующие типы информации, когда вы используете MyEngSite:
uk: Ми збираємо наступні типи інформації, коли ви користуєтеся MyEngSite:

source: Account information (name, email, profile data)
ru: Информация об аккаунте (имя, email, данные профиля)
uk: Інформація облікового запису (ім'я, електронна пошта, дані профілю)

source: Learning progress and activity data
ru: Данные об учебном прогрессе и активности
uk: Прогрес навчання та дані про активність

source: Texts you read and vocabulary you save
ru: Тексты, которые вы читаете, и лексика, которую вы сохраняете
uk: Тексти, які ви читаєте, та словниковий запас, який ви зберігаєте

source: Device and usage information (browser type, IP address)
ru: Информация об устройстве и использовании (тип браузера, IP-адрес)
uk: Інформація про пристрій та використання (тип браузера, IP-адреса)

source: How We Use Your Information
ru: Как мы используем вашу информацию
uk: Як ми використовуємо вашу інформацію

source: Your information helps us:
ru: Ваша информация помогает нам:
uk: Ваша інформація допомагає нам:

source: Provide and improve our services
ru: Предоставлять и улучшать наши услуги
uk: Надавати та покращувати наші послуги

source: Personalize your learning experience
ru: Персонализировать ваш учебный опыт
uk: Персоналізувати ваш досвід навчання

source: Track your progress and show statistics
ru: Отслеживать ваш прогресс и показывать статистику
uk: Відстежувати ваш прогрес та показувати статистику

source: Communicate with you about your account
ru: Общаться с вами по поводу вашего аккаунта
uk: Спілкуватися з вами щодо вашого облікового запису

source: Ensure platform security and prevent fraud
ru: Обеспечивать безопасность платформы и предотвращать мошенничество
uk: Забезпечувати безпеку платформи та запобігати шахрайству

source: Data Sharing
ru: Обмен данными
uk: Обмін Даними

source: We do not sell your personal data. We may share information with:
ru: Мы не продаем ваши персональные данные. Мы можем делиться информацией с:
uk: Ми не продаємо ваші особисті дані. Ми можемо ділитися інформацією з:

source: Service providers who assist in platform operations
ru: Поставщиками услуг, которые помогают в работе платформы
uk: Постачальниками послуг, які допомагають в роботі платформи

source: Legal authorities when required by law
ru: Юридическими органами, когда это требуется по закону
uk: Юридичними органами, коли цього вимагає закон

source: Academic researchers in anonymized form
ru: Академическими исследователями в анонимизированной форме
uk: Науковими дослідниками в анонімізованій формі

source: Your Rights
ru: Ваши права
uk: Ваші Права

source: You have the right to:
ru: Вы имеете право на:
uk: Ви маєте право на:

source: Access and download your data
ru: Доступ и загрузку ваших данных
uk: Доступ та завантаження ваших даних

source: Correct inaccurate information
ru: Исправление неточной информации
uk: Виправлення неточної інформації

source: Delete your account and personal data
ru: Удаление вашего аккаунта и персональных данных
uk: Видалення вашого облікового запису та особистих даних

source: Opt-out of marketing communications
ru: Отказаться от маркетинговых сообщений
uk: Відмова від маркетингових повідомлень

source: Cookies and Tracking
ru: Файлы cookie и отслеживание
uk: Cookies та Відстеження

source: We use cookies to:
ru: Мы используем файлы cookie для:
uk: Ми використовуємо файли cookie для:

source: Authenticate users and maintain sessions
ru: Аутентификации пользователей и поддержания сессий
uk: Аутентифікації користувачів та підтримки сесій

source: Remember your preferences
ru: Запоминания ваших предпочтений
uk: Запам'ятовування ваших уподобань

source: Analyze platform usage
ru: Анализа использования платформы
uk: Аналізу використання платформи

source: You can manage cookies in your browser settings.
ru: Вы можете управлять файлами cookie в настройках своего браузера.
uk: Ви можете керувати файлами cookie у налаштуваннях свого браузера.

source: Changes to This Policy
ru: Изменения в этой политике
uk: Зміни до цієї Політики

source: We may update this policy periodically. We'll notify you of significant changes via email or platform notification.
ru: Мы можем периодически обновлять эту политику. Мы уведомим вас о существенных изменениях по электронной почте или через уведомление на платформе.
uk: Ми можемо періодично оновлювати цю політику. Ми повідомимо вас про суттєві зміни електронною поштою або сповіщенням на платформі.

source: For privacy-related questions, contact our Data Protection Officer at:
ru: По вопросам, связанным с конфиденциальностью, свяжитесь с нашим сотрудником по защите данных по адресу:
uk: З питань, пов'язаних із конфіденційністю, звертайтеся до нашого Співробітника із захисту даних за адресою:

source: Profile Information
ru: Информация профиля
uk: Інформація Профілю

source: Avatar
ru: Аватар
uk: Аватар

source: Upload a new profile picture
ru: Загрузить новое фото профиля
uk: Завантажити нове зображення профілю

source: Change
ru: Изменить
uk: Змінити

source: Member since
ru: Участник с
uk: Учасник з

source: Texts Read
ru: Прочитано текстов
uk: Прочитано Текстів

source: Quick Settings
ru: Быстрые настройки
uk: Швидкі Налаштування

source: Dark Mode
ru: Темный режим
uk: Темний Режим

source: Account & Privacy
ru: Аккаунт и конфиденциальность
uk: Обліковий Запис та Приватність

source: Password & Security
ru: Пароль и безопасность
uk: Пароль та Безпека

source: Change password and security settings
ru: Изменить пароль и настройки безопасности
uk: Змінити пароль та налаштування безпеки

source: Privacy Controls
ru: Настройки конфиденциальности
uk: Керування Приватністю

source: Manage what others see
ru: Управление тем, что видят другие
uk: Керуйте тим, що бачать інші

source: Data and Storage
ru: Данные и хранилище
uk: Дані та Сховище

source: Help and Support
ru: Помощь и поддержка
uk: Допомога та Підтримка

source: Account
ru: Аккаунт
uk: Обліковий Запис

source: Profile Settings
ru: Настройки профиля
uk: Налаштування Профілю

source: Privacy & Security
ru: Конфиденциальность и безопасность
uk: Приватність та Безпека

source: Preferences
ru: Предпочтения
uk: Уподобання

source: Appearance
ru: Внешний вид
uk: Вигляд

source: Data & Storage
ru: Данные и хранилище
uk: Дані та Сховище

source: About
ru: О нас
uk: Про Нас

source: Acceptance of Terms
ru: Принятие Условий
uk: Прийняття Умов

source: By using MyEngSite, you agree to these Terms of Service and our Privacy Policy. If you don't agree, please don't use our services.
ru: Используя MyEngSite, вы соглашаетесь с настоящими Условиями обслуживания и нашей Политикой конфиденциальности. Если вы не согласны, пожалуйста, не используйте наши услуги.
uk: Користуючись MyEngSite, ви погоджуєтеся з цими Умовами Надання Послуг та нашою Політикою Конфіденційності. Якщо ви не згодні, будь ласка, не користуйтеся нашими послугами.

source: Account Responsibilities
ru: Обязанности пользователя
uk: Обов'язки Облікового Запису

source: You agree to:
ru: Вы соглашаетесь:
uk: Ви погоджуєтеся:

source: Provide accurate account information
ru: Предоставлять точную информацию об аккаунте
uk: Надавати точну інформацію про обліковий запис

source: Keep your login credentials secure
ru: Хранить свои учетные данные в безопасности
uk: Зберігати ваші облікові дані в безпеці

source: Not share your account with others
ru: Не передавать свой аккаунт другим
uk: Не ділитися своїм обліковим записом з іншими

source: Be responsible for all activities under your account
ru: Нести ответственность за все действия, совершенные под вашим аккаунтом
uk: Нести відповідальність за всі дії під вашим обліковим записом

source: User Conduct
ru: Поведение пользователя
uk: Поведінка Користувача

source: You agree not to:
ru: Вы соглашаетесь не:
uk: Ви погоджуєтеся не:

source: Use MyEngSite for any illegal purpose
ru: Использовать MyEngSite в любых незаконных целях
uk: Використовувати MyEngSite з будь-якою незаконною метою

source: Upload harmful or offensive content
ru: Загружать вредоносный или оскорбительный контент
uk: Завантажувати шкідливий або образливий вміст

source: Attempt to disrupt or hack our services
ru: Пытаться нарушить или взломать наши сервисы
uk: Намагатися порушити роботу або зламати наші служби

source: Copy or redistribute our content without permission
ru: Копировать или распространять наш контент без разрешения
uk: Копіювати або розповсюджувати наш вміст без дозволу

source: Content Ownership
ru: Право собственности на контент
uk: Право Власності на Вміст

source: All learning materials on MyEngSite are protected by copyright. You may use them for personal learning only.
ru: Все учебные материалы на MyEngSite защищены авторским правом. Вы можете использовать их только для личного обучения.
uk: Усі навчальні матеріали на MyEngSite захищені авторським правом. Ви можете використовувати їх лише для особистого навчання.

source: Content you create (notes, flashcards) remains yours, but you grant us a license to display and store it.
ru: Контент, который вы создаете (заметки, карточки), остается вашим, но вы предоставляете нам лицензию на его отображение и хранение.
uk: Вміст, який ви створюєте (нотатки, картки), залишається вашим, але ви надаєте нам ліцензію на його відображення та зберігання.

source: Payments and Subscriptions
ru: Платежи и подписки
uk: Платежі та Підписки

source: For premium features:
ru: Для премиум-функций:
uk: Для преміум-функцій:

source: You agree to pay all applicable fees
ru: Вы соглашаетесь оплачивать все применимые сборы
uk: Ви погоджуєтеся сплачувати всі відповідні збори

source: Subscriptions automatically renew unless canceled
ru: Подписки автоматически продлеваются, если не отменены
uk: Підписки автоматично поновлюються, якщо їх не скасовано

source: We may change prices with 30 days notice
ru: Мы можем изменить цены с уведомлением за 30 дней
uk: Ми можемо змінити ціни, попередивши за 30 днів

source: Refunds are at our discretion
ru: Возврат средств осуществляется на наше усмотрение
uk: Повернення коштів здійснюється на наш розсуд

source: Termination
ru: Прекращение действия
uk: Припинення Дії

source: We may suspend or terminate your account if you violate these terms. You may delete your account at any time.
ru: Мы можем приостановить или прекратить действие вашего аккаунта, если вы нарушите эти условия. Вы можете удалить свой аккаунт в любое время.
uk: Ми можемо призупинити або припинити дію вашого облікового запису, якщо ви порушите ці умови. Ви можете видалити свій обліковий запис у будь-який час.

source: Disclaimers
ru: Отказ от гарантий
uk: Відмова від Гарантій

source: MyEngSite is provided 'as is' without warranties. We don't guarantee:
ru: MyEngSite предоставляется «как есть» без каких-либо гарантий. Мы не гарантируем:
uk: MyEngSite надається «як є» без гарантій. Ми не гарантуємо:

source: Uninterrupted or error-free service
ru: Бесперебойную работу или отсутствие ошибок в сервисе
uk: Безперебійного обслуговування без помилок

source: Specific learning outcomes
ru: Конкретных результатов обучения
uk: Конкретних результатів навчання

source: Accuracy of all learning materials
ru: Точности всех учебных материалов
uk: Точності всіх навчальних матеріалів

source: Limitation of Liability
ru: Ограничение ответственности
uk: Обмеження Відповідальності

source: To the extent permitted by law, we won't be liable for any indirect or consequential damages arising from your use of MyEngSite.
ru: В пределах, разрешенных законом, мы не несем ответственности за любые косвенные или последующие убытки, возникшие в результате использования вами MyEngSite.
uk: У межах, дозволених законом, ми не несемо відповідальності за будь-які непрямі чи непрямі збитки, що виникли внаслідок використання вами MyEngSite.

source: Changes to Terms
ru: Изменения в Условиях
uk: Зміни до Умов

source: We may update these terms periodically. Continued use after changes constitutes acceptance.
ru: Мы можем периодически обновлять эти условия. Продолжение использования после изменений означает их принятие.
uk: Ми можемо періодично оновлювати ці умови. Подальше використання після змін означає їх прийняття.

source: Governing Law
ru: Регулирующее законодательство
uk: Регулююче Законодавство

source: These terms are governed by the laws of [Your Country/State]. Any disputes will be resolved in [Your Jurisdiction] courts.
ru: Настоящие условия регулируются законами [Ваша Страна/Штат]. Любые споры будут разрешаться в судах [Ваша Юрисдикция].
uk: Ці умови регулюються законодавством [Ваша Країна/Штат]. Будь-які суперечки будуть вирішуватися в судах [Ваша Юрисдикція].

source: For questions about these terms, contact us at:
ru: По вопросам, касающимся настоящих условий, свяжитесь с нами по адресу:
uk: З питань щодо цих умов зв'яжіться з нами за адресою:

source: Question %(counter)s
ru: Вопрос %(counter)s
uk: Запитання %(counter)s

source: %(points)s Point
ru: %(points)s балл
uk: %(points)s Бал

source: Your answer:
ru: Ваш ответ:
uk: Ваша відповідь:

source: No questions available for this test.
ru: Для этого теста нет доступных вопросов.
uk: Немає доступних запитань для цього тесту.

source: Previous
ru: Предыдущий
uk: Попереднє

source: Page %(current)s of %(total)s
ru: Страница %(current)s из %(total)s
uk: Сторінка %(current)s з %(total)s

source: Next
ru: Далее
uk: Наступне

source: Finish Test
ru: Завершить тест
uk: Завершити Тест

source: Test Results
ru: Результаты теста
uk: Результати Тесту

source: You have successfully completed the English level test.
ru: Вы успешно завершили тест на уровень английского.
uk: Ви успішно завершили тест на рівень англійської мови.

source: Your score: <strong>%(score)s</strong> points out of <strong>%(max_score)s</strong>.
ru: Ваш результат: <strong>%(score)s</strong> баллов из <strong>%(max_score)s</strong>.
uk: Ваш бал: <strong>%(score)s</strong> балів з <strong>%(max_score)s</strong>.

source: Percentage: <strong>%(percentage)s%%</strong>
ru: Процент: <strong>%(percentage)s%%</strong>
uk: Відсоток: <strong>%(percentage)s%%</strong>

source: According to the test, your English level is:
ru: Согласно тесту, ваш уровень английского:
uk: Відповідно до тесту, ваш рівень англійської мови:

source: Your current profile level is:
ru: Ваш текущий уровень в профиле:
uk: Ваш поточний рівень профілю:

source: Do you want to apply this new level to your profile?
ru: Вы хотите применить этот новый уровень к своему профилю?
uk: Ви хочете застосувати цей новий рівень до свого профілю?

source: Apply Level
ru: Применить уровень
uk: Застосувати Рівень

source: Dismiss
ru: Отклонить
uk: Відхилити

source: This level is already applied to your profile.
ru: Этот уровень уже применен к вашему профилю.
uk: Цей рівень вже застосовано до вашого профілю.

source: Go to Home
ru: Перейти на главную
uk: Перейти на Головну

source: Error:
ru: Ошибка:
uk: Помилка:

source: An error occurred during level application.
ru: Произошла ошибка при применении уровня.
uk: Під час застосування рівня сталася помилка.

source: An error occurred during dismissal.
ru: Произошла ошибка при отклонении.
uk: Під час відхилення сталася помилка.

source: Test Unavailable
ru: Тест недоступен
uk: Тест Недоступний

source: Test Currently Unavailable
ru: Тест в настоящее время недоступен
uk: Тест Наразі Недоступний

source: Return to Home
ru: Вернуться на главную
uk: Повернутися на Головну

source: English Level Test
ru: Тест на уровень английского
uk: Тест на Рівень Англійської Мови

source: Other Tests (Coming Soon)
ru: Другие тесты (скоро)
uk: Інші Тести (Незабаром)

source: Completed texts
ru: Прочитанные тексты
uk: Завершені тексти

source: Sort texts by date
ru: Сортировать тексты по дате
uk: Сортувати тексти за датою

source: Filter by English level
ru: Фильтровать по уровню английского
uk: Фільтрувати за рівнем англійської

source: Level:
ru: Уровень:
uk: Рівень:

source: All
ru: Все
uk: Усі

source: Search texts...
ru: Поиск текстов...
uk: Пошук текстів...

source: Search
ru: Поиск
uk: Пошук

source: Page %(number)s of %(num_pages)s
ru: Страница %(number)s из %(num_pages)s
uk: Сторінка %(number)s з %(num_pages)s
