Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Object for people (formal)
uk: Додаток для людей (формально)

source: Possession for people/things
uk: Присвійний для людей/речей

source: Subject/object for things
uk: Підмет/додаток для речей

source: Subject/object for people/things
uk: Підмет/додаток для людей/речей

source: Places
uk: Місця

source: Times
uk: Час

source: Types of Relative Clauses
uk: Типи відносних підрядних речень

source: Defining (Restrictive) Clauses
uk: Визначальні (обмежувальні) підрядні речення

source: Essential information that defines which person/thing we mean. No commas used.
uk: Основна інформація, яка визначає, про яку особу/річ ми говоримо. Коми не використовуються.

source: Non-defining (Non-restrictive) Clauses
uk: Невизначальні (необмежувальні) підрядні речення

source: Extra information about a specific person/thing. Use commas.
uk: Додаткова інформація про конкретну особу/річ. Використовуйте коми.

source: Note: Cannot use 'that' in non-defining clauses.
uk: Примітка: Не можна використовувати 'that' у невизначальних реченнях.

source: Special Cases
uk: Особливі випадки

source: Identify all relative pronouns in texts you read
uk: Визначайте всі відносні займенники в текстах, які ви читаєте

source: Practice converting two simple sentences into one complex sentence
uk: Практикуйте перетворення двох простих речень на одне складне

source: Record yourself describing people/things using relative clauses
uk: Записуйте себе, описуючи людей/речі за допомогою відносних підрядних речень

source: Pay attention to when native speakers omit relative pronouns
uk: Звертайте увагу на те, коли носії мови опускають відносні займенники

source: Second and Third Conditional
uk: Другий та третій тип умовних речень

source: Unreal Conditionals: Second and Third Types
uk: Нереальні умовні речення: Другий та третій типи

source: These conditionals describe hypothetical or impossible situations. The <span class=\
uk: Ці умовні речення описують гіпотетичні або неможливі ситуації. <span class=\

source: Second Conditional
uk: Другий тип умовних речень

source: Used for unreal, imaginary, or unlikely situations in the present or future.
uk: Використовується для нереальних, уявних або малоймовірних ситуацій у теперішньому або майбутньому.

source: Key Features:
uk: Ключові особливості:

source: Uses past tense in if-clause but refers to present/future
uk: Використовує минулий час у підрядному реченні умови, але стосується теперішнього/майбутнього

source: Often uses 'were' instead of 'was' for all subjects (more formal)
uk: Часто використовує 'were' замість 'was' для всіх підметів (більш формально)

source: Can use 'could' or 'might' instead of 'would'
uk: Може використовувати 'could' або 'might' замість 'would'

source: Expresses dreams, hypotheticals, or unlikely situations
uk: Виражає мрії, гіпотетичні або малоймовірні ситуації

source: Third Conditional
uk: Третій тип умовних речень

source: Used for impossible past situations and their imaginary results - things that cannot be changed.
uk: Використовується для неможливих минулих ситуацій та їхніх уявних результатів — речей, які неможливо змінити.

source: Expresses regret or criticism about past events
uk: Виражає жаль або критику щодо минулих подій

source: Often used for missed opportunities
uk: Часто використовується для втрачених можливостей

source: Can use 'could have' or 'might have' instead of 'would have'
uk: Може використовувати 'could have' або 'might have' замість 'would have'

source: In formal English, can invert subject and auxiliary ('Had I known...')
uk: У формальній англійській можна інвертувати підмет і допоміжне дієслово ('Had I known...')

source: Comparing Second and Third Conditionals
uk: Порівняння другого та третього типів умовних речень

source: Feature
uk: Характеристика

source: Using Semicolons
uk: Використання крапки з комою

source: The Power of Semicolons
uk: Сила крапки з комою

source: Primary Uses of Semicolons
uk: Основні випадки використання крапки з комою

source: 1. Connecting Related Independent Clauses
uk: 1. З'єднання пов'язаних незалежних речень

source: Use a semicolon between two independent clauses that are closely related in meaning, without a coordinating conjunction:
uk: Використовуйте крапку з комою між двома незалежними реченнями, які тісно пов'язані за змістом, без сполучника сурядності:

source: 2. With Conjunctive Adverbs
uk: 2. Зі сполучниковими прислівниками

source: Use semicolons before conjunctive adverbs (however, therefore, moreover, etc.) when they connect two independent clauses:
uk: Використовуйте крапку з комою перед сполучниковими прислівниками (however, therefore, moreover, тощо), коли вони з'єднують два незалежні речення:

source: Common conjunctive adverbs include: however, therefore, moreover, nevertheless, consequently, furthermore, otherwise.
uk: Поширені сполучникові прислівники включають: however, therefore, moreover, nevertheless, consequently, furthermore, otherwise.

source: 3. In Complex Lists
uk: 3. У складних переліках

source: Use semicolons to separate items in a list when the items themselves contain commas:
uk: Використовуйте крапку з комою для розділення елементів у переліку, коли самі елементи містять коми:

source: Semicolons vs. Other Punctuation
uk: Крапка з комою порівняно з іншими розділовими знаками

source: separate statements
uk: розділяє твердження

source: connected ideas
uk: пов'язані ідеї

source: confusing with commas
uk: плутанина з комами

source: clearer with semicolon
uk: зрозуміліше з крапкою з комою

source: Stylistic Tips
uk: Стилістичні поради

source: Use semicolons to create balance between two contrasting ideas:
uk: Використовуйте крапки з комою, щоб створити баланс між двома контрастними ідеями:

source: Employ semicolons to show cause and effect:
uk: Застосовуйте крапки з комою, щоб показати причину та наслідок:

source: Use them to build rhythm in your writing, creating a pause stronger than a comma but weaker than a period.
uk: Використовуйте їх, щоб створити ритм у вашому письмі, роблячи паузу, сильнішу за кому, але слабшу за крапку.

source: Using Subordinating Conjunctions
uk: Використання підрядних сполучників

source: Mastering Subordinating Conjunctions
uk: Опанування підрядних сполучників

source: Subordinating conjunctions create relationships between independent and dependent clauses, transforming simple statements into complex, nuanced sentences.
uk: Підрядні сполучники створюють зв'язки між незалежними та залежними реченнями, перетворюючи прості твердження на складні, деталізовані речення.

source: What Subordinating Conjunctions Do
uk: Що роблять підрядні сполучники

source: Introduce dependent (subordinate) clauses
uk: Вводять залежні (підрядні) речення

source: Show the relationship between clauses (time, cause-effect, condition, etc.)
uk: Показують зв'язок між реченнями (час, причина-наслідок, умова тощо)

source: Make one clause grammatically dependent on another
uk: Роблять одне речення граматично залежним від іншого

source: Create complex sentence structures
uk: Створюють складні структури речень

source: Categories of Subordinating Conjunctions
uk: Категорії підрядних сполучників

source: Cause & Effect
uk: Причина та наслідок

source: Condition
uk: Умова

source: Advanced Usage Tips
uk: Поради щодо просунутого використання

source: Vary sentence structure by changing clause order:
uk: Урізноманітнюйте структуру речення, змінюючи порядок речень:

source: Combine multiple relationships in one sentence:
uk: Поєднуйте кілька зв'язків в одному реченні:

source: Use for emphasis by placing important information in independent clauses
uk: Використовуйте для наголошення, розміщуючи важливу інформацію в незалежних реченнях

source: Zero and First Conditional
uk: Нульовий та перший типи умовних речень

source: Conditional Sentences: Zero and First Types
uk: Умовні речення: Нульовий та перший типи

source: Conditional sentences express possible or impossible situations and their consequences. The <span class=\
uk: Умовні речення виражають можливі або неможливі ситуації та їхні наслідки. <span class=\

source: Zero Conditional
uk: Нульовий тип умовних речень

source: Used for general truths, scientific facts, and situations that are always true.
uk: Використовується для загальновідомих істин, наукових фактів та ситуацій, які завжди є правдивими.

source: Present Simple
uk: Present Simple (Теперішній простий час)

source: Both clauses use present simple tense
ru: В обеих частях используется Present Simple
uk: Обидва речення використовують Present Simple

source: Can use 'when' instead of 'if' with no change in meaning
ru: Можно использовать 'when' (когда) вместо 'if' (если) без изменения смысла
uk: Можна використовувати 'when' замість 'if' без зміни значення

source: Often used for scientific facts, general truths, and routines
ru: Часто используется для научных фактов, общеизвестных истин и рутинных действий
uk: Часто використовується для наукових фактів, загальновідомих істин та рутинних дій

source: The condition always leads to the result (100%% certainty)
ru: Условие всегда приводит к результату (100%% уверенность)
uk: Умова завжди призводить до результату (100%% впевненість)

source: First Conditional
ru: Первый тип условных предложений
uk: Перший тип умовних речень

source: Used for real and possible situations in the future, often with predictions, promises, warnings, or threats.
ru: Используется для реальных и возможных ситуаций в будущем, часто с предсказаниями, обещаниями, предупреждениями или угрозами.
uk: Використовується для реальних та можливих ситуацій у майбутньому, часто з прогнозами, обіцянками, попередженнями чи погрозами.

source: will + base verb
ru: will + инфинитив без to
uk: will + базова форма дієслова

source: unless = if not
ru: unless = если не
uk: unless = if not (якщо не)

source: Variations:
ru: Вариации:
uk: Варіації:

source: Comparing Zero and First Conditionals
ru: Сравнение нулевого и первого типов условных предложений
uk: Порівняння нульового та першого типів умовних речень

source: In English grammar, a complex sentence is a sentence that consists of more than one clause. These sentences are crucial for expressing intricate relationships between ideas. There are two main types: compound and complex sentences.
ru: В английской грамматике сложное предложение — это предложение, состоящее из более чем одной клаузы (части). Такие предложения важны для выражения сложных связей между идеями. Существует два основных типа: сложносочиненные и сложноподчиненные предложения.
uk: В англійській граматиці, складне речення – це речення, яке складається з більше ніж одного речення. Ці речення є вирішальними для вираження складних зв'язків між ідеями. Існує два основних типи: складносурядні та складнопідрядні речення.

source: Compound Sentences
ru: Сложносочиненные предложения
uk: Складносурядні речення

source: Definition and Structure
ru: Определение и структура
uk: Визначення та структура

source: Conditional Sentences (If-Clauses)
ru: Условные предложения (If-Clauses)
uk: Умовні речення (If-Clauses)

source: Conjunctions vs. Adverbs: Key Differences
ru: Союзы против наречий: ключевые различия
uk: Сполучники проти прислівників: Ключові відмінності

source: Conjunctions
ru: Союзы
uk: Сполучники

source: Conjunctions vs. Adverbs
ru: Союзы против наречий
uk: Сполучники проти прислівників

source: Conjunctions vs. Conjunctive Adverbs: Understanding the Difference
ru: Союзы против конъюнктивных наречий: понимание разницы
uk: Сполучники проти сполучникових прислівників: Розуміння відмінності

source: Many English learners confuse conjunctions with conjunctive adverbs because both connect ideas, but they function differently grammatically and require different punctuation.
ru: Многие изучающие английский язык путают союзы с конъюнктивными наречиями, потому что и те, и другие связывают идеи, но они по-разному функционируют грамматически и требуют разной пунктуации.
uk: Багато тих, хто вивчає англійську, плутають сполучники зі сполучниковими прислівниками, оскільки обидва вони з'єднують ідеї, але вони функціонують по-різному граматично і вимагають різної пунктуації.

source: Key Characteristics:
ru: Ключевые характеристики:
uk: Ключові характеристики:

source: Join two independent clauses to form a compound sentence
ru: Соединяют две независимые части для образования сложносочиненного предложения
uk: З'єднують два незалежні речення для утворення складносурядного речення

source: Require a comma before the conjunction when connecting clauses
ru: Требуют запятой перед союзом при соединении частей предложения
uk: Вимагають коми перед сполучником при з'єднанні речень

source: Create a direct, seamless connection between ideas
ru: Создают прямую, неразрывную связь между идеями
uk: Створюють прямий, безшовний зв'язок між ідеями

source: The seven coordinating conjunctions: for, and, nor, but, or, yet, so
ru: Семь сочинительных союзов: for, and, nor, but, or, yet, so
uk: Сім сурядних сполучників: for, and, nor, but, or, yet, so

source: Conjunctive Adverbs
ru: Конъюнктивные наречия
uk: Сполучникові прислівники

source: Show relationship between two independent clauses
ru: Показывают связь между двумя независимыми частями предложения
uk: Показують зв'язок між двома незалежними реченнями

source: Require either a semicolon or period before them
ru: Требуют либо точки с запятой, либо точки перед собой
uk: Вимагають або крапки з комою, або крапки перед ними

source: Usually followed by a comma
ru: Обычно сопровождаются запятой после себя
uk: Зазвичай після них ставиться кома

source: Can often move within their clause
ru: Часто могут перемещаться внутри своей части предложения
uk: Часто можуть переміщуватися в межах свого речення

source: Provide more specific transitions than conjunctions
ru: Обеспечивают более конкретные переходы, чем союзы
uk: Надають більш конкретні переходи, ніж сполучники

source: Result
ru: Результат
uk: Результат

source: Emphasis
ru: Усиление/Акцент
uk: Наголос

source: Key Differences
ru: Ключевые различия
uk: Ключові відмінності

source: Coordinating Conjunctions
ru: Сочинительные союзы
uk: Сурядні сполучники

source: Flexibility
ru: Гибкость
uk: Гнучкість

source: Important Note:
ru: Важное замечание:
uk: Важлива примітка:

source: Words like <span class=\
ru: Слова, такие как <span class=\
uk: Слова на кшталт <span class=\

source: 1. Identify the Connector
ru: 1. Определите связующее слово
uk: 1. Визначте сполучний елемент

source: Is the underlined word a conjunction or conjunctive adverb?
ru: Является ли подчеркнутое слово союзом или конъюнктивным наречием?
uk: Чи є підкреслене слово сполучником чи сполучниковим прислівником?

source: I wanted to go, but I was too busy.
ru: Я хотел пойти, но был слишком занят.
uk: Я хотів піти, **але** був занадто зайнятий.

source: She studied hard; therefore, she passed.
ru: Она усердно училась; следовательно, она сдала.
uk: Вона старанно вчилася; **тому** вона склала.

source: We can leave now, or we can wait.
ru: Мы можем уйти сейчас, или можем подождать.
uk: Ми можемо піти зараз, **або** можемо почекати.

source: 2. Correct the Errors
ru: 2. Исправьте ошибки
uk: 2. Виправте помилки

source: Fix the punctuation errors:
ru: Исправьте пунктуационные ошибки:
uk: Виправте пунктуаційні помилки:

source: I was tired, however I couldn't sleep.
ru: Я устал, однако не мог уснуть.
uk: Я був стомлений, **однак** не міг заснути.

source: He didn't study consequently he failed.
ru: Он не учился, следовательно, он провалился.
uk: Він не вчився **відповідно** він провалився.

source: She loves music but she can't sing.
ru: Она любит музыку, но не умеет петь.
uk: Вона любить музику **але** не вміє співати.

source: Back to Conjunctions
ru: Назад к Союзам
uk: Повернутися до Сполучників

source: Conjunction vs. Preposition
ru: Союз против предлога
uk: Сполучник проти Прийменника

source: Some words in English, like <span class='code-highlight'>after</span> or <span class='code-highlight'>before</span>, can be either conjunctions or prepositions depending on the context.
ru: Некоторые слова в английском языке, такие как <span class='code-highlight'>after</span> (после) или <span class='code-highlight'>before</span> (до/перед), могут быть либо союзами, либо предлогами в зависимости от контекста.
uk: Деякі слова в англійській мові, як-от <span class='code-highlight'>after</span> або <span class='code-highlight'>before</span>, можуть бути або сполучниками, або прийменниками залежно від контексту.

source: The main difference lies in what the word is connecting: prepositions connect nouns/pronouns to other words, while conjunctions connect clauses.
ru: Основное различие заключается в том, что именно связывает слово: предлоги связывают существительные/местоимения с другими словами, в то время как союзы связывают клаузы (части предложения).
uk: Основна відмінність полягає в тому, що слово з'єднує: прийменники з'єднують іменники/займенники з іншими словами, тоді як сполучники з'єднують речення.

source: 1. Prepositions
ru: 1. Предлоги
uk: 1. Прийменники

source: A preposition links a noun or pronoun to another word in the sentence. It is always followed by a noun phrase (object of the preposition).
ru: Предлог связывает существительное или местоимение с другим словом в предложении. За ним всегда следует именная фраза (объект предлога).
uk: Прийменник пов'язує іменник або займенник з іншим словом у реченні. За ним завжди слідує іменникова фраза (додаток прийменника).

source: We will leave <span class='example-highlight'>after</span> <b>lunch</b>.
ru: Мы уедем <span class='example-highlight'>после</span> <b>обеда</b>.
uk: Ми підемо <span class='example-highlight'>після</span> <b>обіду</b>.

source: I arrived <span class='example-highlight'>before</span> <b>him</b>.
ru: Я приехал <span class='example-highlight'>до</span> <b>него</b>.
uk: Я прибув <span class='example-highlight'>до</span> <b>нього</b>.

source: Here, the words following <span class='code-highlight'>after</span> and <span class='code-highlight'>before</span> are nouns or pronouns, making these words prepositions.
ru: Здесь слова, следующие за <span class='code-highlight'>after</span> и <span class='code-highlight'>before</span>, являются существительными или местоимениями, что делает эти слова предлогами.
uk: Тут слова, що слідують за <span class='code-highlight'>after</span> та <span class='code-highlight'>before</span>, є іменниками або займенниками, що робить ці слова прийменниками.

source: 2. Conjunctions
ru: 2. Союзы
uk: 2. Сполучники

source: A conjunction connects two clauses and is followed by a subject and a verb.
ru: Союз связывает две клаузы (части предложения) и за ним следует подлежащее и сказуемое.
uk: Сполучник з'єднує два речення, і за ним слідує підмет і дієслово.

source: We will leave <span class='example-highlight'>after</span> <b>the speech ends</b>.
ru: Мы уедем <span class='example-highlight'>после того, как речь закончится</b>.
uk: Ми підемо <span class='example-highlight'>після того, як промова закінчиться</b>.

source: I arrived <span class='example-highlight'>before</span> <b>he came</b>.
ru: Я приехал <span class='example-highlight'>до того, как он пришел</b>.
uk: Я прибув <span class='example-highlight'>до того, як</span> <b>він прийшов</b>.

source: Here, <span class='code-highlight'>after</span> and <span class='code-highlight'>before</span> introduce full clauses, so they function as subordinating conjunctions.
ru: Здесь <span class='code-highlight'>after</span> и <span class='code-highlight'>before</span> вводят полные клаузы, поэтому они функционируют как подчинительные союзы.
uk: Тут <span class='code-highlight'>after</span> та <span class='code-highlight'>before</span> вводять повні речення, тому вони функціонують як підрядні сполучники.

source: Comparison Table
ru: Сравнительная таблица
uk: Порівняльна таблиця

source: Preposition
ru: Предлог
uk: Прийменник

source: Conjunction
ru: Союз
uk: Сполучник

source: Connects
ru: Соединяет
uk: З'єднує

source: Noun/pronoun to another word
ru: Существительное/местоимение с другим словом
uk: Іменник/займенник з іншим словом

source: Clause to another clause
ru: Клаузу с другой клаузой
uk: Речення з іншим реченням

source: Followed by
ru: Следует за
uk: Після нього слідує

source: Noun or pronoun
ru: Существительным или местоимением
uk: Іменник або займенник

source: Subject + verb
ru: Подлежащим + сказуемым
uk: Підмет + дієслово

source: Tips for Learners
ru: Советы для учащихся
uk: Поради для тих, хто навчається

source: <span class='term-highlight'>Look at the word after:</span> If it's a noun or pronoun → preposition; if it's a subject + verb → conjunction.
ru: <span class='term-highlight'>Посмотрите на слово после:</span> Если это существительное или местоимение → предлог; если это подлежащее + сказуемое → союз.
uk: <span class='term-highlight'>Подивіться на слово після:</span> Якщо це іменник або займенник → прийменник; якщо це підмет + дієслово → сполучник.

source: Some words (like 'since', 'until', 'as') can also function both ways.
ru: Некоторые слова (например, 'since', 'until', 'as') также могут функционировать двояко.
uk: Деякі слова (як-от 'since', 'until', 'as') також можуть функціонувати двояко.

source: Changing the structure changes the role of the word.
ru: Изменение структуры меняет роль слова.
uk: Зміна структури змінює роль слова.

source: Coordinating Conjunctions: The FANBOYS Guide
ru: Сочинительные союзы: Руководство по FANBOYS
uk: Сурядні сполучники: Посібник FANBOYS

source: Mastering Coordinating Conjunctions (FANBOYS)
ru: Освоение сочинительных союзов (FANBOYS)
uk: Опанування сурядних сполучників (FANBOYS)

source: Coordinating conjunctions are the fundamental connectors in English grammar, joining words, phrases, or independent clauses of equal grammatical rank. The seven coordinating conjunctions can be remembered with the acronym <span class=\
ru: Сочинительные союзы являются основными связующими элементами в английской грамматике, объединяя слова, фразы или независимые клаузы (части предложения) равного грамматического ранга. Семь сочинительных союзов можно запомнить с помощью акронима <span class=\
uk: Сурядні сполучники є основними з'єднувальними елементами в англійській граматиці, що поєднують слова, фрази або незалежні речення однакового граматичного рангу. Сім сурядних сполучників можна запам'ятати за допомогою абревіатури <span class=\

source: The Complete FANBOYS Breakdown
ru: Полный разбор FANBOYS
uk: Повний аналіз FANBOYS

source: FANBOYS Acronym:
ru: Акроним FANBOYS:
uk: Абревіатура FANBOYS:

source: Indicates reason or cause (similar to 'because')
ru: Указывает на причину (похоже на 'because' - потому что)
uk: Вказує на причину або підставу (подібно до 'because')

source: Adds information or connects similar ideas
ru: Добавляет информацию или связывает схожие идеи
uk: Додає інформацію або з'єднує подібні ідеї

source: Connects negative alternatives (requires inverted word order)
ru: Соединяет отрицательные альтернативы (требует обратного порядка слов)
uk: З'єднує негативні альтернативи (вимагає інвертованого порядку слів)

source: Shows contrast or opposition between ideas
ru: Показывает контраст или противопоставление между идеями
uk: Показує контраст або протиставлення між ідеями

source: Presents alternatives or choices
ru: Представляет альтернативы или выбор
uk: Представляє альтернативи або вибір

source: Shows unexpected contrast (stronger than 'but')
ru: Показывает неожиданный контраст (сильнее, чем 'but' - но)
uk: Показує несподіваний контраст (сильніше, ніж 'but')

source: Indicates result or consequence
ru: Указывает на результат или следствие
uk: Вказує на результат або наслідок

source: Punctuation Rules for Coordinating Conjunctions
ru: Правила пунктуации для сочинительных союзов
uk: Правила пунктуації для сурядних сполучників
