Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: B. Experiencer Subjects
ru: B. Подлежащее-Испытующий
uk: B. Підмети-досвідчувачі

source: Receivers of sensory or cognitive experiences:
ru: Получатели сенсорных или когнитивных переживаний:
uk: Отримувачі сенсорного чи когнітивного досвіду:

source: C. Patient Subjects
ru: C. Подлежащее-Пациент
uk: C. Підмети-пацієнти

source: Undergoers of actions (often in passive voice):
ru: Подвергающиеся действиям (часто в пассивном залоге):
uk: Ті, що зазнають дій (часто в пасивному стані):

source: D. Dummy Subjects
ru: D. Формальные подлежащие
uk: D. Формальні (несправжні) підмети

source: Grammatical placeholders without semantic content:
ru: Грамматические заполнители без смыслового содержания:
uk: Граматичні займенники без смислового наповнення:

source: Subject Characteristics Comparison
ru: Сравнение характеристик подлежащего
uk: Порівняння характеристик підметів

source: Verb Agreement
ru: Согласование с глаголом
uk: Узгодження дієслів

source: Simple
ru: Простое
uk: Простий

source: Initial
ru: Начальная
uk: Початкова

source: Singular/Plural
ru: Единственное/Множественное
uk: Однина/Множина

source: Compound
ru: Составное
uk: Складений

source: Usually plural
ru: Обычно множественное
uk: Зазвичай множина

source: Inverted
ru: Инвертированное
uk: Інвертована

source: Same as simple
ru: То же, что и простое
uk: Як і простий

source: Delayed
ru: Отложенное
uk: Відкладена

source: Final
ru: Конечная
uk: Кінцева

source: Follows dummy subject
ru: Следует за формальным подлежащим
uk: Йде після формального підмета

source: Special Considerations
ru: Особые соображения
uk: Особливі міркування

source: Key agreement rules for different subject types:
ru: Ключевые правила согласования для разных типов подлежащих:
uk: Ключові правила узгодження для різних типів підметів:

source: Collective nouns can be singular or plural:
ru: Собирательные существительные могут быть единственного или множественного числа:
uk: Збірні іменники можуть бути в однині або множині:

source: Indefinite pronouns typically singular:
ru: Неопределенные местоимения обычно единственного числа:
uk: Невизначені займенники зазвичай в однині:

source: Titles/names always singular:
ru: Заголовки/имена всегда единственного числа:
uk: Заголовки/назви завжди в однині:

source: 2. Subject Omission
ru: 2. Опущение подлежащего
uk: 2. Пропуск підмета

source: Cases where subjects are grammatically optional:
ru: Случаи, когда подлежащие грамматически необязательны:
uk: Випадки, коли підмети граматично необов'язкові:

source: 3. Common Errors
ru: 3. Распространенные ошибки
uk: 3. Поширені помилки

source: Definition and Function of the Predicate
ru: Определение и функция сказуемого
uk: Визначення та функція присудка

source: Core Function
ru: Основная функция
uk: Основна функція

source: The predicate completes the thought initiated by the subject. It must contain at least one verb but can also include:
ru: Сказуемое завершает мысль, начатую подлежащим. Оно должно содержать по крайней мере один глагол, но также может включать:
uk: Присудок завершує думку, розпочату підметом. Він повинен містити принаймні одне дієслово, але може також включати:

source: Objects (direct and indirect)
ru: Дополнения (прямые и косвенные)
uk: Додатки (прямі та непрямі)

source: Complements (subject and object complements)
ru: Комплименты (субъектные и объектные)
uk: Доповнення (доповнення підмета та додатка)

source: Adverbial modifiers
ru: Обстоятельственные определители (Обстоятельства)
uk: Прислівникові модифікатори

source: Types of Predicates
ru: Типы сказуемых
uk: Типи присудків

source: 1. Simple Predicate
ru: 1. Простое сказуемое
uk: 1. Простий присудок

source: Consists only of the main verb or verb phrase (without any modifiers or objects).
ru: Состоит только из основного глагола или глагольной фразы (без каких-либо определителей или дополнений).
uk: Складається лише з головного дієслова або дієслівної фрази (без будь-яких модифікаторів чи додатків).

source: 2. Complete Predicate
ru: 2. Полное сказуемое
uk: 2. Повний присудок

source: Includes the verb plus all words that modify or complete its meaning.
ru: Включает глагол плюс все слова, которые модифицируют или дополняют его значение.
uk: Включає дієслово та всі слова, які модифікують або доповнюють його значення.

source: 3. Compound Predicate
ru: 3. Составное сказуемое
uk: 3. Складений присудок

source: Contains two or more verbs that share the same subject (connected by conjunctions).
ru: Содержит два или более глагола, которые имеют одно и то же подлежащее (соединены союзами).
uk: Містить два або більше дієслів, які мають спільний підмет (з'єднані сполучниками).

source: Predicate Components
ru: Компоненты сказуемого
uk: Складові присудка

source: Component
ru: Компонент
uk: Складова

source: Core action or state of being
ru: Основное действие или состояние бытия
uk: Основна дія або стан

source: Direct Object
ru: Прямое дополнение
uk: Прямий додаток

source: Receives the action of the verb
ru: Получает действие глагола
uk: Отримує дію дієслова

source: Indirect Object
ru: Косвенное дополнение
uk: Непрямий додаток

source: Receives the direct object
ru: Получает прямое дополнение
uk: Отримує прямий додаток

source: Subject Complement
ru: Именная часть составного сказуемого
uk: Доповнення підмета

source: Renames or describes the subject
ru: Переименовывает или описывает подлежащее
uk: Перейменовує або описує підмет

source: Adverbial Modifier
ru: Обстоятельственное определение (Обстоятельство)
uk: Прислівниковий модифікатор

source: Adds information about time, place, manner
ru: Добавляет информацию о времени, месте, образе действия
uk: Додає інформацію про час, місце, спосіб

source: Definition and Function of the Subject
ru: Определение и функция подлежащего
uk: Визначення та функція підмета

source: The Subject in English Grammar
ru: Подлежащее в английской грамматике
uk: Підмет в англійській граматиці

source: Core Definition
ru: Основное определение
uk: Основне визначення

source: Typically a noun, pronoun, or noun phrase
ru: Обычно существительное, местоимение или именная фраза
uk: Зазвичай іменник, займенник або іменникова фраза

source: Answers the questions
uk: Відповідає на питання

source: Determines verb agreement in number and person
ru: Определяет согласование глагола по числу и лицу
uk: Визначає узгодження дієслова в числі та особі

source: Usually precedes the verb in declarative sentences
ru: Обычно предшествует глаголу в повествовательных предложениях
uk: Зазвичай передує дієслову в розповідних реченнях

source: Can be simple (single word) or complete (including modifiers)
ru: Может быть простым (одно слово) или полным (включая определители)
uk: Може бути простим (одне слово) або повним (включаючи модифікатори)

source: Primary Functions
ru: Основные функции
uk: Основні функції

source: 1. Agent of Action
ru: 1. Агент действия
uk: 1. Агент дії

source: The doer/performer in active voice constructions:
ru: Исполнитель/субъект действия в конструкциях активного залога:
uk: Виконавець/діяч у конструкціях активного стану:

source: 2. Theme/Experiencer
ru: 2. Тема/Испытующий
uk: 2. Тема/Досвідчувач

source: The entity affected by or experiencing the action:
ru: Сущность, затронутая или переживающая действие:
uk: Сутність, яка зазнає впливу дії або переживає її:

source: 3. Subject of Description
ru: 3. Объект описания
uk: 3. Підмет опису

source: The entity being described or identified:
ru: Сущность, которую описывают или идентифицируют:
uk: Сутність, яку описують або ідентифікують:

source: Grammatical Properties
ru: Грамматические свойства
uk: Граматичні властивості

source: Property
ru: Свойство
uk: Властивість

source: Description
ru: Описание
uk: Опис

source: Number Agreement
ru: Согласование по числу
uk: Узгодження в числі

source: Determines verb form (singular/plural)
ru: Определяет форму глагола (единственное/множественное число)
uk: Визначає форму дієслова (однина/множина)

source: Case
ru: Падеж
uk: Відмінок

source: Nominative case for pronouns
ru: Именительный падеж для местоимений
uk: Називний відмінок для займенників

source: Typically precedes the verb in statements
ru: Обычно предшествует глаголу в утвердительных предложениях
uk: Зазвичай передує дієслову в стверджувальних реченнях

source: Omission
ru: Опущение
uk: Пропуск

source: Optional in imperative sentences
ru: Необязательно в повелительных предложениях
uk: Необов'язковий у наказових реченнях

source: 1. Dummy Subjects
ru: 1. Формальные подлежащие
uk: 1. Формальні (несправжні) підмети

source: Existential and weather expressions with 'it' or 'there':
ru: Экзистенциальные выражения и выражения о погоде с 'it' или 'there':
uk: Екзистенційні та погодні вирази з 'it' або 'there':

source: 2. Inverted Subjects
ru: 2. Инвертированные подлежащие
uk: 2. Інвертовані підмети

source: Subjects following verbs in questions or special constructions:
ru: Подлежащие, следующие за глаголами в вопросах или специальных конструкциях:
uk: Підмети, що йдуть після дієслів у питаннях або спеціальних конструкціях:

source: 3. Complex Subjects
ru: 3. Сложные подлежащие
uk: 3. Складні підмети

source: 4. Common Errors
ru: 4. Распространенные ошибки
uk: 4. Поширені помилки

source: Predicates can be classified into different types based on their structure and complexity. Understanding these types helps in sentence construction and analysis.
ru: Сказуемые могут быть классифицированы на разные типы в зависимости от их структуры и сложности. Понимание этих типов помогает в построении и анализе предложений.
uk: Присудки можна класифікувати на різні типи залежно від їхньої структури та складності. Розуміння цих типів допомагає у побудові та аналізі речень.

source: The most basic form consisting of just the main verb or verb phrase.
ru: Самая базовая форма, состоящая только из основного глагола или глагольной фразы.
uk: Найбільш базова форма, що складається лише з головного дієслова або дієслівної фрази.

source: Characteristics:
ru: Характеристики:
uk: Характеристики:

source: Contains only the verb (no objects, complements, or modifiers)
ru: Содержит только глагол (без дополнений, комплиментов или определителей)
uk: Містить лише дієслово (без додатків, доповнень чи модифікаторів)

source: Common in short, direct statements
ru: Распространен в коротких, прямых утверждениях
uk: Поширений у коротких, прямих твердженнях

source: Often used in commands where the subject is implied
ru: Часто используется в повелительных предложениях, где подлежащее подразумевается
uk: Часто використовується в наказах, де підмет мається на увазі

source: Components Often Included:
ru: Часто включаемые компоненты:
uk: Складові, які часто включаються:

source: Direct and indirect objects
ru: Прямые и косвенные дополнения
uk: Прямі та непрямі додатки

source: Subject and object complements
ru: Субъектные и объектные комплименты
uk: Доповнення підмета та додатка

source: Adverbial modifiers (time, place, manner)
ru: Обстоятельственные определители (время, место, образ действия)
uk: Прислівникові модифікатори (час, місце, спосіб)

source: Contains two or more verbs sharing the same subject, connected by conjunctions.
ru: Содержит два или более глагола, имеющих одно и то же подлежащее, соединенных союзами.
uk: Містить два або більше дієслів, які мають спільний підмет, з'єднані сполучниками.

source: Verbs must share the same subject
ru: Глаголы должны иметь одно и то же подлежащее
uk: Дієслова повинні мати спільний підмет

source: Connected by coordinating conjunctions (and, but, or)
ru: Соединены сочинительными союзами (and, but, or)
uk: З'єднані сурядними сполучниками (and, but, or)

source: May include different verb forms (tenses, aspects)
ru: Могут включать разные глагольные формы (времена, виды)
uk: Може включати різні форми дієслів (часи, види)

source: Each verb can have its own objects and modifiers
ru: Каждый глагол может иметь свои дополнения и определители
uk: Кожне дієслово може мати свої додатки та модифікатори

source: Common Conjunction Patterns:
ru: Распространенные схемы союзов:
uk: Поширені схеми сполучення:

source: Predicate Type Comparison
ru: Сравнение типов сказуемых
uk: Порівняння типів присудків

source: Components
ru: Компоненты
uk: Складові

source: When Used
ru: Когда используется
uk: Коли використовується

source: Verb only
ru: Только глагол
uk: Лише дієслово

source: Short statements, commands
ru: Короткие утверждения, команды
uk: Короткі твердження, команди

source: Complete
ru: Полное
uk: Повний

source: Verb + modifiers
ru: Глагол + определители
uk: Дієслово + модифікатори

source: Most common in writing
ru: Наиболее распространено в письменной речи
uk: Найпоширеніший у письмі

source: Multiple verbs
ru: Несколько глаголов
uk: Множинні дієслова

source: Showing multiple actions
ru: Показывает множественные действия
uk: Показує множинні дії

source: What Can Be a Subject?
ru: Что может быть подлежащим?
uk: Що може бути підметом?

source: Grammatical Forms That Can Function as Subjects
ru: Грамматические формы, которые могут функционировать как подлежащие
uk: Граматичні форми, які можуть функціонувати як підмети

source: Subjects in English can take various grammatical forms, from simple nouns to complex phrases and clauses, each serving as the focal point of a sentence.
ru: Подлежащие в английском языке могут принимать различные грамматические формы, от простых существительных до сложных фраз и придаточных предложений, каждая из которых служит смысловым центром предложения.
uk: Підмети в англійській мові можуть приймати різні граматичні форми, від простих іменників до складних фраз і підрядних речень, кожна з яких служить фокусною точкою речення.

source: 1. Nouns and Pronouns
ru: 1. Существительные и местоимения
uk: 1. Іменники та займенники

source: Most common subject forms
ru: Самые распространенные формы подлежащего
uk: Найпоширеніші форми підмета

source: Pronouns must be in nominative case (I, he, she, we, they)
ru: Местоимения должны быть в именительном падеже (I, he, she, we, they)
uk: Займенники повинні бути в називному відмінку (I, he, she, we, they)

source: Proper nouns (specific names) and common nouns (general categories)
ru: Имена собственные (конкретные имена) и нарицательные существительные (общие категории)
uk: Власні іменники (конкретні назви) та загальні іменники (загальні категорії)

source: Can be concrete or abstract
ru: Могут быть конкретными или абстрактными
uk: Можуть бути конкретними або абстрактними

source: 2. Noun Phrases
ru: 2. Именные фразы
uk: 2. Іменникові фрази

source: Noun plus its modifiers
ru: Существительное плюс его определители
uk: Іменник плюс його модифікатори

source: Can include articles, adjectives, prepositional phrases
ru: Могут включать артикли, прилагательные, предложные фразы
uk: Можуть включати артиклі, прикметники, прийменникові фрази

source: May contain relative clauses
ru: Могут содержать придаточные предложения
uk: Можуть містити відносні підрядні речення

source: Can be simple or complex
ru: Могут быть простыми или сложными
uk: Можуть бути простими або складними

source: 3. Gerunds and Gerund Phrases
ru: 3. Герундии и герундиальные фразы
uk: 3. Герундії та герундійні фрази

source: Verbal nouns ending in -ing
ru: Отглагольные существительные, оканчивающиеся на -ing
uk: Дієслівні іменники, що закінчуються на -ing

source: Can take objects and modifiers
ru: Могут принимать дополнения и определители
uk: Можуть мати додатки та модифікатори

source: Always singular in number
ru: Всегда единственного числа
uk: Завжди в однині

source: Common for activities and processes
ru: Распространены для обозначения действий и процессов
uk: Поширені для позначення дій та процесів

source: 4. Infinitives and Infinitive Phrases
ru: 4. Инфинитивы и инфинитивные фразы
uk: 4. Інфінітиви та інфінітивні фрази

source: Less common than gerund subjects
ru: Менее распространены, чем герундиальные подлежащие
uk: Менш поширені, ніж герундійні підмети

source: Often abstract or philosophical
ru: Часто абстрактны или философские
uk: Часто абстрактні або філософські

source: Can be modified and take objects
ru: Могут быть модифицированы и принимать дополнения
uk: Можуть бути модифіковані та мати додатки

source: Often used with 'be' verbs
ru: Часто используются с глаголами 'be'
uk: Часто використовуються з дієсловами 'be'

source: 5. Other Subject Types
ru: 5. Другие типы подлежащих
uk: 5. Інші типи підметів

source: A. Noun Clauses
ru: A. Именные придаточные предложения
uk: A. Іменникові підрядні речення

source: B. Dummy 'It'
ru: B. Формальное 'It'
uk: B. Формальне 'It'

source: C. Existential 'There'
ru: C. Экзистенциальное 'There'
uk: C. Екзистенційне 'There'

source: D. Quotations
ru: D. Цитаты
uk: D. Цитати

source: Subject Identification Test
ru: Тест на определение подлежащего
uk: Тест на ідентифікацію підмета

source: Method
ru: Метод
uk: Метод

source: Procedure
ru: Процедура
uk: Процедура

source: Question Test
ru: Вопросительный тест
uk: Тест запитанням

source: Passive Transformation
ru: Пассивная трансформация
uk: Пасивна трансформація

source: Subject becomes agent in passive
ru: Подлежащее становится агентом в пассивном залоге
uk: Підмет стає агентом у пасиві

source: Subjects determine verb form (singular/plural):
ru: Подлежащие определяют форму глагола (единственное/множественное число):
uk: Підмети визначають форму дієслова (однина/множина):

source: 2. Delayed Subjects
ru: 2. Отложенные подлежащие
uk: 2. Відкладені підмети

source: When subjects appear after the verb:
ru: Когда подлежащие появляются после глагола:
uk: Коли підмети з’являються після дієслова:

source: Every complete sentence in English is composed of two main parts: the subject and the predicate. Together, they form the core of the sentence, providing the fundamental information about who or what is doing something.
ru: Каждое полное предложение в английском языке состоит из двух основных частей: подлежащего и сказуемого. Вместе они формируют ядро предложения, предоставляя основную информацию о том, кто или что совершает действие.
uk: Кожне повне речення в англійській мові складається з двох основних частин: підмета і присудка. Разом вони утворюють ядро речення, надаючи основну інформацію про те, хто або що виконує дію.

source: Sentence Parts
ru: Члены предложения
uk: Члени речення

source: The Subject
ru: Подлежащее
uk: Підмет

source: Definition and Function
ru: Определение и функция
uk: Визначення та функція

source: The Predicate
ru: Сказуемое
uk: Присудок

source: Definition and Purpose of the Adverbial Modifier
ru: Определение и назначение обстоятельственного определителя (Обстоятельства)
uk: Визначення та призначення прислівникового модифікатора

source: Minor Sentence Parts
ru: Второстепенные члены предложения
uk: Другорядні члени речення

source: Adverbial Modifiers in English Grammar
ru: Обстоятельственные определители в английской грамматике
uk: Прислівникові модифікатори в англійській граматиці

source: Primary Purposes:
ru: Основные цели:
uk: Основні призначення:

source: Modify verbs by describing
uk: Модифікують дієслова, описуючи

source: Modify adjectives by indicating
uk: Модифікують прикметники, вказуючи

source: Modify other adverbs by showing
uk: Модифікують інші прислівники, показуючи

source: Modify entire sentences to express
uk: Модифікують цілі речення, щоб виразити

source: Examples of Different Functions:
ru: Примеры различных функций:
uk: Приклади різних функцій:

source: Grammatical Forms
ru: Грамматические формы
uk: Граматичні форми

source: 1. Single-word Adverbs
ru: 1. Однословные наречия
uk: 1. Прислівники з одного слова

source: 2. Adverbial Phrases
ru: 2. Наречные фразы
uk: 2. Прислівникові фрази

source: 3. Prepositional Phrases
ru: 3. Предложные фразы
uk: 3. Прийменникові фрази

source: 4. Noun Phrases
ru: 4. Именные фразы
uk: 4. Іменникові фрази

source: 5. Infinitive Phrases
ru: 5. Инфинитивные фразы
uk: 5. Інфінітивні фрази

source: Semantic Categories
ru: Смысловые категории
uk: Смислові категорії

source: Questions Answered
ru: Вопросы, на которые отвечают
uk: Питання, на які відповідають

source: 1. Position Flexibility
ru: 1. Гибкость позиции
uk: 1. Гнучкість позиції

source: Adverbial modifiers can often occupy different positions in a sentence, sometimes with subtle meaning differences:
ru: Обстоятельственные определители часто могут занимать разные позиции в предложении, иногда с тонкими смысловыми различиями:
uk: Прислівникові модифікатори часто можуть займати різні позиції в реченні, іноді з тонкими відмінностями у значенні:

source: 2. Multiple Adverbials
ru: 2. Множественные обстоятельства
uk: 2. Кілька прислівникових модифікаторів

source: When using multiple adverbials, typical order is:
uk: При використанні кількох прислівникових модифікаторів, типовий порядок:

source: Back to Minor Sentence Parts
ru: Назад к Второстепенным членам предложения
uk: Повернутися до другорядних членів речення

source: Definition and Function of the Attribute
ru: Определение и функция определения
uk: Визначення та функція означення

source: The Attribute in English Grammar
ru: Определение в английской грамматике
uk: Означення в англійській граматиці

source: Core Characteristics
ru: Основные характеристики
uk: Основні характеристики

source: Describes qualities (color, size, shape, etc.)
ru: Описывает качества (цвет, размер, форма и т.д.)
uk: Описує якості (колір, розмір, форма тощо)

source: Specifies quantity or number
ru: Указывает количество или число
uk: Уточнює кількість або число

source: Indicates possession or ownership
ru: Указывает на принадлежность или владение
uk: Вказує на володіння або власність

source: Provides classifying information
ru: Предоставляет классифицирующую информацию
uk: Надає класифікаційну інформацію

source: Expresses subjective evaluation
ru: Выражает субъективную оценку
uk: Виражає суб'єктивну оцінку

source: Types of Attributes
ru: Типы определений
uk: Типи означень

source: 1. Adjectives
ru: 1. Прилагательные
uk: 1. Прикметники

source: Single-word descriptors before nouns:
ru: Однословные описания перед существительными:
uk: Описові слова з одного слова перед іменниками:

source: 2. Noun Modifiers
ru: 2. Модификаторы-существительные
uk: 2. Іменникові модифікатори

source: Nouns functioning as adjectives:
ru: Существительные, функционирующие как прилагательные:
uk: Іменники, що функціонують як прикметники:

source: 3. Participial Phrases
ru: 3. Причастные обороты
uk: 3. Дієприкметникові фрази

source: Verbs in participle form (-ing or -ed) as modifiers:
ru: Глаголы в форме причастия (-ing или -ed) в качестве определителей:
uk: Дієслова у формі дієприкметника (-ing або -ed) як модифікатори:

source: 4. Prepositional Phrases
ru: 4. Предложные фразы
uk: 4. Прийменникові фрази

source: Phrases beginning with prepositions:
ru: Фразы, начинающиеся с предлогов:
uk: Фрази, що починаються з прийменників:

source: 5. Relative Clauses
ru: 5. Относительные придаточные предложения
uk: 5. Відносні підрядні речення

source: Clauses beginning with relative pronouns:
ru: Придаточные предложения, начинающиеся с относительных местоимений:
uk: Підрядні речення, що починаються з відносних займенників:

source: Position of Attributes
ru: Позиция определений
uk: Позиція означень

source: Most common position for single-word attributes
ru: Наиболее распространенная позиция для однословных определений
uk: Найпоширеніша позиція для означень з одного слова

source: Used with indefinite pronouns and certain adjectives
ru: Используется с неопределенными местоимениями и некоторыми прилагательными
uk: Використовується з неозначеними займенниками та певними прикметниками

source: Follows specific adjective order rules
ru: Соблюдает определенные правила порядка прилагательных
uk: Дотримується певних правил порядку прикметників
