Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Forming the plural of nouns that end in -y, -o, or -f/-fe.
uk: Утворення множини іменників, які закінчуються на -y, -o, або -f/-fe.

source: Nouns ending in -y
ru: Существительные, оканчивающиеся на -y
uk: Іменники, що закінчуються на -y

source: The rule for nouns ending in -y depends on the letter preceding it.
uk: Правило для іменників, що закінчуються на -y, залежить від літери, яка їй передує.

source: If a noun ends in a consonant + -y, change -y to -ies.
uk: Якщо іменник закінчується на приголосний + -y, змініть -y на -ies.

source: If a noun ends in a vowel + -y, simply add -s.
uk: Якщо іменник закінчується на голосний + -y, просто додайте -s.

source: Nouns ending in -o
ru: Существительные, оканчивающиеся на -o
uk: Іменники, що закінчуються на -o

source: For nouns ending in -o preceded by a consonant, add -es.
uk: Для іменників, що закінчуються на -o, перед якими стоїть приголосний, додайте -es.

source: Many nouns ending in -o preceded by a vowel simply add -s.
uk: Багато іменників, що закінчуються на -o, перед якими стоїть голосний, просто додають -s.

source: Common Exceptions for -o
ru: Общие исключения для -o
uk: Поширені винятки для -o

source: Nouns of foreign origin and some common nouns only add -s.
uk: Іменники іноземного походження та деякі загальні іменники додають лише -s.

source: Nouns ending in -f or -fe
ru: Существительные, оканчивающиеся на -f или -fe
uk: Іменники, що закінчуються на -f або -fe

source: Common Exceptions for -f
ru: Общие исключения для -f
uk: Поширені винятки для -f

source: Some nouns ending in -f or -fe only add -s (instead of changing f to v and adding -es).
uk: Деякі іменники, що закінчуються на -f або -fe, лише додають -s (замість зміни f на v та додавання -es).

source: Structure of a Prepositional Phrase
ru: Структура предложной фразы
uk: Структура прийменникової фрази

source: A prepositional phrase always has the following structure: Preposition + Object of Preposition (Noun/Pronoun).
uk: Прийменникова фраза завжди має таку структуру: Прийменник + Додаток прийменника (Іменник/Займенник).

source: Compound Prepositions
ru: Составные предлоги
uk: Складені прийменники

source: Some prepositions consist of more than one word. The noun or pronoun that follows is still considered the object of the preposition.
ru: Некоторые предлоги состоят из более чем одного слова. Существительное или местоимение, которое следует за ними, по-прежнему считается объектом предлога.
uk: Деякі прийменники складаються з більш ніж одного слова. Іменник або займенник, що слідує за ними, все ще вважається додатком прийменника.

source: Compound Preposition
ru: Составной предлог
uk: Складений прийменник

source: Rules for Forming the Possessive
ru: Правила образования притяжательного падежа
uk: Правила утворення присвійного відмінка

source: For a singular noun, add 's.
uk: Для іменника в однині додайте 's.

source: For a plural noun that ends in -s, add only an apostrophe (').
uk: Для іменника у множині, який закінчується на -s, додайте лише апостроф (').

source: For an irregular plural noun (not ending in -s), add 's.
uk: Для неправильного іменника у множині (який не закінчується на -s), додайте 's.

source: For a singular noun ending in -s, you can add either 's or just '.
uk: Для іменника в однині, який закінчується на -s, ви можете додати або 's, або лише '.

source: Using 'of' for Possession
ru: Использование 'of' для обозначения владения
uk: Використання 'of' для позначення володіння

source: For inanimate objects (things that are not alive), it is more common to use the preposition "of" rather than the possessive 's.
uk: Для неживих предметів (речей, які не є живими) частіше використовується прийменник "of", а не присвійний 's.

source: Less common
ru: Менее распространено
uk: Менш поширений

source: However, using the possessive 's for inanimate objects is acceptable in idiomatic and time expressions (e.g., "a week's work").
uk: Однак, використання присвійного 's для неживих предметів є прийнятним в ідіоматичних та часових виразах (наприклад, "a week's work" — робота тижня).

source: Compound Nouns and Joint Possession
ru: Составные существительные и совместное владение
uk: Складені іменники та спільне володіння

source: If two or more people own something together, add 's only to the last noun.
uk: Якщо двоє або більше людей володіють чимось разом, додайте 's лише до останнього іменника.

source: Unlike possessive pronouns ("mine," "yours"), possessive determiners are always followed by a noun.
uk: На відміну від присвійних займенників ("mine," "yours"), присвійні визначники завжди супроводжуються іменником.

source: The Possessive Determiners
ru: Притяжательные определители
uk: Присвійні визначники

source: Here is a list of the possessive determiners and the personal pronouns they correspond to:
ru: Вот список притяжательных определителей и личных местоимений, которым они соответствуют:
uk: Ось список присвійних визначників та особових займенників, яким вони відповідають:

source: Personal Pronoun
ru: Личное местоимение
uk: Особовий займенник

source: Possessive Determiner
ru: Притяжательный определитель
uk: Присвійний визначник

source: A possessive determiner cannot stand alone. It must be followed by a noun.
ru: Притяжательный определитель не может стоять один. За ним должно следовать существительное.
uk: Присвійний визначник не може стояти окремо. За ним обов'язково має слідувати іменник.

source: You do not use an article ("a," "an," "the") with a possessive determiner.
uk: Ви не використовуєте артикль ("a," "an," "the") з присвійним визначником.

source: Common Nouns
ru: Нарицательные существительные
uk: Загальні іменники

source: Person
ru: Человек
uk: Особа

source: Thing
ru: Вещь
uk: Річ

source: Idea
ru: Идея
uk: Ідея

source: Example sentences:
ru: Примеры предложений:
uk: Приклади речень:

source: Proper Nouns
ru: Имена собственные
uk: Власні іменники

source: Thing / Organization
ru: Вещь / Организация
uk: Річ / Організація

source: Date / Event
ru: Дата / Событие
uk: Дата / Подія

source: Key Rules and Summary
ru: Ключевые правила и итог
uk: Ключові правила та підсумок

source: Only capitalized at the beginning of a sentence.
ru: Пишутся с заглавной буквы только в начале предложения.
uk: Пишеться з великої літери лише на початку речення.

source: Always capitalized, regardless of their position in the sentence.
ru: Всегда пишутся с заглавной буквы, независимо от их положения в предложении.
uk: Завжди пишеться з великої літери, незалежно від позиції в реченні.

source: Quantifiers for Countable and Uncountable Nouns
ru: Квантификаторы для исчисляемых и неисчисляемых существительных
uk: Квантифікатори для злічуваних та незлічуваних іменників

source: Quantifiers are often categorized based on whether they are used with countable nouns (things you can count, e.g., 'books') or uncountable nouns (things you cannot count, e.g., 'water').
ru: Квантификаторы часто делятся на категории в зависимости от того, используются ли они с исчисляемыми существительными (вещами, которые можно посчитать, например, 'books' — книги) или неисчисляемыми существительными (вещами, которые нельзя посчитать, например, 'water' — вода).
uk: Квантифікатори часто класифікуються на основі того, чи використовуються вони зі злічуваними іменниками (речі, які можна порахувати, наприклад, 'books' – книги) чи незлічуваними іменниками (речі, які не можна порахувати, наприклад, 'water' – вода).

source: Both
ru: Оба типа
uk: Обидва

source: Common Quantifiers in Detail
ru: Подробно о распространенных квантификаторах
uk: Поширені квантифікатори детально

source: Much vs. Many
ru: Much (много) vs. Many (много)
uk: Much проти Many

source: A few vs. A little
ru: A few (несколько) vs. A little (немного)
uk: A few проти A little

source: Some vs. Any
ru: Some (некоторый) vs. Any (любой)
uk: Some проти Any

source: The majority of English nouns form their plural by adding either <span class="gram_rule">-s</span> or <span class="gram_rule">-es</span>.
uk: Більшість англійських іменників утворюють множину додаванням або <span class="gram_rule">-s</span>, або <span class="gram_rule">-es</span>.

source: Adding -s
ru: Добавление -s
uk: Додавання -s

source: For most nouns, you simply add an -s.
uk: Для більшості іменників ви просто додаєте -s.

source: Adding -es
ru: Добавление -es
uk: Додавання -es

source: You add -es to nouns ending in -s, -ss, -sh, -ch, -x, and -z.
uk: Ви додаєте -es до іменників, що закінчуються на -s, -ss, -sh, -ch, -x та -z.

source: Ending
ru: Окончание
uk: Закінчення

source: Types of Subject Complements
ru: Типы подлежащих дополнений
uk: Типи додатків до підмета

source: Predicate Nominative (Noun)
ru: Предикативное Именное (Существительное)
uk: Іменна частина складеного присудка (Іменник)

source: A predicate nominative is a noun or noun phrase that renames the subject. It is always connected to the subject by a linking verb.
ru: Предикативное именное — это существительное или именная фраза, которая переименовывает подлежащее. Оно всегда связано с подлежащим глаголом-связкой.
uk: Іменна частина складеного присудка — це іменник або іменникова фраза, яка перейменовує підмет. Вона завжди пов'язана з підметом дієсловом-зв'язкою.

source: Linking Verb
ru: Глагол-связка
uk: Дієслово-зв'язка

source: Predicate Nominative
ru: Предикативное Именное
uk: Іменна частина складеного присудка

source: Predicate Adjective (Adjective)
ru: Предикативное Прилагательное (Прилагательное)
uk: Прикметникова частина складеного присудка (Прикметник)

source: A predicate adjective is an adjective that describes the subject. It is also connected to the subject by a linking verb.
ru: Предикативное прилагательное — это прилагательное, которое описывает подлежащее. Оно также связано с подлежащим глаголом-связкой.
uk: Прикметникова частина складеного присудка — це прикметник, який описує підмет. Він також пов'язаний з підметом дієсловом-зв'язкою.

source: Predicate Adjective
ru: Предикативное Прилагательное
uk: Прикметникова частина складеного присудка

source: Common Linking Verbs
ru: Распространенные глаголы-связки
uk: Поширені дієслова-зв'язки

source: Linking verbs connect the subject to the subject complement. The most common linking verb is "to be."
uk: Дієслова-зв'язки поєднують підмет із додатком до підмета. Найпоширенішим дієсловом-зв'язкою є "to be".

source: Identifying the Subject
ru: Определение подлежащего
uk: Визначення підмета

source: The subject typically appears at the beginning of a sentence before the verb. It can be a single noun or a noun phrase.
ru: Подлежащее обычно появляется в начале предложения перед глаголом. Оно может быть одним существительным или именной фразой.
uk: Підмет зазвичай знаходиться на початку речення перед дієсловом. Це може бути окремий іменник або іменникова фраза.

source: Subject in Questions
ru: Подлежащее в вопросах
uk: Підмет у запитаннях

source: In questions, the subject often comes after a helping verb (e.g., <span class="gram_rule">Do</span> you <span class="gram_rule">know</span>...?).
uk: У запитаннях підмет часто стоїть після допоміжного дієслова (наприклад, <span class="gram_rule">Do</span> you <span class="gram_rule">know</span>...?).

source: Main Verb
ru: Основной глагол
uk: Головне дієслово

source: Subject-Verb Agreement
ru: Согласование подлежащего и сказуемого
uk: Узгодження підмета і присудка

source: The subject must agree with the verb in number. A singular subject takes a singular verb, and a plural subject takes a plural verb.
ru: Подлежащее должно согласовываться с глаголом в числе. Подлежащее в единственном числе требует глагола в единственном числе, а подлежащее во множественном числе — глагола во множественном числе.
uk: Підмет має узгоджуватися з дієсловом у числі. Підмет в однині вимагає дієслова в однині, а підмет у множині — дієслова у множині.

source: Nouns play a crucial role in sentences by performing actions or being affected by them. The main functions of a noun in a sentence are to act as the subject, the object, or the object of a preposition.
uk: Іменники відіграють вирішальну роль у реченнях, виконуючи дії або будучи об'єктом цих дій. Основні функції іменника в реченні — виступати в ролі підмета, додатка або додатка прийменника.

source: Noun as Subject
ru: Существительное в качестве подлежащего
uk: Іменник як підмет

source: A noun can also be the object of a preposition, which is the noun that follows a preposition (e.g., "in the park").
uk: Іменник також може бути додатком прийменника, тобто іменником, який слідує за прийменником (наприклад, "in the park" — у парку).

source: Basic Rules
ru: Основные правила
uk: Основні правила

source: The most fundamental rule is that a singular subject takes a singular verb, and a plural subject takes a plural verb.
ru: Самое основное правило состоит в том, что подлежащее в единственном числе требует глагола в единственном числе, а подлежащее во множественном числе — глагола во множественном числе.
uk: Найголовніше правило полягає в тому, що підмет в однині вимагає дієслова в однині, а підмет у множині — дієслова у множині.

source: Subject Type
ru: Тип подлежащего
uk: Тип підмета

source: Collective nouns (e.g., "team," "family") can take either a singular or a plural verb, depending on the context and whether they are treated as a single unit or as individuals.
uk: Збірні іменники (наприклад, "team" — команда, "family" — сім'я) можуть мати дієслово як в однині, так і у множині, залежно від контексту та того, чи розглядаються вони як єдина одиниця, чи як окремі особи.

source: Nouns joined by 'and'
ru: Существительные, соединенные 'and' (и)
uk: Іменники, з'єднані 'and' (і)

source: When two or more subjects are joined by 'and', they usually take a plural verb.
uk: Коли два або більше підметів з'єднані 'and', вони зазвичай вимагають дієслова у множині.

source: However, if the two nouns refer to a single person or idea, use a singular verb.
ru: Однако, если два существительных относятся к одному человеку или идее, используйте глагол в единственном числе.
uk: Однак, якщо два іменники стосуються однієї особи чи ідеї, використовуйте дієслово в однині.

source: Nouns joined by 'or' or 'nor'
ru: Существительные, соединенные 'or' (или) или 'nor' (ни)
uk: Іменники, з'єднані 'or' (або) чи 'nor' (ні)

source: When subjects are joined by 'or' or 'nor', the verb agrees with the subject closest to it.
uk: Коли підмети з'єднані 'or' або 'nor', дієслово узгоджується з найближчим до нього підметом.

source: Some nouns in English have the same form for both the singular and the plural. These are often called "zero plural nouns" or "invariable nouns."
uk: Деякі іменники в англійській мові мають однакову форму як для однини, так і для множини. Їх часто називають "іменниками з нульовою формою множини" або "незмінними іменниками".

source: Common Zero Plural Nouns
ru: Распространенные существительные с нулевым множественным числом
uk: Поширені іменники з нульовою формою множини

source: Many animals, especially those used for hunting or as food, have the same singular and plural form.
ru: Многие животные, особенно те, которых используют для охоты или в качестве пищи, имеют одинаковую форму в единственном и множественном числе.
uk: Багато тварин, особливо ті, що використовуються для полювання або як їжа, мають однакову форму однини та множини.

source: Singular Example
ru: Пример в единственном числе
uk: Приклад в однині

source: Plural Example
ru: Пример во множественном числе
uk: Приклад у множині

source: Other Zero Plural Nouns
ru: Другие существительные с нулевым множественным числом
uk: Інші іменники з нульовою формою множини

source: This group includes many nouns related to specific fields, foreign words, and some common nouns.
ru: Эта группа включает многие существительные, связанные со специфическими областями, иностранные слова и некоторые общие существительные.
uk: Ця група включає багато іменників, пов'язаних із конкретними сферами, іноземні слова та деякі загальні іменники.

source: Important Note
ru: Важное примечание
uk: Важливе зауваження

source: While "fish" is generally a zero plural noun, "fishes" can be used when referring to different species of fish.
uk: Хоча "fish" (риба) загалом є іменником з нульовою формою множини, "fishes" може використовуватися, коли йдеться про різні види риб.

source: Numerals: Cardinal Numerals as Nouns
ru: Числительные: Количественные числительные как существительные
uk: Числівники: Кількісні числівники як іменники

source: Numerals
ru: Числительные
uk: Числівники

source: Numerals Used as Nouns
ru: Числительные, используемые как существительные
uk: Числівники, що використовуються як іменники

source: Cardinal Numerals as Nouns
ru: Количественные числительные как существительные
uk: Кількісні числівники як іменники

source: While cardinal numerals typically modify nouns as adjectives, they can also serve as nouns themselves in various contexts. This grammatical flexibility allows for more nuanced expression in English.
ru: В то время как количественные числительные обычно определяют существительные как прилагательные, они также могут выступать в качестве самих существительных в различных контекстах. Эта грамматическая гибкость позволяет более тонко выражать мысль в английском языке.
uk: Хоча кількісні числівники зазвичай виступають у ролі означень до іменників, вони також можуть самі бути іменниками в різних контекстах. Ця граматична гнучкість дозволяє більш тонко висловлювати думки в англійській мові.

source: 1. Numerals as Independent Digits and Figures
ru: 1. Числительные как независимые цифры и числа
uk: 1. Числівники як самостійні цифри та числа

source: When referring to numbers as abstract concepts or physical representations, cardinals function as nouns and can be pluralized.
ru: При обозначении чисел как абстрактных понятий или физических представлений, количественные числительные функционируют как существительные и могут образовывать множественное число.
uk: При посиланні на числа як на абстрактні поняття або фізичні представлення, кількісні числівники функціонують як іменники і можуть мати форму множини.

source: Context
ru: Контекст
uk: Контекст

source: Abstract numbers
ru: Абстрактные числа
uk: Абстрактні числа

source: Referring to the number itself as a concept
ru: Обозначение самого числа как понятия
uk: Посиланні на саме число як на поняття

source: Physical digits
ru: Физические цифры
uk: Фізичні цифри

source: Referring to the digit representations
ru: Обозначение представлений цифр
uk: Посиланні на представлення цифр

source: Game scores
ru: Счет в игре
uk: Рахунки в іграх

source: Referring to multiple instances of the number
ru: Обозначение нескольких вхождений числа
uk: Посиланні на багаторазові випадки числа

source: Special Cases with Digits
ru: Особые случаи с цифрами
uk: Особливі випадки з цифрами

source: Binary digits:
ru: Двоичные цифры:
uk: Двійкові цифри:

source: Phone numbers:
ru: Номера телефонов:
uk: Номери телефонів:

source: Mathematical operations:
ru: Математические операции:
uk: Математичні операції:

source: 2. Approximate Large Quantities
ru: 2. Приблизительные большие количества
uk: 2. Приблизні великі кількості

source: Pluralized cardinal numbers can express indefinite large quantities, often with an implied sense of approximation.
ru: Количественные числительные во множественном числе могут выражать неопределенно большие количества, часто с подразумеваемым смыслом приблизительности.
uk: Кількісні числівники у множині можуть виражати невизначені великі кількості, часто з неявним відчуттям наближення.

source: Implied Meaning
ru: Подразумеваемое значение
uk: Приховане значення

source: approximately
ru: приблизительно
uk: приблизно

source: Intensifying Expressions
ru: Усиливающие выражения
uk: Інтенсифікуючі вирази

source: With 'of':
ru: С 'of':
uk: З 'of':

source: Compound forms:
ru: Составные формы:
uk: Складені форми:

source: Don't use articles with these plural forms: <strike>a hundreds</strike> → <span class="gram_rule">hundreds</span>
uk: Не використовуйте артиклі з цими формами множини: <strike>a hundreds</strike> → <span class="gram_rule">hundreds</span>

source: Smaller numbers (below 100) typically don't work this way: <strike>tens of people</strike> (unless in 'tens of thousands')
ru: Меньшие числа (ниже 100), как правило, не работают таким образом: <strike>tens of people</strike> (если только не в 'tens of thousands')
uk: Менші числа (до 100) зазвичай так не функціонують: <strike>tens of people</strike> (якщо тільки не в 'tens of thousands')

source: These forms imply approximation - for exact counts, use the adjective form: <span class="gram_rule">One hundred people</span>
uk: Ці форми передбачають наближення – для точних підрахунків використовуйте форму прикметника: <span class="gram_rule">One hundred people</span>

source: 3. Pronoun-like Numerical Nouns
ru: 3. Числительные-существительные, похожие на местоимения
uk: 3. Числівники-іменники, схожі на займенники

source: Numerals can replace previously mentioned nouns, functioning similarly to pronouns in context.
ru: Числительные могут заменять ранее упомянутые существительные, функционируя в контексте подобно местоимениям.
uk: Числівники можуть замінювати раніше згадані іменники, функціонуючи подібно до займенників у контексті.

source: Common Usage Patterns
ru: Распространенные модели использования
uk: Поширені моделі використання

source: After quantity specification:
ru: После указания количества:
uk: Після зазначення кількості:

source: In comparisons:
ru: В сравнениях:
uk: У порівняннях:

source: With implied objects:
ru: С подразумеваемыми объектами:
uk: Зі сховищем об'єктів:

source: Special Pronoun Cases
ru: Особые случаи местоимений
uk: Особливі випадки займенників

source: Replaces 'apple' as subject
ru: Заменяет 'apple' в качестве подлежащего
uk: Замінює 'apple' як підмет

source: Replaces understood object
ru: Заменяет подразумеваемый объект
uk: Замінює зрозумілий об'єкт

source: Shows possession
ru: Показывает принадлежность
uk: Показує володіння

source: 4. Special Numerical Noun Forms
ru: 4. Особые числовые формы существительных
uk: 4. Спеціальні числові форми іменників

source: Collective Group References
ru: Обозначение коллективных групп
uk: Посилання на збірні групи

source: Age groups:
ru: Возрастные группы:
uk: Вікові групи:

source: Sports teams:
ru: Спортивные команды:
uk: Спортивні команди:

source: Historical groups:
ru: Исторические группы:
uk: Історичні групи:

source: Idiomatic Expressions
ru: Идиоматические выражения
uk: Ідіоматичні вирази

source: In a state of confusion
ru: В состоянии замешательства
uk: У стані розгубленості

source: The general population
ru: Общее население
uk: Загальне населення

source: An impressive group
ru: Впечатляющая группа
uk: Вражаюча група

source: Cardinal vs. Noun Usage Comparison
ru: Сравнение использования количественных числительных и существительных
uk: Порівняння використання кількісних числівників як прикметників і як іменників

source: Adjective Form
ru: Форма прилагательного
uk: Форма прикметника

source: Noun Form
ru: Форма существительного
uk: Форма іменника

source: Modifying
ru: Определение
uk: Означення

source: Pluralizing
ru: Образование множественного числа
uk: Утворення множини

source: Not applicable
ru: Неприменимо
uk: Не застосовується

source: Back to Numerals
ru: Назад к числительным
uk: Повернутися до числівників

source: Numerals: Cardinal Numerals - Definition and Formation
ru: Числительные: Количественные числительные - Определение и образование
uk: Числівники: Кількісні числівники – Визначення та утворення

source: Cardinal Numerals
ru: Количественные числительные
uk: Кількісні числівники

source: Definition and Formation
ru: Определение и образование
uk: Визначення та утворення
