Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Narrow meaning
ru: Сужают значение
uk: Звуження значення

source: Position Rules for Adverb-Adverb Modification
ru: Правила позиционирования при модификации наречия-наречием
uk: Правила позиції для модифікації прислівник-прислівник

source: General Pattern:
ru: Общий шаблон:
uk: Загальний шаблон:

source: Modifying adverb + Modified adverb
ru: Модифицирующее наречие + Модифицируемое наречие
uk: Модифікуючий прислівник + Модифікований прислівник

source: Common Combinations:
ru: Распространенные сочетания:
uk: Поширені комбінації:

source: Degree adverbs + adverbs of manner
ru: Наречия степени + наречия образа действия
uk: Прислівники ступеня + прислівники способу дії

source: Focus adverbs + adverbs of frequency
ru: Фокусирующие наречия + наречия частоты
uk: Фокусуючі прислівники + прислівники частоти

source: Modification Patterns Compared
ru: Сравнение шаблонов модификации
uk: Порівняння шаблонів модифікації

source: Modified Element
ru: Модифицируемый элемент
uk: Модифікований елемент

source: Typical Position
ru: Типичная позиция
uk: Типова позиція

source: After verb (usually)
ru: После глагола (обычно)
uk: Після дієслова (зазвичай)

source: Before adjective
ru: Перед прилагательным
uk: Перед прикметником

source: Before adverb
ru: Перед наречием
uk: Перед прислівником

source: Common Adverb Mistakes
ru: Распространенные ошибки с наречиями
uk: Поширені помилки з прислівниками

source: Identify what each underlined adverb modifies (verb, adjective, or other adverb):
ru: Определите, что модифицирует каждое подчеркнутое наречие (глагол, прилагательное или другое наречие):
uk: Визначте, що модифікує кожен підкреслений прислівник (дієслово, прикметник чи інший прислівник):

source: Adverbs: Order of Adverbs
ru: Наречия: Порядок наречий
uk: Прислівники: Порядок прислівників

source: Order of Adverbs
ru: Порядок наречий
uk: Порядок прислівників

source: Mastering Adverb Order in English Sentences
ru: Освоение порядка наречий в английских предложениях
uk: Освоєння порядку прислівників в англійських реченнях

source: Proper adverb ordering creates clear, natural-sounding English. The standard sequence follows the <span class=\
uk: Правильний порядок прислівників створює чітку, природну англійську мову. Стандартна послідовність відповідає <span class=\

source: The Fundamental MPT Rule
ru: Фундаментальное правило ММВ (Образ действия - Место - Время)
uk: Фундаментальне правило MPT

source: Complete MPT Examples:
ru: Полные примеры ММВ:
uk: Повні приклади MPT:

source: Partial Combinations:
ru: Частичные комбинации:
uk: Часткові комбінації:

source: Combination
ru: Комбинация
uk: Комбінація

source: Manner + Place
ru: Образ действия + Место
uk: Спосіб дії + Місце

source: Place + Time
ru: Место + Время
uk: Місце + Час

source: Manner + Time
ru: Образ действия + Время
uk: Спосіб дії + Час

source: Extended Adverb Order (MPTF)
ru: Расширенный порядок наречий (ММВЧ - Образ действия - Место - Время - Частота)
uk: Розширений порядок прислівників (MPTF)

source: When including frequency adverbs, the expanded order becomes:
ru: При включении наречий частоты расширенный порядок становится следующим:
uk: При включенні прислівників частоти розширений порядок стає таким:

source: Examples with Frequency:
ru: Примеры с частотой:
uk: Приклади з частотою:

source: Frequency Adverb Placement Rules:
ru: Правила размещения наречий частоты:
uk: Правила розміщення прислівників частоти:

source: Mid-position
ru: Средняя позиция
uk: Середня позиція

source: Single-word frequency
ru: Частота, выраженная одним словом
uk: Частота одним словом

source: End position
ru: Конечная позиция
uk: Кінцева позиція

source: Phrasal frequency
ru: Частота, выраженная фразой
uk: Частота фразою

source: 1. Degree Adverbs
ru: 1. Наречия степени
uk: 1. Прислівники ступеня

source: These modify specific words and appear immediately before them:
ru: Они модифицируют конкретные слова и ставятся непосредственно перед ними:
uk: Вони модифікують конкретні слова і стоять безпосередньо перед ними:

source: 2. Focusing Adverbs
ru: 2. Фокусирующие наречия
uk: 2. Фокусуючі прислівники

source: These emphasize specific elements and have flexible placement:
ru: Они подчеркивают конкретные элементы и имеют гибкое размещение:
uk: Вони наголошують на конкретних елементах і мають гнучке розміщення:

source: 3. Sentence Adverbs
ru: 3. Наречия, модифицирующие предложения
uk: 3. Прислівники-модифікатори речень

source: These modify whole sentences and typically appear at the beginning:
ru: Они модифицируют целые предложения и обычно стоят в начале:
uk: Вони модифікують цілі речення і зазвичай стоять на початку:

source: Common Mistakes and Corrections
ru: Распространенные ошибки и исправления
uk: Поширені помилки та виправлення

source: Error Type
ru: Тип ошибки
uk: Тип помилки

source: Incorrect
ru: Неправильно
uk: Неправильно

source: Correct
ru: Правильно
uk: Правильно

source: MPT order violation
ru: Нарушение порядка ММВ
uk: Порушення порядку MPT

source: Degree adverb placement
ru: Размещение наречия степени
uk: Розміщення прислівника ступеня

source: Frequency with MPT
ru: Частота с ММВ
uk: Частота з MPT

source: Adverbs: Placement for Specific Adverb Types
ru: Наречия: Размещение для конкретных типов наречий
uk: Прислівники: Розміщення для конкретних типів прислівників

source: Adverb Placement by Type
ru: Размещение наречий по типу
uk: Розміщення прислівників за типом

source: Different types of adverbs have specific placement rules that help convey meaning clearly and naturally in English sentences.
ru: Различные типы наречий имеют определенные правила размещения, которые помогают четко и естественно передавать смысл в английских предложениях.
uk: Різні типи прислівників мають конкретні правила розміщення, які допомагають чітко та природно передати значення в англійських реченнях.

source: These describe <span class=\
uk: Вони описують <span class=\

source: Standard Placement Rules:
ru: Стандартные правила размещения:
uk: Стандартні правила розміщення:

source: Situation
ru: Ситуация
uk: Ситуація

source: Notes
ru: Примечания
uk: Примітки

source: With phrasal verbs
ru: С фразовыми глаголами
uk: З фразовими дієсловами

source: After the particle
ru: После частицы
uk: Після частки

source: With passive voice
ru: С пассивным залогом
uk: З пасивним станом

source: Before or after 'by' phrase
ru: До или после фразы с 'by'
uk: Перед або після фрази з 'by'

source: With 'well'
ru: С 'well'
uk: З 'well'

source: Never mid-position
ru: Никогда в средней позиции
uk: Ніколи не в середній позиції

source: 2. Adverbs of Frequency
ru: 2. Наречия частоты
uk: 2. Прислівники частоти

source: These indicate <span class=\
ru: Они указывают <span class=\
uk: Вони вказують <span class=\

source: Simple tenses
ru: Простые времена
uk: Прості часи

source: Before main verb
ru: Перед основным глаголом
uk: Перед основним дієсловом

source: Verb 'to be'
ru: Глагол 'to be'
uk: Дієслово 'to be'

source: Auxiliary verbs
ru: Вспомогательные глаголы
uk: Допоміжні дієслова

source: Emphatic position
ru: Эмфатическая позиция
uk: Емфатична позиція

source: Beginning of sentence
ru: Начало предложения
uk: Початок речення

source: Frequency Scale:
ru: Шкала частоты:
uk: Шкала частоти:

source: 100%% - always, constantly
ru: 100%% - always (всегда), constantly (постоянно)
uk: 100%% - завжди, постійно

source: 90%% - usually, normally
ru: 90%% - usually (обычно), normally (в норме)
uk: 90%% - зазвичай, нормально

source: 70%% - often, frequently
ru: 70%% - often (часто), frequently (зачастую)
uk: 70%% - часто, нерідко

source: 50%% - sometimes, occasionally
ru: 50%% - sometimes (иногда), occasionally (время от времени)
uk: 50%% - іноді, час від часу

source: 10%% - rarely, seldom
ru: 10%% - rarely (редко), seldom (почти никогда)
uk: 10%% - рідко, зрідка

source: 0%% - never
ru: 0%% - never (никогда)
uk: 0%% - ніколи

source: 3. Adverbs of Degree
ru: 3. Наречия степени
uk: 3. Прислівники ступеня

source: These modify adjectives, adverbs, or verbs to show <span class=\
ru: Они модифицируют прилагательные, наречия или глаголы, чтобы показать <span class=\
uk: Вони модифікують прикметники, прислівники або дієслова, щоб показати <span class=\

source: Common Adverbs of Degree:
ru: Распространенные наречия степени:
uk: Поширені прислівники ступеня:

source: Modifies
ru: Модифицирует
uk: Модифікує

source: Adjectives/adverbs
ru: Прилагательные/наречия
uk: Прикметники/прислівники

source: Negative excess
ru: Отрицательный избыток
uk: Негативний надлишок

source: Verbs
ru: Глаголы
uk: Дієслова

source: Moderate degree
ru: Умеренная степень
uk: Помірний ступінь

source: Additional Adverb Types
ru: Дополнительные типы наречий
uk: Додаткові типи прислівників

source: 4. Adverbs of Time
ru: 4. Наречия времени
uk: 4. Прислівники часу

source: 5. Adverbs of Place
ru: 5. Наречия места
uk: 5. Прислівники місця

source: 6. Comment Adverbs
ru: 6. Комментирующие наречия
uk: 6. Прислівники-коментатори

source: Common Mistakes with Adverb Placement
ru: Распространенные ошибки в размещении наречий
uk: Поширені помилки з розміщенням прислівників

source: Manner adverb mid-position
ru: Наречие образа действия в средней позиции
uk: Прислівник способу дії в середній позиції

source: Frequency with 'to be'
ru: Частота с 'to be'
uk: Частота з 'to be'

source: Degree adverb position
ru: Позиция наречия степени
uk: Позиція прислівника ступеня

source: Time adverb order
ru: Порядок наречий времени
uk: Порядок прислівника часу

source: Adverbs: Degrees of Comparison
ru: Наречия: Степени сравнения
uk: Прислівники: Ступені порівняння

source: Mastering Adverb Comparison
ru: Освоение сравнения наречий
uk: Освоєння порівняння прислівників

source: Adverbs, like adjectives, can express different degrees of intensity through comparative and superlative forms, allowing precise comparisons between actions and qualities.
ru: Наречия, как и прилагательные, могут выражать разные степени интенсивности через сравнительную и превосходную формы, позволяя проводить точные сравнения между действиями и качествами.
uk: Прислівники, як і прикметники, можуть виражати різні ступені інтенсивності за допомогою порівняльних та найвищих форм, дозволяючи точні порівняння між діями та якостями.

source: 1. Formation Rules
ru: 1. Правила образования
uk: 1. Правила утворення

source: Regular Adverb Comparison
ru: Правильное сравнение наречий
uk: Регулярне порівняння прислівників

source: One-syllable adverbs
ru: Односложные наречия
uk: Односкладові прислівники

source: Adverbs ending in -ly
ru: Наречия, оканчивающиеся на -ly
uk: Прислівники, що закінчуються на -ly

source: more / most + adverb
ru: more / most + наречие
uk: more / most + прислівник

source: Unique forms
ru: Уникальные формы
uk: Унікальні форми

source: Detailed Formation Guide
ru: Подробное руководство по образованию
uk: Детальний посібник з утворення

source: 2. Irregular Adverb Comparisons
ru: 2. Неправильное сравнение наречий
uk: 2. Нерегулярні порівняння прислівників

source: Exceptions to the Rules
ru: Исключения из правил
uk: Винятки з правил

source: Special Notes on Irregular Forms
ru: Особые примечания о неправильных формах
uk: Спеціальні примітки щодо нерегулярних форм

source: 3. Usage in Sentences
ru: 3. Использование в предложениях
uk: 3. Використання в реченнях

source: Comparative and Superlative Structures
ru: Сравнительные и превосходные конструкции
uk: Порівняльні та найвищі структури

source: Structure
ru: Структура
uk: Структура

source: adverb + than
ru: наречие + than (чем)
uk: прислівник + than

source: the + superlative adverb
ru: the + наречие в превосходной степени
uk: the + прислівник у найвищому ступені

source: Equality
ru: Равенство
uk: Рівність

source: as + adverb + as
ru: as + наречие + as (так же ... как)
uk: as + прислівник + as

source: Negative equality
ru: Отрицательное равенство
uk: Негативна рівність

source: not as/so + adverb + as
ru: not as/so + наречие + as (не так ... как)
uk: not as/so + прислівник + as

source: Special Comparative Forms
ru: Особые сравнительные формы
uk: Спеціальні порівняльні форми

source: Common Errors and Important Notes
ru: Распространенные ошибки и важные примечания
uk: Поширені помилки та важливі примітки

source: Provide the comparative and superlative forms:
ru: Укажите сравнительную и превосходную формы:
uk: Наведіть порівняльну та найвищу форми:

source: Complete these sentences correctly:
ru: Завершите эти предложения правильно:
uk: Доповніть ці речення правильно:

source: Placement of Articles: After Determiners
ru: Размещение артиклей: После определителей
uk: Розміщення артиклів: Після детермінативів

source: Articles
ru: Артикли
uk: Артиклі

source: Placement of Articles
ru: Размещение артиклей
uk: Розміщення артиклів

source: After Determiners
ru: После определителей
uk: Після детермінативів

source: A key rule to remember about articles is that they are a type of determiner. You cannot use two determiners for the same noun at the same time. Therefore, articles are not used after other determiners like possessive adjectives or demonstratives.
ru: Ключевое правило, которое нужно помнить об артиклях, заключается в том, что они являются типом определителя. Вы не можете использовать два определителя для одного и того же существительного одновременно. Следовательно, артикли не используются после других определителей, таких как притяжательные прилагательные или указательные местоимения.
uk: Ключове правило, яке слід пам’ятати про артиклі, полягає в тому, що вони є типом детермінативів. Ви не можете використовувати два детермінативи для одного й того ж іменника одночасно. Тому артиклі не використовуються після інших детермінативів, таких як присвійні прикметники або вказівні займенники.

source: 1. With Possessive Adjectives
ru: 1. С притяжательными прилагательными
uk: 1. З присвійними прикметниками

source: Possessive adjectives (<span class=\
ru: Притяжательные прилагательные (<span class=\
uk: Присвійні прикметники (<span class=\

source: 2. With Demonstratives
ru: 2. С указательными местоимениями
uk: 2. З вказівними займенниками

source: Demonstratives (<span class=\
ru: Указательные местоимения (<span class=\
uk: Вказівні займенники (<span class=\

source: Summary
ru: Краткое изложение
uk: Підсумок

source: Think of it this way: articles and other determiners are like single-use tickets for a noun. Once you use a ticket (<span class=\
ru: Думайте об этом так: артикли и другие определители похожи на одноразовые билеты для существительного. Как только вы используете билет (<span class=\
uk: Уявіть це так: артиклі та інші детермінативи схожі на одноразові квитки для іменника. Щойно ви використали один квиток (<span class=\

source: Back to Articles
ru: Назад к Артиклям
uk: Повернутися до Артиклів

source: Placement of Articles: Before Adjective
ru: Размещение артиклей: Перед прилагательным
uk: Розміщення артиклів: Перед прикметником

source: Before Adjective
ru: Перед прилагательным
uk: Перед прикметником

source: When a noun is modified by an adjective, the article moves to a position before the adjective. The structure becomes: <strong>Article + Adjective + Noun</strong>. The article still modifies the noun, but the adjective is placed between them to describe the noun.
ru: Когда существительное модифицируется прилагательным, артикль перемещается в позицию перед прилагательным. Структура становится: <strong>Артикль + Прилагательное + Существительное</strong>. Артикль по-прежнему модифицирует существительное, но прилагательное ставится между ними, чтобы описать это существительное.
uk: Коли іменник модифікується прикметником, артикль переміщується на позицію перед прикметником. Структура стає: <strong>Артикль + Прикметник + Іменник</strong>. Артикль усе ще модифікує іменник, але прикметник розміщується між ними, щоб описати іменник.

source: 1. With Indefinite Articles ('a' and 'an')
ru: 1. С неопределенными артиклями ('a' и 'an')
uk: 1. З неозначеними артиклями ('a' та 'an')

source: Remember that the choice between <span class=\
ru: Помните, что выбор между <span class=\
uk: Пам'ятайте, що вибір між <span class=\

source: 2. With the Definite Article ('the')
ru: 2. С определенным артиклем ('the')
uk: 2. З означеним артиклем ('the')

source: The definite article <span class=\
ru: Определенный артикль <span class=\
uk: Означений артикль <span class=\

source: The general rule remains the same: the article is the first word of the noun phrase. The only thing that changes is that an adjective can be placed between the article and the noun.
ru: Общее правило остается тем же: артикль — это первое слово именной фразы. Единственное, что меняется, это то, что прилагательное может быть размещено между артиклем и существительным.
uk: Загальне правило залишається незмінним: артикль є першим словом іменної фрази. Єдине, що змінюється, це те, що прикметник може бути розміщений між артиклем та іменником.

source: Placement of Articles: Before Noun
ru: Размещение артиклей: Перед существительным
uk: Розміщення артиклів: Перед іменником

source: Before Noun
ru: Перед существительным
uk: Перед іменником

source: The most fundamental rule for article placement is that the article comes directly before the noun it modifies. This structure is used when there are no other words (like adjectives) between the article and the noun.
ru: Самое основное правило размещения артиклей — артикль ставится непосредственно перед существительным, которое он модифицирует. Эта структура используется, когда между артиклем и существительным нет других слов (например, прилагательных).
uk: Найбільш фундаментальне правило розміщення артикля полягає в тому, що артикль стоїть безпосередньо перед іменником, який він модифікує. Ця структура використовується, коли між артиклем та іменником немає інших слів (наприклад, прикметників).

source: 1. With Singular Countable Nouns
ru: 1. С существительными в единственном числе, которые можно посчитать
uk: 1. З одниною злічуваних іменників

source: When you use an article with a singular countable noun, the article is placed right before it.
ru: Когда вы используете артикль с исчисляемым существительным в единственном числе, артикль ставится прямо перед ним.
uk: Коли ви використовуєте артикль з іменником в однині, який можна злічити, артикль ставиться безпосередньо перед ним.

source: Article
ru: Артикль
uk: Артикль

source: 2. With Uncountable Nouns
ru: 2. С неисчисляемыми существительными
uk: 2. З незлічуваними іменниками

source: When using the definite article with an uncountable noun, it also comes directly before the noun.
ru: При использовании определенного артикля с неисчисляемым существительным, он также ставится непосредственно перед существительным.
uk: При використанні означеного артикля з незлічуваним іменником, він також стоїть безпосередньо перед іменником.

source: Why is this important?
ru: Почему это важно?
uk: Чому це важливо?

source: Understanding this basic placement rule is the first step before learning how other words, like adjectives, can be inserted between the article and the noun. It's the simplest and most common structure for article usage.
ru: Понимание этого основного правила размещения является первым шагом перед изучением того, как другие слова, например прилагательные, могут быть вставлены между артиклем и существительным. Это самая простая и распространенная структура использования артиклей.
uk: Розуміння цього базового правила розміщення є першим кроком перед тим, як дізнатися, як інші слова, наприклад прикметники, можуть бути вставлені між артиклем та іменником. Це найпростіша та найпоширеніша структура використання артикля.

source: Core Function: Specificity
ru: Основная функция: Специфичность (Определенность)
uk: Основна функція: Специфічність

source: The Definite Article 'The'
ru: Определенный артикль 'The'
uk: Означений артикль 'The'

source: The primary role of the definite article <span class=\
ru: Основная роль определенного артикля <span class=\
uk: Першочергова роль означеного артикля <span class=\

source: When to Use 'the' for Specificity
ru: Когда использовать 'the' для указания на определенность
uk: Коли використовувати 'the' для специфічності

source: The definite article is used when the noun is identifiable to both the speaker and the listener. This can happen in several ways.
ru: Определенный артикль используется, когда существительное может быть идентифицировано как говорящим, так и слушающим. Это может происходить несколькими способами.
uk: Означений артикль використовується, коли іменник є ідентифікованим як для мовця, так і для слухача. Це може статися кількома способами.

source: The noun is mentioned a second time.
ru: Существительное упоминается во второй раз.
uk: Іменник згадується вдруге.

source: The noun is unique or one-of-a-kind.
ru: Существительное является уникальным или единственным в своем роде.
uk: Іменник є унікальним або єдиним у своєму роді.

source: The noun is made specific by a phrase or clause.
ru: Существительное конкретизируется фразой или придаточным предложением.
uk: Іменник стає конкретним завдяки фразі або підрядному реченню.

source: The noun is understood from the context.
ru: Существительное понятно из контекста.
uk: Іменник зрозумілий із контексту.

source: Comparing 'a/an' and 'the'
ru: Сравнение 'a/an' и 'the'
uk: Порівняння 'a/an' та 'the'

source: Understanding the difference between the indefinite and definite articles is key to mastering their usage.
ru: Понимание разницы между неопределенным и определенным артиклями является ключом к освоению их использования.
uk: Розуміння різниці між неозначеним та означеним артиклями є ключем до оволодіння їхнім використанням.

source: Back to Noun
ru: Назад к Существительным
uk: Повернутися до Іменника

source: Introduction to Articles
ru: Введение в артикли
uk: Вступ до артиклів

source: What Articles Do
ru: Что делают артикли
uk: Що роблять артиклі

source: Articles are essential because they tell the listener or reader whether the noun being referred to is a specific item or a general one.
ru: Артикли необходимы, потому что они сообщают слушателю или читателю, является ли существительное, о котором идет речь, конкретным или общим.
uk: Артиклі є важливими, оскільки вони повідомляють слухачеві чи читачеві, чи є іменник, до якого звертаються, конкретним предметом чи загальним.

source: Indefinite Article (a/an):
ru: Неопределенный артикль (a/an):
uk: Неозначений артикль (a/an):

source: Refers to a non-specific or general noun. It's used when we talk about something for the first time.
ru: Относится к неопределенному или общему существительному. Используется, когда мы говорим о чем-то в первый раз.
uk: Стосується неспецифічного або загального іменника. Використовується, коли ми говоримо про щось вперше.

source: This could be any dog.
ru: Это может быть любая собака.
uk: Це може бути будь-який собака.

source: Definite Article (the):
ru: Определенный артикль (the):
uk: Означений артикль (the):

source: Refers to a specific or already known noun. It's used when we are talking about a specific item that both the speaker and listener know.
ru: Относится к конкретному или уже известному существительному. Используется, когда мы говорим о конкретном предмете, который известен как говорящему, так и слушающему.
uk: Стосується конкретного або вже відомого іменника. Використовується, коли ми говоримо про конкретний предмет, який знають і мовець, і слухач.

source: We both know which dog I'm talking about.
ru: Мы оба знаем, о какой собаке я говорю.
uk: Ми обоє знаємо, про якого собаку я говорю.

source: Main Types of Articles
ru: Основные типы артиклей
uk: Основні типи артиклів

source: Article Type
ru: Тип артикля
uk: Тип артикля

source: Forms
ru: Формы
uk: Форми

source: Usage
ru: Использование
uk: Вживання

source: Indefinite
ru: Неопределенный
uk: Неозначений
