Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: 3. Negative Forms: Absence of Obligation
ru: 3. Отрицательные формы: Отсутствие обязанности
uk: 3. Заперечні Форми: Відсутність Обов'язку

source: Both \
ru: Обе формы \
uk: Обидва \

source: More common and usable in all tenses.
ru: Более распространен и применим во **всех временах**.
uk: Більш поширений і використовується у всіх часах.

source: Less common, mainly in present, and typically used in British English.
ru: Менее распространен, в основном в настоящем времени, и обычно используется в британском английском.
uk: Менш поширений, головним чином у теперішньому часі, і зазвичай використовується в британській англійській.

source: Neither \
ru: Ни один из \
uk: Жоден \

source: Forms of May / Might
ru: Формы May / Might
uk: Форми May / Might

source: Like other modal verbs, \
ru: Как и другие модальные глаголы, \
uk: Як і інші модальні дієслова, \

source: 1. May (Present / Future)
ru: 1. May (Настоящее / Будущее)
uk: 1. May (Теперішній / Майбутній)

source: Subject + may + Base Verb
ru: Подлежащее + may + Базовый глагол
uk: Підмет + may + Базова форма дієслова

source: Subject + may not + Base Verb
ru: Подлежащее + may not + Базовый глагол
uk: Підмет + may not + Базова форма дієслова

source: May + Subject + Base Verb?
ru: May + Подлежащее + Базовый глагол?
uk: May + Підмет + Базова форма дієслова?

source: 2. Might (Past / Weaker Possibility / Conditional)
ru: 2. Might (Прошедшее / Более слабая возможность / Условное)
uk: 2. Might (Минулий / Слабша Можливість / Умовний)

source: Subject + might + Base Verb
ru: Подлежащее + might + Базовый глагол
uk: Підмет + might + Базова форма дієслова

source: Subject + might not + Base Verb
ru: Подлежащее + might not + Базовый глагол
uk: Підмет + might not + Базова форма дієслова

source: Might + Subject + Base Verb?
ru: Might + Подлежащее + Базовый глагол?
uk: Might + Підмет + Базова форма дієслова?

source: Less common for questions
ru: Менее распространен для вопросов
uk: Менш поширений для питань

source: Very formal/polite
ru: Очень формально/вежливо
uk: Дуже формально/ввічливо

source: 3. May/Might have + Past Participle (Past Possibility / Speculation)
ru: 3. May/Might have + Причастие прошедшего времени (Прошлая возможность / Предположение)
uk: 3. May/Might have + Дієприкметник минулого часу (Минула Можливість / Припущення)

source: This form is used to speculate about past events or to express a possibility that something happened in the past.
ru: Эта форма используется для предположений о прошлых событиях или для выражения возможности того, что что-то произошло в прошлом.
uk: Ця форма використовується для припущень про минулі події або для вираження можливості того, що щось сталося в минулому.

source: Subject + may/might have + Past Participle
ru: Подлежащее + may/might have + Причастие прошедшего времени
uk: Підмет + may/might have + Дієприкметник минулого часу

source: Subject + may not have / might not have + Past Participle
ru: Подлежащее + may not have / might not have + Причастие прошедшего времени
uk: Підмет + may not have / might not have + Дієприкметник минулого часу

source: Use of May / Might
ru: Использование May / Might
uk: Використання May / Might

source: 1. Expressing Possibility
ru: 1. Выражение возможности
uk: 1. Вираження Можливості

source: May (Stronger/General Possibility):
ru: May (Более сильная/Общая возможность):
uk: May (Сильніша/Загальна Можливість):

source: Indicates a reasonable chance or general possibility in the present or future.
ru: Указывает на разумный шанс или общую возможность в настоящем или будущем.
uk: Вказує на розумний шанс або загальну можливість у теперішньому або майбутньому часі.

source: There's a good chance
ru: Есть хороший шанс
uk: Є хороший шанс

source: Might (Weaker/Remote Possibility):
ru: Might (Более слабая/Отдаленная возможность):
uk: Might (Слабша/Віддалена Можливість):

source: Suggests a lower degree of certainty or a more remote possibility.
ru: Предполагает более низкую степень уверенности или более отдаленную возможность.
uk: Пропонує нижчий ступінь впевненості або більш віддалену можливість.

source: May/Might have + Past Participle (Past Possibility / Speculation):
ru: May/Might have + Причастие прошедшего времени (Прошлая возможность / Предположение):
uk: May/Might have + Дієприкметник минулого часу (Минула Можливість / Припущення):

source: Used to make guesses or assumptions about what happened in the past.
ru: Используется для построения догадок или предположений о том, что произошло в прошлом.
uk: Використовується для припущень або здогадок про те, що сталося в минулому.

source: 2. Giving / Asking for Permission
ru: 2. Предоставление / Запрос разрешения
uk: 2. Надання / Запит Дозволу

source: May (Formal Permission):
ru: May (Формальное разрешение):
uk: May (Формальний Дозвіл):

source: Used in more formal contexts for granting or requesting permission. It is considered more polite than \
ru: Используется в более формальных контекстах для предоставления или запроса разрешения. Считается более вежливым, чем \
uk: Використовується у більш формальних контекстах для надання або запиту дозволу. Вважається більш ввічливим, ніж \

source: Asking for permission politely
ru: Вежливый запрос разрешения
uk: Ввічливий запит дозволу

source: Might (Rarely for Permission, very formal/hesitant):
ru: Might (Редко для разрешения, очень формально/нерешительно):
uk: Might (Рідко для Дозволу, дуже формально/невпевнено):

source: While grammatically possible, \
ru: Хотя грамматически возможно, \
uk: Хоча граматично можливо, \

source: Very polite suggestion, not direct permission
ru: Очень вежливое предложение, а не прямое разрешение
uk: Дуже ввічлива пропозиція, а не прямий дозвіл

source: 3. Expressing Wishes or Hopes (Primarily \
ru: 3. Выражение пожеланий или надежд (В основном \
uk: 3. Вираження Побажань або Надій (Переважно \

source: Used in formal or literary contexts to express wishes or hopes.
ru: Используется в формальных или литературных контекстах для выражения пожеланий или надежд.
uk: Використовується у формальних або літературних контекстах для вираження побажань або надій.

source: 4. Making Polite Suggestions or Giving Advice (Primarily \
ru: 4. Вежливые предложения или советы (В основном \
uk: 4. Складання Ввічливих Пропозицій або Надання Порад (Переважно \

source: Used to offer gentle advice or a hesitant suggestion.
ru: Используется для того, чтобы предложить мягкий совет или нерешительное предложение.
uk: Використовується для надання м'якої поради або нерішучої пропозиції.

source: 5. In Reported Speech
ru: 5. В косвенной речи
uk: 5. У Непрямій Мові

source: often serves as the past equivalent of \
ru: часто служит эквивалентом \
uk: часто слугує минулим еквівалентом \

source: Reported:
ru: Косвенная речь:
uk: У Непрямій мові:

source: Forms of Must / Have to
ru: Формы Must / Have to
uk: Форми Must / Have to

source: As a modal verb, \
ru: Как модальный глагол, \
uk: Як модальне дієслово, \

source: 1. Must (Present / Future Obligation or Deduction)
ru: 1. Must (Настоящее / Будущее — обязанность или вывод)
uk: 1. Must (Теперішній / Майбутній Обов'язок або Висновок)

source: Subject + must + Base Verb
ru: Подлежащее + must + Базовый глагол
uk: Підмет + must + Базова форма дієслова

source: Subject + must not / mustn't + Base Verb
ru: Подлежащее + must not / mustn't + Базовый глагол
uk: Підмет + must not / mustn't + Базова форма дієслова

source: Must + Subject + Base Verb?
ru: Must + Подлежащее + Базовый глагол?
uk: Must + Підмет + Базова форма дієслова?

source: Rare, very formal
ru: Редко, очень формально
uk: Рідко, дуже формально

source: 2. Have to (All Tenses for Obligation)
ru: 2. Have to (Все времена для обязанности)
uk: 2. Have to (Усі часи для Обов'язку)

source: Continuous Forms
ru: Продолженные формы
uk: Тривалі форми

source: Less common for obligation
ru: Менее распространены для выражения обязанности
uk: Менш поширений для позначення обов'язку

source: 3. Must have + Past Participle (Past Deduction)
ru: 3. Must have + Причастие прошедшего времени (Прошлый вывод)
uk: 3. Must have + Дієприкметник минулого часу (Висновок про минуле)

source: Used to express a strong certainty or logical conclusion about a past event.
ru: Используется для выражения сильной уверенности или логического вывода о прошлом событии.
uk: Використовується для вираження сильної впевненості або логічного висновку щодо минулої події.

source: Subject + must have + Past Participle
ru: Подлежащее + must have + Причастие прошедшего времени
uk: Підмет + must have + Дієприкметник минулого часу

source: Not used with 'must have' for past deduction; use 'can't have' or 'couldn't have'
ru: Не используется с 'must have' для выражения прошлого вывода; используйте 'can't have' или 'couldn't have'
uk: Не використовується з 'must have' для висновків про минуле; використовуйте 'can't have' або 'couldn't have'

source: Use of Must / Have to
ru: Использование Must / Have to
uk: Використання Must / Have to

source: While both \
ru: Хотя оба \
uk: Хоча обидва \

source: Must (Internal Obligation / Speaker's Authority):
ru: Must (Внутренняя обязанность / Авторитет говорящего):
uk: Must (Внутрішній Обов'язок / Авторитет Мовця):

source: Used when the obligation comes from the speaker, or the speaker feels it is very important. It implies personal conviction or a strong recommendation.
ru: Используется, когда обязанность исходит от говорящего, или говорящий считает ее очень важной. Подразумевает **личное убеждение** или **настоятельную рекомендацию**.
uk: Використовується, коли обов'язок походить від мовця, або мовець вважає його дуже важливим. Це передбачає особисте переконання або сильну рекомендацію.

source: Internal necessity/personal feeling
ru: Внутренняя необходимость/личное чувство
uk: Внутрішня необхідність/особисте почуття

source: Speaker's command/strong advice
ru: Приказ/настоятельный совет говорящего
uk: Наказ мовця/сильна порада

source: Strong belief/necessity
ru: Сильное убеждение/необходимость
uk: Сильне переконання/необхідність

source: Have to (External Obligation / Rules / Circumstances):
ru: Have to (Внешняя обязанность / Правила / Обстоятельства):
uk: Have to (Зовнішній Обов'язок / Правила / Обставини):

source: Used when the obligation is imposed by external circumstances, rules, laws, or another authority.
ru: Используется, когда обязанность налагается **внешними обстоятельствами**, правилами, законами или другим авторитетом.
uk: Використовується, коли обов'язок накладається зовнішніми обставинами, правилами, законами або іншим авторитетом.

source: External requirement – my job demands it
ru: Внешнее требование – моя работа этого требует
uk: Зовнішня вимога – моя робота цього вимагає

source: School rule
ru: Школьное правило
uk: Шкільне правило

source: Circumstance
ru: Обстоятельство
uk: Обставина

source: In informal spoken English, \
ru: В неформальной разговорной речи \
uk: У неформальній розмовній англійській, \

source: 2. Expressing Prohibition (Must not / Mustn't)
ru: 2. Выражение запрета (Must not / Mustn't)
uk: 2. Вираження Заборони (Must not / Mustn't)

source: Rule/Prohibition
ru: Правило/Запрет
uk: Правило/Заборона

source: Strong advice/prohibition from speaker
ru: Настоятельный совет/запрет от говорящего
uk: Сильна порада/заборона від мовця

source: 3. Expressing Absence of Obligation (Don't have to / Doesn't have to)
ru: 3. Выражение отсутствия обязанности (Don't have to / Doesn't have to)
uk: 3. Вираження Відсутності Обов'язку (Don't have to / Doesn't have to)

source: The negative form of \
ru: Отрицательная форма \
uk: Заперечна форма \

source: It's not necessary
ru: Это не обязательно
uk: Це не обов'язково

source: It's not required for her
ru: Для нее это не требуется
uk: Це не вимагається від неї

source: 4. Expressing Logical Deduction / Strong Certainty
ru: 4. Выражение логического вывода / сильной уверенности
uk: 4. Вираження Логічного Висновку / Сильної Впевненості

source: Must (Present/Future Deduction):
ru: Must (Вывод в настоящем/будущем):
uk: Must (Висновок про теперішнє/майбутнє):

source: Used when you are almost certain that something is true, based on evidence.
ru: Используется, когда вы **почти уверены**, что что-то истинно, основываясь на доказательствах.
uk: Використовується, коли ви майже впевнені, що щось є правдою, на основі доказів.

source: Logical conclusion
ru: Логический вывод
uk: Логічний висновок

source: Must have + Past Participle (Past Deduction):
ru: Must have + Причастие прошедшего времени (Прошлый вывод):
uk: Must have + Дієприкметник минулого часу (Висновок про минуле):

source: Used for strong conclusions about past events.
ru: Используется для **сильных выводов** о прошлых событиях.
uk: Використовується для сильних висновків про минулі події.

source: Forms of Need
ru: Формы Need
uk: Форми Need

source: It changes form for the third person singular present (needs).
ru: Он изменяет форму для третьего лица единственного числа настоящего времени (needs).
uk: Він змінює форму для третьої особи однини теперішнього часу (needs).

source: Subject + need(s) + (to + Base Verb / Noun)
ru: Подлежащее + need(s) + (to + Базовый глагол / Существительное)
uk: Підмет + need(s) + (to + Базова форма дієслова / Іменник)

source: Subject + do/does/did not need + (to + Base Verb / Noun)
ru: Подлежащее + do/does/did not need + (to + Базовый глагол / Существительное)
uk: Підмет + do/does/did not need + (to + Базова форма дієслова / Іменник)

source: Do/Does/Did + Subject + need + (to + Base Verb / Noun)?
ru: Do/Does/Did + Подлежащее + need + (to + Базовый глагол / Существительное)?
uk: Do/Does/Did + Підмет + need + (to + Базова форма дієслова / Іменник)?

source: Past (Action not done)
ru: Прошедшее (Действие не совершено)
uk: Минулий час (Дія не була зроблена)

source: Subject + didn't need to + Base Verb
ru: Подлежащее + didn't need to + Базовый глагол
uk: Підмет + didn't need to + Базова форма дієслова

source: I didn't buy it because it wasn't necessary
ru: Я не купил это, потому что это не было необходимо
uk: Я не купив це, тому що це не було необхідно

source: Past (Action done but unnecessary)
ru: Прошедшее (Действие совершено, но было необязательно)
uk: Минулий час (Дія була зроблена, але вона була непотрібна)

source: Subject + needn't have + Past Participle
ru: Подлежащее + needn't have + Причастие прошедшего времени
uk: Підмет + needn't have + Дієприкметник минулого часу

source: You bought it, but it was unnecessary
ru: Ты купил это, но это было необязательно
uk: Ти купив це, але це було непотрібно

source: It is primarily used in formal or somewhat old-fashioned English, especially in British English.
ru: Он используется преимущественно в **формальном** или несколько **устаревшем** английском, особенно в британском варианте.
uk: Він переважно використовується у формальній або дещо застарілій англійській мові, особливо в британській англійській.

source: Subject + need not / needn't + Base Verb
ru: Подлежащее + need not / needn't + Базовый глагол
uk: Підмет + need not / needn't + Базова форма дієслова

source: Need + Subject + Base Verb?
ru: Need + Подлежащее + Базовый глагол?
uk: Need + Підмет + Базова форма дієслова?

source: Less common, formal
ru: Менее распространен, формально
uk: Менш поширений, формальний

source: You bothered, but it was unnecessary
ru: Ты побеспокоился, но это было необязательно
uk: Ти потурбувався, але це було непотрібно

source: Use of Need
ru: Использование Need
uk: Використання Need

source: 1. Expressing Necessity / Requirement (Main Verb \
ru: 1. Выражение необходимости / требования (Основной глагол \
uk: 1. Вираження Необхідності / Вимоги (Основне дієслово \

source: This is the most common use of \
ru: Это наиболее распространенное использование \
uk: Це найпоширеніше використання \

source: It is necessary for me to finish
ru: Мне необходимо закончить
uk: Мені необхідно закінчити

source: Basic requirements
ru: Основные требования
uk: Основні вимоги

source: Are you in need of assistance?
ru: Вы нуждаетесь в помощи?
uk: Вам потрібна допомога?

source: It was necessary for her to consult
ru: Ей было необходимо проконсультироваться
uk: Їй було необхідно проконсультуватися

source: 2. Expressing Absence of Necessity (Main Verb \
ru: 2. Выражение отсутствия необходимости (Основной глагол \
uk: 2. Вираження Відсутності Необхідності (Основне дієслово \

source: Don't/Doesn't/Didn't need to (Main Verb):
ru: Don't/Doesn't/Didn't need to (Основной глагол):
uk: Don't/Doesn't/Didn't need to (Основне дієслово):

source: The standard way to express that something is not necessary.
ru: Стандартный способ выразить, что что-то **не является необходимым**.
uk: Стандартний спосіб виразити, що щось не є необхідним.

source: It's not necessary for you to wait
ru: Тебе не обязательно ждать
uk: Тобі не обов'язково чекати

source: It wasn't necessary
ru: Это не было необходимо
uk: Це не було необхідно

source: Needn't (Modal Verb):
ru: Needn't (Модальный глагол):
uk: Needn't (Модальне дієслово):

source: Used for the same meaning, but is more formal/less common, particularly in American English.
ru: Используется для того же значения, но является более **формальным/менее распространенным**, особенно в американском английском.
uk: Використовується для того ж значення, але є більш формальним/менш поширеним, особливо в американській англійській.

source: It's not necessary for you to worry
ru: Тебе не обязательно беспокоиться
uk: Тобі не потрібно хвилюватися

source: Needn't have + Past Participle (Modal):
ru: Needn't have + Причастие прошедшего времени (Модальный):
uk: Needn't have + Дієприкметник минулого часу (Модальне):

source: To express that an action was performed, but it was unnecessary.
ru: Для выражения того, что действие было совершено, но оно было **необязательным** (означает, что действие уже произошло).
uk: Для вираження того, що дія була виконана, але вона була непотрібна.

source: You bought one, but it wasn't necessary
ru: Ты купил один, но это не было необходимо
uk: Ти купив один, але це не було необхідно

source: He worried, but it was unnecessary
ru: Он беспокоился, но это было необязательно
uk: Він хвилювався, але це було непотрібно

source: 3. Asking About Necessity (Main Verb \
ru: 3. Вопрос о необходимости (Основной глагол \
uk: 3. Запитання Про Необхідність (Основне дієслово \

source: Do/Does/Did + Subject + need to? (Main Verb):
ru: Do/Does/Did + Подлежащее + need to? (Основной глагол):
uk: Do/Does/Did + Підмет + need to? (Основне дієслово):

source: The common and standard way to ask if something is necessary.
ru: Обычный и стандартный способ спросить, необходимо ли что-то.
uk: Поширений і стандартний спосіб запитати, чи є щось необхідним.

source: Need + Subject + Base Verb? (Modal Verb):
ru: Need + Подлежащее + Базовый глагол? (Модальный глагол):
uk: Need + Підмет + Базова форма дієслова? (Модальне дієслово):

source: More formal and less common.
ru: Более **формальный** и менее распространенный.
uk: Більш формальний і менш поширений.

source: Is it necessary for me to explain?
ru: Мне нужно объяснять?
uk: Чи потрібно мені пояснювати?

source: 4. Imperative Use (Main Verb \
ru: 4. Повелительное использование (Основной глагол \
uk: 4. Імперативне Використання (Основне дієслово \

source: Or:
ru: Или:
uk: Або:

source: Forms of Ought to
ru: Формы Ought to
uk: Форми Ought to

source: As a semi-modal, \
ru: Как полумодальный глагол, \
uk: Як напівмодальне дієслово, \

source: Subject + ought to + Base Verb
ru: Подлежащее + ought to + Базовый глагол
uk: Підмет + ought to + Базова форма дієслова

source: Subject + ought not to / oughtn't to + Base Verb
ru: Подлежащее + ought not to / oughtn't to + Базовый глагол
uk: Підмет + ought not to / oughtn't to + Базова форма дієслова

source: Ought + Subject + to + Base Verb?
ru: Ought + Подлежащее + to + Базовый глагол?
uk: Ought + Підмет + to + Базова форма дієслова?

source: Formal/Less Common
ru: Формально/Менее распространено
uk: Формально/Менш поширено

source: Ought to have + Past Participle (Past Obligation/Regret)
ru: Ought to have + Причастие прошедшего времени (Прошлая обязанность/Сожаление)
uk: Ought to have + Дієприкметник минулого часу (Минулий Обов'язок/Жаль)

source: This construction is used to express that something should have happened in the past but didn't, or to criticize a past action.
ru: Эта конструкция используется для выражения того, что что-то **должно было произойти в прошлом, но не произошло**, или для **критики** прошлого действия.
uk: Ця конструкція використовується для вираження того, що щось мало статися в минулому, але не сталося, або для критики минулої дії.

source: Subject + ought to have + Past Participle
ru: Подлежащее + ought to have + Причастие прошедшего времени
uk: Підмет + ought to have + Дієприкметник минулого часу

source: You didn't call, but should have
ru: Ты не позвонил, но должен был
uk: Ти не подзвонив, але мав би

source: Subject + ought not to have / oughtn't to have + Past Participle
ru: Подлежащее + ought not to have / oughtn't to have + Причастие прошедшего времени
uk: Підмет + ought not to have / oughtn't to have + Дієприкметник минулого часу

source: They left, but shouldn't have
ru: Они ушли, но не должны были
uk: Вони пішли, але не мали б

source: Use of Ought to
ru: Использование Ought to
uk: Використання Ought to

source: 1. Expressing Advice or Recommendation
ru: 1. Выражение совета или рекомендации
uk: 1. Вираження Поради або Рекомендації

source: It's the right thing to do
ru: Это правильно
uk: Це правильно

source: Good advice
ru: Хороший совет
uk: Хороша порада

source: Recommendation for her well-being
ru: Рекомендация для ее благополучия
uk: Рекомендація для її добробуту

source: 2. Expressing Obligation or Duty
ru: 2. Выражение обязанности или долга
uk: 2. Вираження Обов'язку або Боргу

source: It can express a sense of duty, responsibility, or what is generally expected.
ru: Он может выражать чувство **долга, ответственности** или того, что общепринято.
uk: Він може виражати почуття обов'язку, відповідальності або того, що загалом очікується.

source: Duty/Expected behavior
ru: Долг/Ожидаемое поведение
uk: Обов'язок/Очікувана поведінка

source: Moral obligation
ru: Моральное обязательство
uk: Моральний обов'язок

source: Duty to himself/others
ru: Долг перед собой/другими
uk: Обов'язок перед собою/іншими

source: 3. Expressing Probability or Expectation
ru: 3. Выражение вероятности или ожидания
uk: 3. Вираження Ймовірності або Очікування

source: Expected arrival
ru: Ожидаемое прибытие
uk: Очікуване прибуття

source: Expected weather
ru: Ожидаемая погода
uk: Очікувана погода

source: Expected outcome given their preparation
ru: Ожидаемый результат, учитывая их подготовку
uk: Очікуваний результат, враховуючи їхню підготовку

source: 4. Referring to Unfulfilled Obligation or Regret (Ought to have + Past Participle)
ru: 4. Ссылка на невыполненную обязанность или сожаление (Ought to have + Причастие прошедшего времени)
uk: 4. Посилання на Невиконаний Обов'язок або Жаль (Ought to have + Дієприкметник минулого часу)

source: This past form is used to express that something was expected or desirable in the past but did not happen. It often implies regret, criticism, or disappointment.
uk: Ця минула форма використовується для вираження того, що щось очікувалося або було бажаним у минулому, але не відбулося. Вона часто передбачає жаль, критику або розчарування.

source: You didn't, and you should have
ru: Ты этого не сделал, а должен был
uk: Ти не зробив, а мав би

source: Regret about my past action
ru: Сожаление о моем прошлом действии
uk: Жаль про мою минулу дію

source: Criticism of their past action
ru: Критика их прошлого действия
uk: Критика їхньої минулої дії

source: 5. Differences from \
ru: 5. Различия от \
uk: 5. Відмінності від \

source: General advice
ru: Общий совет
uk: Загальна порада
