Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Modal Verb Backshifts
ru: Сдвиги модальных глаголов
uk: Зсуви модальних дієслів

source: Modal verbs also undergo changes in indirect speech:
ru: Модальные глаголы также претерпевают изменения в косвенной речи:
uk: Модальні дієслова також зазнають змін у непрямій мові:

source: Exceptions and Special Cases
ru: Исключения и особые случаи
uk: Винятки та особливі випадки

source: There are important exceptions to the backshift rules:
ru: Существуют важные исключения из правил сдвига времени:
uk: Існують важливі винятки з правил зсуву часів:

source: 1. No Backshift Needed
ru: 1. Сдвиг времени не требуется
uk: 1. Зсув часів не потрібен

source: When reporting general truths or permanent situations
ru: При сообщении об общих истинах или постоянных ситуациях
uk: При повідомленні загальних істин або постійних ситуацій

source: When the reporting verb is in the present tense
ru: Когда вводной глагол стоит в настоящем времени
uk: Коли головне дієслово стоїть у теперішньому часі

source: When the original statement is still true at the time of reporting
ru: Когда исходное утверждение все еще верно на момент сообщения
uk: Коли оригінальне твердження все ще є правдивим на момент повідомлення

source: 2. Past Perfect Remains Unchanged
ru: 2. Past Perfect (Прошедшее совершенное) остается без изменений
uk: 2. Past Perfect залишається незмінним

source: Past perfect doesn't change because there's no 'more past' tense
ru: Прошедшее совершенное не меняется, потому что нет 'более прошедшего' времени
uk: Past perfect не змінюється, оскільки не існує 'більш минулого' часу

source: These modal forms generally don't change in indirect speech
ru: Эти модальные формы, как правило, не меняются в косвенной речи
uk: Ці модальні форми зазвичай не змінюються в непрямій мові

source: Time and Place References
ru: Ссылки на время и место
uk: Посилання на час і місце

source: Time and place expressions often change in indirect speech:
ru: Выражения времени и места часто меняются в косвенной речи:
uk: Вирази часу та місця часто змінюються в непрямій мові:

source: Time and Place Expression Changes in Reported Speech
ru: Изменения выражений времени и места в косвенной речи
uk: Зміни виразів часу та місця в непрямій мові

source: Time and Place Expressions
ru: Выражения времени и места
uk: Вирази часу та місця

source: When converting direct speech to indirect speech, expressions of time and place must often be adjusted to maintain the correct temporal and spatial relationships in the new context.
ru: При преобразовании прямой речи в косвенную, выражения времени и места часто должны быть скорректированы, чтобы сохранить правильные временные и пространственные отношения в новом контексте.
uk: При перетворенні прямої мови в непряму, вирази часу та місця часто повинні бути скориговані для збереження правильних часових і просторових зв'язків у новому контексті.

source: 1. Time Expression Transformations
ru: 1. Преобразования выражений времени
uk: 1. Перетворення виразів часу

source: Time references typically shift according to when the reporting occurs relative to the original statement:
ru: Ссылки на время обычно сдвигаются в зависимости от того, когда происходит сообщение относительно исходного утверждения:
uk: Посилання на час зазвичай зміщуються відповідно до того, коли відбувається повідомлення, відносно оригінального твердження:

source: 2. Place Expression Transformations
ru: 2. Преобразования выражений места
uk: 2. Перетворення виразів місця

source: References to location shift according to the reporter's perspective:
ru: Ссылки на местоположение сдвигаются в соответствии с перспективой сообщающего:
uk: Посилання на місце розташування зміщуються відповідно до перспективи того, хто повідомляє:

source: 3. Demonstrative Pronoun Changes
ru: 3. Изменения указательных местоимений
uk: 3. Зміни вказівних займенників

source: Demonstratives typically shift to maintain proper reference in the new context:
ru: Указательные местоимения обычно сдвигаются для сохранения правильной ссылки в новом контексте:
uk: Вказівні займенники зазвичай зміщуються, щоб зберегти належне посилання в новому контексті:

source: When Reporting Immediately
ru: При немедленном сообщении
uk: При негайному повідомленні

source: When Location Hasn't Changed
ru: Когда местоположение не изменилось
uk: Коли місце розташування не змінилося

source: With Universal Time References
ru: С универсальными ссылками на время
uk: З універсальними посиланнями на час

source: Complete Transformation Reference
ru: Полный справочник по преобразованиям
uk: Повне посилання на перетворення

source: Days
ru: Дни
uk: Дні

source: Weeks/Months
ru: Недели/Месяцы
uk: Тижні/Місяці

source: General Time
ru: Общее время
uk: Загальний час

source: Demonstratives
ru: Указательные местоимения
uk: Вказівні займенники

source: Consider whether the time/place reference would still make sense from the reporter's perspective
ru: Подумайте, будет ли ссылка на время/место все еще иметь смысл с точки зрения сообщающего
uk: Розгляньте, чи матиме посилання на час/місце сенс з точки зору того, хто повідомляє

source: When reporting in the same time/place context, changes may not be necessary
ru: При сообщении в том же временном/пространственном контексте изменения могут не понадобиться
uk: При повідомленні в тому ж часовому/місцевому контексті зміни можуть бути не потрібні

source: Universal truths and permanent situations don't require time reference changes
ru: Общеизвестные истины и постоянные ситуации не требуют изменения ссылок на время
uk: Універсальні істини та постійні ситуації не вимагають змін посилань на час

source: Practice with real conversations to develop intuition for these transformations
ru: Практикуйтесь с реальными разговорами, чтобы развить интуицию в отношении этих преобразований
uk: Практикуйтеся з реальними розмовами, щоб розвинути інтуїцію щодо цих перетворень

source: Verb Tense Changes (Backshift)
ru: Изменения глагольных времен (Сдвиг времени)
uk: Зміни часів дієслів (Backshift)

source: Verb Tense Changes
ru: Изменения глагольных времен
uk: Зміни часів дієслів

source: Verb Tense Changes in Reported Speech
ru: Изменения глагольных времен в косвенной речи
uk: Зміни часів дієслів у непрямій мові

source: When converting direct speech to indirect speech, verb tenses typically shift backward in time. This phenomenon, known as <span class=\
ru: При преобразовании прямой речи в косвенную, глагольные времена обычно сдвигаются назад во времени. Это явление, известное как <span class=\
uk: При перетворенні прямої мови в непряму, часи дієслів зазвичай зміщуються назад у часі. Це явище, відоме як <span class=\

source: 1. Standard Tense Backshifting
ru: 1. Стандартный сдвиг глагольных времен
uk: 1. Стандартний зсув часів

source: The following table shows the most common tense transformations in reported speech:
ru: Следующая таблица показывает наиболее распространенные преобразования времен в косвенной речи:
uk: Наступна таблиця показує найбільш поширені перетворення часів у непрямій мові:

source: Important Notes on Backshifting
ru: Важные примечания по сдвигу времени
uk: Важливі примітки щодо зсуву часів

source: Backshift occurs when the reporting verb (said, told, etc.) is in the past tense
ru: Сдвиг времени происходит, когда глагол, вводящий речь (said, told и т. д.), стоит в прошедшем времени
uk: Зсув часів відбувається, коли головне дієслово (said, told, тощо) стоїть у минулому часі

source: Pronouns and time expressions often change along with the verb tense
ru: Местоимения и выражения времени часто меняются вместе с глагольным временем
uk: Займенники та вирази часу часто змінюються разом із часом дієслова

source: The conjunction <span class=\
ru: Союз <span class=\
uk: Сполучник <span class=\

source: 2. Modal Verb Transformations
ru: 2. Преобразования модальных глаголов
uk: 2. Перетворення модальних дієслів

source: Modal verbs in reported speech follow specific backshifting patterns:
ru: Модальные глаголы в косвенной речи следуют специфическим схемам сдвига времени:
uk: Модальні дієслова в непрямій мові дотримуються певних правил зсуву часів:

source: 3. Exceptions to Backshifting
ru: 3. Исключения из правил сдвига времени
uk: 3. Винятки зі зсуву часів

source: There are important cases where backshifting is not required:
ru: Существуют важные случаи, когда сдвиг времени не требуется:
uk: Існують важливі випадки, коли зсув часів не вимагається:

source: When the Statement Is Still True
ru: Когда утверждение все еще верно
uk: Коли твердження все ще є правдивим

source: With Certain Modal Verbs
ru: С определенными модальными глаголами
uk: З певними модальними дієсловами

source: 4. Time and Place References
ru: 4. Ссылки на время и место
uk: 4. Посилання на час і місце

source: Time and place expressions often change in reported speech to maintain logical relationships:
ru: Выражения времени и места часто меняются в косвенной речи для сохранения логических связей:
uk: Вирази часу та місця часто змінюються в непрямій мові для підтримки логічних зв'язків:

source: Special Cases in Reported Speech
ru: Особые случаи в косвенной речи
uk: Особливі випадки в непрямій мові

source: Indirect (Reported) Speech
ru: Косвенная (переданная) речь
uk: Непряма (Переказана) мова

source: Indirect speech is used to convey what someone said without using their exact words. It requires careful changes in tenses, pronouns, and time expressions to be grammatically correct.
ru: Косвенная речь используется для передачи того, что кто-то сказал, не используя его точных слов. Для грамматической корректности она требует тщательных изменений времен, местоимений и выражений времени.
uk: Непряма мова використовується для передачі того, що хтось сказав, не використовуючи його точних слів. Вона вимагає ретельних змін у часах, займенниках та виразах часу, щоб бути граматично правильною.

source: Formation of Indirect Speech
ru: Формирование косвенной речи
uk: Формування непрямої мови

source: Key Changes
ru: Ключевые изменения
uk: Ключові зміни

source: Time and Place Expression Changes
ru: Изменения выражений времени и места
uk: Зміни виразів часу та місця

source: Usage and Sequence of Tenses
ru: Использование и последовательность времен
uk: Використання та послідовність часів

source: Common Interjections by Emotion
ru: Распространенные междометия по эмоциям
uk: Поширені вигуки за емоціями

source: Interjection
ru: Междометие
uk: Вигук

source: Interjections are the emotional punctuation of our speech. This comprehensive guide organizes them by the feelings they express, with examples and usage notes.
ru: Междометия — это эмоциональные знаки препинания в нашей речи. Это всеобъемлющее руководство организует их по выражаемым ими чувствам, с примерами и примечаниями по использованию.
uk: Вигуки — це емоційна пунктуація нашого мовлення. Цей вичерпний посібник організовує їх за почуттями, які вони виражають, з прикладами та примітками щодо використання.

source: Surprise & Amazement
ru: Удивление и изумление
uk: Здивування та подив

source: Expressions of sudden wonder, shock, or unexpected events:
ru: Выражения внезапного изумления, шока или неожиданных событий:
uk: Вирази раптового подиву, шоку або несподіваних подій:

source: Pain & Discomfort
ru: Боль и дискомфорт
uk: Біль та дискомфорт

source: Instant reactions to physical or emotional pain:
ru: Мгновенные реакции на физическую или эмоциональную боль:
uk: Миттєві реакції на фізичний чи емоційний біль:

source: Emotion Category
ru: Категория эмоций
uk: Категорія емоцій

source: Common Interjections
ru: Распространенные междометия
uk: Поширені вигуки

source: Joy & Celebration
ru: Радость и ликование
uk: Радість та святкування

source: Disgust & Dislike
ru: Отвращение и неприязнь
uk: Огида та неприйняття

source: Relief
ru: Облегчение
uk: Полегшення

source: Hesitation & Pausing
ru: Нерешительность и пауза
uk: Нерішучість та паузи

source: Greeting & Attention
ru: Приветствие и внимание
uk: Привітання та привертання уваги

source: Realization
ru: Осознание
uk: Усвідомлення

source: Disappointment
ru: Разочарование
uk: Розчарування

source: Encouragement
ru: Ободрение
uk: Заохочення

source: Cultural & Regional Variations
ru: Культурные и региональные различия
uk: Культурні та регіональні відмінності

source: Interjections often vary by language and region. Here are some interesting examples:
ru: Междометия часто различаются в зависимости от языка и региона. Вот несколько интересных примеров:
uk: Вигуки часто різняться залежно від мови та регіону. Ось кілька цікавих прикладів:

source: Back to Interjections
ru: Назад к междометиям
uk: Повернутися до вигуків

source: Usage and Punctuation of Interjections
ru: Использование и пунктуация междометий
uk: Вживання та пунктуація вигуків

source: Usage and Punctuation
ru: Использование и пунктуация
uk: Вживання та пунктуація

source: Interjections are unique in their flexibility and emotional impact. Their placement and punctuation significantly affect their meaning and the sentence's tone.
ru: Междометия уникальны своей гибкостью и эмоциональным воздействием. Их расположение и пунктуация значительно влияют на их значение и тон предложения.
uk: Вигуки є унікальними у своїй гнучкості та емоційному впливі. Їхнє розташування та пунктуація суттєво впливають на їхнє значення та тон речення.

source: Position in Sentences
ru: Позиция в предложениях
uk: Позиція в реченнях

source: 1. Beginning of Sentence
ru: 1. Начало предложения
uk: 1. Початок речення

source: Most common position, setting the emotional tone for what follows:
ru: Наиболее распространенная позиция, задающая эмоциональный тон для последующего:
uk: Найпоширеніша позиція, що задає емоційний тон для подальшого:

source: 2. Middle of Sentence
ru: 2. Середина предложения
uk: 2. Середина речення

source: Used for spontaneous reactions or pauses in thought:
ru: Используется для спонтанных реакций или пауз в размышлении:
uk: Використовується для спонтанних реакцій або пауз у думці:

source: 3. End of Sentence
ru: 3. Конец предложения
uk: 3. Кінець речення

source: Adds emotional emphasis as an afterthought:
ru: Добавляет эмоциональный акцент в качестве запоздалой мысли:
uk: Додає емоційного акценту як доповнення:

source: 1. Exclamation Marks (!)
ru: 1. Восклицательные знаки (!)
uk: 1. Знаки оклику (!)

source: For strong emotions or sudden outbursts:
ru: Для сильных эмоций или внезапных всплесков:
uk: Для сильних емоцій або раптових вигуків:

source: 2. Commas (,)
ru: 2. Запятые (,)
uk: 2. Коми (,)

source: For milder interjections or thoughtful pauses:
ru: Для более мягких междометий или задумчивых пауз:
uk: Для більш м'яких вигуків або вдумливих пауз:

source: 3. Question Marks (?)
ru: 3. Вопросительные знаки (?)
uk: 3. Знаки питання (?)

source: For interjections expressing confusion or seeking confirmation:
ru: Для междометий, выражающих замешательство или ищущих подтверждения:
uk: Для вигуків, що виражають збентеження або потребу в підтвердженні:

source: Punctuation by Emotion Strength
ru: Пунктуация в зависимости от силы эмоции
uk: Пунктуація за силою емоцій

source: Emotion Level
ru: Уровень эмоции
uk: Рівень емоцій

source: Very Strong
ru: Очень сильная
uk: Дуже сильні

source: Strong
ru: Сильная
uk: Сильні

source: Mild
ru: Слабая
uk: М'які

source: Questioning
ru: Вопросительная
uk: Питальні

source: What is an Interjection?
ru: Что такое междометие?
uk: Що таке вигук?

source: Typically short and emotionally charged
ru: Обычно короткое и эмоционально насыщенное
uk: Зазвичай короткий та емоційно насичений

source: Can stand alone or appear within sentences
ru: Может стоять отдельно или появляться внутри предложений
uk: Може стояти окремо або з'являтися в реченнях

source: No grammatical connection to other sentence parts
ru: Не имеет грамматической связи с другими частями предложения
uk: Не має граматичного зв'язку з іншими частинами речення

source: Often followed by exclamation marks or commas
ru: Часто сопровождается восклицательными знаками или запятыми
uk: Часто супроводжується знаками оклику або комами

source: May include sounds that aren't proper words
ru: Может включать звуки, которые не являются собственно словами
uk: Може включати звуки, які не є власне словами

source: Types of Interjections
ru: Типы междометий
uk: Типи вигуків

source: 1. Primary Interjections
ru: 1. Первичные междометия
uk: 1. Первинні вигуки

source: Words that exist solely as interjections with no other meanings:
ru: Слова, которые существуют исключительно как междометия без других значений:
uk: Слова, які існують виключно як вигуки без інших значень:

source: 2. Secondary Interjections
ru: 2. Вторичные междометия
uk: 2. Вторинні вигуки

source: Regular words that can function as interjections:
ru: Обычные слова, которые могут функционировать как междометия:
uk: Звичайні слова, які можуть функціонувати як вигуки:

source: 3. Sound Interjections
ru: 3. Звуковые междометия
uk: 3. Звукові вигуки

source: Non-word sounds that express reactions:
ru: Звуки, не являющиеся словами, которые выражают реакции:
uk: Звуки, що не є словами, які виражають реакції:

source: Interjections by Emotion
ru: Междометия по эмоциям
uk: Вигуки за емоціями

source: Interjections
ru: Междометия
uk: Вигуки

source: Surprise
ru: Удивление
uk: Здивування

source: Pain
ru: Боль
uk: Біль

source: Joy
ru: Радость
uk: Радість

source: Disgust
ru: Отвращение
uk: Огида

source: Hesitation
ru: Нерешительность
uk: Нерішучість

source: An interjection is a word or phrase that expresses a sudden strong feeling, emotion, or reaction. They are typically short, emotionally charged utterances that stand alone or interrupt the flow of a sentence.
ru: Междометие — это слово или фраза, выражающие внезапное сильное чувство, эмоцию или реакцию. Обычно это короткие, эмоционально насыщенные высказывания, которые стоят отдельно или прерывают течение предложения.
uk: Вигук — це слово або фраза, що виражає раптове сильне почуття, емоцію чи реакцію. Це зазвичай короткі, емоційно насичені висловлювання, які стоять окремо або переривають потік речення.

source: Definition and Usage of Interjections
ru: Определение и использование междометий
uk: Визначення та вживання вигуків

source: Components of the Predicate
ru: Компоненты сказуемого
uk: Складові присудка

source: Main Sentence Parts
ru: Главные члены предложения
uk: Головні члени речення

source: Core Predicate Structure
ru: Основная структура сказуемого
uk: Основна структура присудка

source: While only the verb is required, most predicates contain additional elements to complete their meaning.
ru: Хотя требуется только глагол, большинство сказуемых содержат дополнительные элементы для завершения своего значения.
uk: Хоча потрібне лише дієслово, більшість присудків містять додаткові елементи для завершення свого значення.

source: 1. The Verb
ru: 1. Глагол
uk: 1. Дієслово

source: The essential component that expresses the action or state of being.
ru: Существенный компонент, который выражает действие или состояние бытия.
uk: Основний компонент, який виражає дію або стан.

source: Types of Verbs in Predicates:
ru: Типы глаголов в сказуемых:
uk: Типи дієслів у присудках:

source: 2. Objects
ru: 2. Дополнения
uk: 2. Додатки (Об'єкти)

source: Elements that receive or are affected by the verb's action.
ru: Элементы, которые получают или затрагиваются действием глагола.
uk: Елементи, які отримують дію дієслова або зазнають її впливу.

source: Direct Objects
ru: Прямые дополнения
uk: Прямі додатки

source: Directly receives the action of the verb (answers 'what?' or 'whom?')
ru: Напрямую получает действие глагола (отвечает на вопросы 'что?' или 'кого?')
uk: Безпосередньо отримує дію дієслова (відповідає на питання 'що?' або 'кого?')

source: Indirect Objects
ru: Косвенные дополнения
uk: Непрямі додатки

source: Receives the direct object (answers 'to/for whom?')
ru: Получает прямое дополнение (отвечает на вопросы 'кому/для кого?')
uk: Отримує прямий додаток (відповідає на питання 'кому/для кого?')

source: Object or Preposition?
ru: Дополнение или предлог?
uk: Додаток чи прийменник?

source: When the receiver comes after 'to' or 'for', it becomes a prepositional phrase rather than an indirect object:
ru: Когда получатель стоит после 'to' или 'for', он становится частью предложной фразы, а не косвенным дополнением:
uk: Коли отримувач йде після 'to' або 'for', він стає прийменниковою фразою, а не непрямим додатком:

source: 3. Complements
ru: 3. Комплименты (Дополнительные члены)
uk: 3. Доповнення

source: Words that complete the meaning of the subject or object.
ru: Слова, которые дополняют значение подлежащего или дополнения.
uk: Слова, які доповнюють значення підмета або додатка.

source: Subject Complements
ru: Субъектные комплименты (Именная часть составного сказуемого)
uk: Доповнення підмета

source: Follow linking verbs and rename/describe the subject
ru: Следуют за глаголами-связками и переименовывают/описывают подлежащее
uk: Йдуть після дієслів-зв'язок і перейменовують/описують підмет

source: Object Complements
ru: Объектные комплименты
uk: Доповнення додатка

source: Follow and modify direct objects
ru: Следуют за прямыми дополнениями и модифицируют их
uk: Йдуть після прямих додатків та модифікують їх

source: 4. Modifiers
ru: 4. Определители (Модификаторы)
uk: 4. Модифікатори

source: Optional elements that add information about time, place, manner, etc.
ru: Необязательные элементы, которые добавляют информацию о времени, месте, образе действия и т.д.
uk: Необов'язкові елементи, які додають інформацію про час, місце, спосіб тощо.

source: Adverbial Modifiers
ru: Обстоятельственные определители (Обстоятельства)
uk: Прислівникові модифікатори

source: Prepositional Phrases
ru: Предложные фразы
uk: Прийменникові фрази

source: Predicate Patterns
ru: Схемы сказуемых
uk: Схеми присудків

source: Common Errors
ru: Распространенные ошибки
uk: Поширені помилки

source: Back to Main Sentence Parts
ru: Назад к Главным членам предложения
uk: Повернутися до головних членів речення

source: Position and Types of Subjects
ru: Позиция и типы подлежащих
uk: Позиція та типи підметів

source: Subject Positioning and Classification
ru: Расположение и классификация подлежащего
uk: Розташування та класифікація підметів

source: Subjects in English demonstrate flexible positioning patterns and can be categorized into distinct types based on their structure and grammatical properties.
ru: Подлежащие в английском языке демонстрируют гибкие схемы расположения и могут быть классифицированы на отдельные типы в зависимости от их структуры и грамматических свойств.
uk: Підмети в англійській мові демонструють гнучкі схеми розташування та можуть бути класифіковані на окремі типи на основі їхньої структури та граматичних властивостей.

source: 1. Subject Position Variations
ru: 1. Вариации позиции подлежащего
uk: 1. Варіації позиції підмета

source: A. Standard Position (SVO)
ru: A. Стандартная позиция (Подлежащее-Сказуемое-Дополнение)
uk: A. Стандартна позиція (SVO)

source: B. Inverted Position (VSO)
ru: B. Инвертированная позиция (Сказуемое-Подлежащее-Дополнение)
uk: B. Інвертована позиція (VSO)

source: C. Delayed Subjects
ru: C. Отложенные подлежащие
uk: C. Відкладені підмети

source: 2. Structural Types of Subjects
ru: 2. Структурные типы подлежащих
uk: 2. Структурні типи підметів

source: A. Simple Subjects
ru: A. Простое подлежащее
uk: A. Прості підмети

source: B. Complete Subjects
ru: B. Полное подлежащее
uk: B. Повні підмети

source: C. Compound Subjects
ru: C. Составное подлежащее
uk: C. Складені підмети

source: 3. Functional Types of Subjects
ru: 3. Функциональные типы подлежащих
uk: 3. Функціональні типи підметів

source: A. Agentive Subjects
ru: A. Подлежащее-Агент
uk: A. Підмети-агенти

source: Performers of voluntary actions:
ru: Исполнители добровольных действий:
uk: Виконавці добровільних дій:
