Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Punctuation with Brackets
ru: Пунктуация с квадратными скобками
uk: Пунктуація з квадратними дужками

source: Brackets within a sentence
ru: Квадратные скобки внутри предложения
uk: Квадратні дужки в реченні

source: No additional punctuation needed inside brackets
ru: Внутри квадратных скобок не требуется дополнительной пунктуации
uk: Всередині квадратних дужок не потрібна додаткова пунктуація

source: Complete sentence in brackets
ru: Законченное предложение в квадратных скобках
uk: Повне речення у квадратних дужках

source: Capitalize first word and end with period inside
ru: Первое слово пишется с заглавной буквы, а в конце ставится точка внутри скобок
uk: Пишіть перше слово з великої літери та ставте крапку всередині

source: Brackets at end of quoted sentence
ru: Квадратные скобки в конце цитируемого предложения
uk: Квадратні дужки в кінці цитованого речення

source: Period goes outside the closing bracket
ru: Точка ставится после закрывающей скобки
uk: Крапка ставиться за межами кінцевої квадратної дужки

source: Brackets with other punctuation
ru: Квадратные скобки с другой пунктуацией
uk: Квадратні дужки з іншою пунктуацією

source: Other punctuation remains outside unless part of bracketed material
ru: Другие знаки препинания остаются снаружи, если только они не являются частью материала, заключенного в скобки
uk: Інша пунктуація залишається зовні, якщо вона не є частиною матеріалу в квадратних дужках

source: 3. Brackets vs. Parentheses
ru: 3. Квадратные скобки vs. Круглые скобки
uk: 3. Квадратні дужки проти звичайних дужок

source: Used primarily within quotations to add editorial comments or clarifications
ru: Используется в основном внутри цитат для добавления редакторских комментариев или пояснений
uk: Використовується переважно всередині цитат для додавання редакторських коментарів або уточнень

source: Used to add supplementary information to your own writing
ru: Используется для добавления дополнительной информации в вашем собственном тексте
uk: Використовується для додавання допоміжної інформації до вашого власного тексту

source: Colon: List or Explanation
ru: Двоеточие: Список или пояснение
uk: Двокрапка: Список або пояснення

source: The Colon in English
ru: Двоеточие в английском языке
uk: Двокрапка в англійській мові

source: Colons serve three main purposes in formal writing:
ru: Двоеточие служит трем основным целям в формальном письме:
uk: Двокрапка служить трьом основним цілям у формальному письмі:

source: Introducing lists
ru: Представление списков
uk: Представлення списків

source: Presenting explanations or examples
ru: Представление объяснений или примеров
uk: Представлення пояснень або прикладів

source: Introducing quotations
ru: Представление цитат
uk: Представлення цитат

source: Key Rule:
ru: Ключевое правило:
uk: Ключове правило:

source: The text before a colon must be a complete independent clause that could stand as its own sentence.
ru: Текст перед двоеточием должен быть полным независимым предложением, которое могло бы стоять как отдельное предложение.
uk: Текст перед двокрапкою має бути повним незалежним реченням, яке може виступати як окреме речення.

source: Types of Colon Usage
ru: Типы использования двоеточия
uk: Типи використання двокрапки

source: Introducing Lists
ru: Представление списков
uk: Представлення списків

source: When the introductory clause clearly anticipates what follows:
ru: Когда вводное предложение явно предвосхищает то, что последует:
uk: Коли вступне речення чітко передбачає те, що слідує:

source: Introducing Explanations
ru: Представление объяснений
uk: Представлення пояснень

source: When the second clause explains or elaborates on the first:
ru: Когда второе предложение объясняет или детализирует первое:
uk: Коли друге речення пояснює або деталізує перше:

source: Introducing Quotations
ru: Представление цитат
uk: Представлення цитат

source: When the quotation is formally introduced:
ru: Когда цитата вводится формально:
uk: Коли цитата формально представлена:

source: Colon vs Other Punctuation
ru: Двоеточие против других знаков препинания
uk: Двокрапка проти іншої пунктуації

source: When to Use
ru: Когда использовать
uk: Коли використовувати

source: Colon
ru: Двоеточие
uk: Двокрапка

source: Formal introduction of explanation
ru: Формальное представление объяснения
uk: Формальне представлення пояснення

source: Dash
ru: Тире
uk: Тире

source: Semicolon
ru: Точка с запятой
uk: Крапка з комою

source: Connecting independent clauses
ru: Соединение независимых предложений
uk: З'єднання незалежних речень

source: Comma
ru: Запятая
uk: Кома

source: Non-essential information
ru: Несущественная информация
uk: Несуттєва інформація

source: Special Cases and Rules
ru: Особые случаи и правила
uk: Особливі випадки та правила

source: <span class="term-highlight">Capitalization:</span> Capitalize the first word after a colon if it begins a complete sentence or is a proper noun
ru: <span class="term-highlight">Заглавная буква:</span> Пишите с заглавной буквы первое слово после двоеточия, если оно начинает полное предложение или является именем собственным
uk: <span class="term-highlight">Написання з великої літери:</span> Пишіть перше слово після двокрапки з великої літери, якщо воно починає повне речення або є власним іменником

source: <span class="term-highlight">Spacing:</span> No space before, one space after in English
ru: <span class="term-highlight">Интервал:</span> Нет пробела перед, один пробел после в английском языке
uk: <span class="term-highlight">Інтервали:</span> Немає пробілу перед, один пробіл після в англійській мові

source: <span class="term-highlight">Lists:</span> Don\
uk: <span class="term-highlight">Списки:</span> Не\

source: <span class="term-highlight">Titles:</span> Often used in titles and subtitles
ru: <span class="term-highlight">Заголовки:</span> Часто используется в заголовках и подзаголовках
uk: <span class="term-highlight">Заголовки:</span> Часто використовується в заголовках і підзаголовках

source: Add colons where appropriate:
ru: Добавьте двоеточия там, где это уместно:
uk: Додайте двокрапки, де це доречно:

source: Colon - Separating Clauses
ru: Двоеточие - Разделение предложений
uk: Двокрапка - Розділення речень

source: Colon: Separating Clauses
ru: Двоеточие: Разделение предложений
uk: Двокрапка: Розділення речень

source: The Colon Between Clauses
ru: Двоеточие между предложениями
uk: Двокрапка між реченнями

source: Primary Usage
ru: Основное использование
uk: Основне використання

source: Use a colon between clauses when:
ru: Используйте двоеточие между предложениями, когда:
uk: Використовуйте двокрапку між реченнями, коли:

source: The second clause explains or illustrates the first
ru: Второе предложение объясняет или иллюстрирует первое
uk: Друге речення пояснює або ілюструє перше

source: The second clause provides a logical consequence
ru: Второе предложение обеспечивает логическое следствие
uk: Друге речення надає логічний наслідок

source: You want to emphasize the relationship between ideas
ru: Вы хотите подчеркнуть связь между идеями
uk: Ви хочете підкреслити зв'язок між ідеями

source: Independent clause
ru: Независимое предложение
uk: Незалежне речення

source: Related independent clause
ru: Связанное независимое предложение
uk: Пов'язане незалежне речення

source: Types of Clause Relationships
ru: Типы связей между предложениями
uk: Типи зв'язків між реченнями

source: Explanation/Illustration
ru: Объяснение/Иллюстрация
uk: Пояснення/Ілюстрація

source: The second clause provides clarification:
ru: Второе предложение дает пояснение:
uk: Друге речення надає уточнення:

source: Cause and Effect
ru: Причина и следствие
uk: Причина і наслідок

source: The second clause shows a direct consequence:
ru: Второе предложение показывает прямое следствие:
uk: Друге речення показує прямий наслідок:

source: Formal Announcement
ru: Формальное объявление
uk: Формальне оголошення

source: The second clause formally presents information:
ru: Второе предложение формально представляет информацию:
uk: Друге речення формально представляє інформацію:

source: Formal, explanatory relationship
ru: Формальная, пояснительная связь
uk: Формальний, пояснювальний зв'язок

source: Related but independent ideas
ru: Связанные, но независимые идеи
uk: Пов'язані, але незалежні ідеї

source: Informal, emphatic connection
ru: Неформальная, акцентированная связь
uk: Неформальний, наголошений зв'язок

source: Period
ru: Точка
uk: Крапка

source: Complete separation of ideas
ru: Полное разделение идей
uk: Повне розділення ідей

source: Special Rules and Exceptions
ru: Особые правила и исключения
uk: Особливі правила та винятки

source: <span class="term-highlight">Capitalization:</span> Capitalize the first word after a colon if it begins a complete sentence
ru: <span class="term-highlight">Заглавная буква:</span> Пишите с заглавной буквы первое слово после двоеточия, если оно начинает полное предложение
uk: <span class="term-highlight">Написання з великої літери:</span> Пишіть перше слово після двокрапки з великої літери, якщо воно починає повне речення

source: <span class="term-highlight">Formality:</span> Colons are more formal than dashes for this purpose
ru: <span class="term-highlight">Формальность:</span> Двоеточие более формально, чем тире, для этой цели
uk: <span class="term-highlight">Формальність:</span> Двокрапки є більш формальними, ніж тире для цієї мети

source: <span class="term-highlight">No colon:</span> Don\
uk: <span class="term-highlight">Без двокрапки:</span> Не\

source: <span class="term-highlight">Overuse:</span> Avoid using multiple colons in one sentence
ru: <span class="term-highlight">Чрезмерное использование:</span> Избегайте использования нескольких двоеточий в одном предложении
uk: <span class="term-highlight">Надмірне використання:</span> Уникайте використання кількох двокрапок в одному реченні

source: Add colons between clauses where appropriate:
ru: Добавьте двоеточия между предложениями там, где это уместно:
uk: Додайте двокрапки між реченнями, де це доречно:

source: Comma - Joining Independent Clauses
ru: Запятая - Соединение независимых предложений
uk: Кома - З'єднання незалежних речень

source: Comma: Joining Independent Clauses
ru: Запятая: Соединение независимых предложений
uk: Кома: З'єднання незалежних речень

source: Using Commas with Independent Clauses
ru: Использование запятых с независимыми предложениями
uk: Використання ком з незалежними реченнями

source: Commas play a crucial role in connecting independent clauses with coordinating conjunctions (FANBOYS: for, and, nor, but, or, yet, so), creating compound sentences that maintain clarity and proper grammatical structure.
ru: Запятые играют ключевую роль в соединении независимых предложений с помощью сочинительных союзов (FANBOYS: for, and, nor, but, or, yet, so), создавая сложносочиненные предложения, которые сохраняют ясность и правильную грамматическую структуру.
uk: Коми відіграють вирішальну роль у з'єднанні незалежних речень із сурядними сполучниками (FANBOYS: for, and, nor, but, or, yet, so), створюючи складносурядні речення, які підтримують ясність і правильну граматичну структуру.

source: Fundamental Rules
ru: Основные правила
uk: Фундаментальні правила

source: These core principles govern comma usage between independent clauses:
ru: Эти основные принципы регулируют использование запятой между независимыми предложениями:
uk: Ці основні принципи регулюють використання коми між незалежними реченнями:

source: 1. The Comma + Conjunction Rule
ru: 1. Правило Запятая + Союз
uk: 1. Правило Кома + Сполучник

source: When joining two independent clauses with a coordinating conjunction, always use a comma before the conjunction:
ru: При соединении двух независимых предложений с помощью сочинительного союза всегда используйте запятую перед союзом:
uk: При з'єднанні двох незалежних речень сурядним сполучником завжди ставте кому перед сполучником:

source: 2. Identifying Independent Clauses
ru: 2. Определение независимых предложений
uk: 2. Визначення незалежних речень

source: Both clauses must contain a subject and verb and express complete thoughts:
ru: Оба предложения должны содержать подлежащее и сказуемое и выражать законченные мысли:
uk: Обидва речення повинні містити підмет і присудок та виражати повні думки:

source: When the Comma is Optional
ru: Когда запятая необязательна
uk: Коли кома є необов'язковою

source: In some cases, the comma may be omitted without creating confusion:
ru: В некоторых случаях запятая может быть опущена без создания путаницы:
uk: У деяких випадках кому можна пропустити, не створюючи плутанини:

source: 1. Short Parallel Clauses
ru: 1. Короткие параллельные предложения
uk: 1. Короткі паралельні речення

source: With very short, closely related clauses where the meaning remains clear:
ru: С очень короткими, тесно связанными предложениями, где смысл остается ясным:
uk: З дуже короткими, тісно пов'язаними реченнями, де значення залишається зрозумілим:

source: Note: Including the comma is never wrong in these cases.
ru: Примечание: Включение запятой никогда не будет ошибкой в этих случаях.
uk: Примітка: Включення коми ніколи не є помилковим у цих випадках.

source: 2. Journalistic Writing
ru: 2. Журналистский стиль
uk: 2. Журналістське письмо

source: Some style guides (like AP) permit omitting the comma for brevity in news writing:
ru: Некоторые стилевые руководства (например, AP) разрешают опускать запятую для краткости в новостных статьях:
uk: Деякі стилістичні посібники (наприклад, AP) дозволяють опускати кому для стислості в новинному письмі:

source: Common Errors and How to Fix Them
ru: Распространенные ошибки и способы их исправления
uk: Поширені помилки та як їх виправити

source: These mistakes frequently occur with comma-conjunction usage:
ru: Эти ошибки часто встречаются при использовании запятой и союза:
uk: Ці помилки часто трапляються при використанні коми та сполучника:

source: 1. The Comma Splice
ru: 1. Соединение запятой (Comma Splice)
uk: 1. Розділення комою

source: Joining independent clauses with only a comma (no conjunction):
ru: Соединение независимых предложений только запятой (без союза):
uk: З'єднання незалежних речень лише комою (без сполучника):

source: Error
ru: Ошибка
uk: Помилка

source: 2. Missing Comma with Long Clauses
ru: 2. Отсутствие запятой с длинными предложениями
uk: 2. Пропущена кома у довгих підрядних реченнях

source: Even with a conjunction, long clauses need a comma for readability:
ru: Даже с союзом, длинные предложения нуждаются в запятой для читабельности:
uk: Навіть зі сполучником, довгі підрядні речення потребують коми для кращої читабельності:

source: Don't use a comma before a conjunction when the second clause can't stand alone:
ru: Не используйте запятую перед союзом, когда второе предложение не может стоять отдельно:
uk: Не використовуйте кому перед сполучником, якщо друге речення не може бути окремим реченням:

source: Advanced Usage
ru: Продвинутое использование
uk: Розширене використання

source: These sophisticated applications demonstrate the comma's versatility:
ru: Эти сложные применения демонстрируют универсальность запятой:
uk: Ці складні застосування демонструють універсальність коми:

source: 1. Multiple Independent Clauses
ru: 1. Несколько независимых предложений
uk: 1. Кілька незалежних речень

source: For three or more independent clauses, use commas between them:
ru: Для трех и более независимых предложений используйте запятые между ними:
uk: Для трьох або більше незалежних речень використовуйте коми між ними:

source: 2. Contrasting Clauses with 'But'
ru: 2. Контрастные предложения с 'But'
uk: 2. Контрастні речення зі сполучником 'But'

source: Particularly important when the second clause contradicts or contrasts the first:
ru: Особенно важно, когда второе предложение противоречит или контрастирует с первым:
uk: Особливо важливо, коли друге речення суперечить або контрастує з першим:

source: 3. Semicolon as Alternative
ru: 3. Точка с запятой как альтернатива
uk: 3. Крапка з комою як альтернатива

source: For closely related clauses where a conjunction seems unnecessary:
ru: Для тесно связанных предложений, где союз кажется излишним:
uk: Для тісно пов'язаних речень, де сполучник здається непотрібним:

source: Comma - Separating Introductory Elements
ru: Запятая - Разделение вводных элементов
uk: Кома - Розділення вступних елементів

source: Comma: Introductory Elements
ru: Запятая: Вводные элементы
uk: Кома: Вступні елементи

source: Commas with Introductory Elements
ru: Запятые с вводными элементами
uk: Коми з вступними елементами

source: Commas after introductory elements create natural pauses and help readers distinguish between the introduction and the main clause of a sentence. These elements can be words, phrases, or clauses that come before the main subject and verb.
ru: Запятые после вводных элементов создают естественные паузы и помогают читателям различать введение и главное предложение. Этими элементами могут быть слова, фразы или придаточные предложения, которые стоят перед основным подлежащим и сказуемым.
uk: Коми після вступних елементів створюють природні паузи та допомагають читачам розрізняти вступ і головне речення. Ці елементи можуть бути словами, фразами або реченнями, які стоять перед головним підметом і присудком.

source: Types of Introductory Elements
ru: Типы вводных элементов
uk: Типи вступних елементів

source: Different categories of introductory elements require comma separation:
ru: Различные категории вводных элементов требуют разделения запятыми:
uk: Різні категорії вступних елементів вимагають розділення комою:

source: 1. Introductory Words and Phrases
ru: 1. Вводные слова и фразы
uk: 1. Вступні слова та фрази

source: Single words or short phrases that introduce the main clause:
ru: Отдельные слова или короткие фразы, которые вводят главное предложение:
uk: Окремі слова або короткі фрази, які вводять головне речення:

source: 2. Introductory Phrases
ru: 2. Вводные фразы
uk: 2. Вступні фрази

source: Multi-word phrases that set up the main clause:
ru: Фразы из нескольких слов, которые подготавливают главное предложение:
uk: Фрази з кількох слів, які формують головне речення:

source: 3. Introductory Clauses
ru: 3. Вводные придаточные предложения
uk: 3. Вступні речення

source: Dependent clauses that precede the main clause:
ru: Зависимые придаточные предложения, которые предшествуют главному предложению:
uk: Підрядні речення, які передують головному реченню:

source: When Commas Are Optional
ru: Когда запятые необязательны
uk: Коли коми є необов'язковими

source: Some introductory elements may omit the comma in certain cases:
ru: Некоторые вводные элементы могут опускать запятую в определенных случаях:
uk: Деякі вступні елементи можуть опускати кому в певних випадках:

source: 1. Short Prepositional Phrases
ru: 1. Короткие предложные фразы
uk: 1. Короткі прийменникові фрази

source: Very short phrases (3-4 words) may omit the comma if no ambiguity results:
ru: Очень короткие фразы (3-4 слова) могут опускать запятую, если это не приводит к двусмысленности:
uk: Дуже короткі фрази (3-4 слова) можуть опускати кому, якщо це не призводить до двозначності:

source: With Comma
ru: С запятой
uk: З комою

source: Without Comma
ru: Без запятой
uk: Без коми

source: Note: Including the comma is never wrong, even with short phrases.
ru: Примечание: Включение запятой никогда не будет ошибкой, даже с короткими фразами.
uk: Примітка: Включення коми ніколи не є помилковим, навіть з короткими фразами.

source: 2. Absolute Phrases
ru: 2. Независимые причастные обороты (Absolute Phrases)
uk: 2. Абсолютні фрази

source: These phrases modify the entire sentence and sometimes omit commas:
ru: Эти фразы определяют все предложение и иногда опускают запятые:
uk: Ці фрази модифікують усе речення і іноді опускають коми:

source: These situations require special attention with introductory commas:
ru: Эти ситуации требуют особого внимания при использовании вводных запятых:
uk: Ці ситуації вимагають особливої уваги до вступних ком:

source: 1. Essential vs. Nonessential Elements
ru: 1. Существенные против несущественных элементов
uk: 1. Суттєві проти несуттєвих елементів

source: Don't use a comma if the introductory element is essential to the meaning:
ru: Не используйте запятую, если вводный элемент существенен для смысла:
uk: Не використовуйте кому, якщо вступний елемент є суттєвим для значення:

source: Essential (No Comma)
ru: Существенный (Без запятой)
uk: Суттєвий (Без коми)

source: Nonessential (With Comma)
ru: Несущественный (С запятой)
uk: Несуттєвий (З комою)

source: 2. Multiple Introductory Elements
ru: 2. Несколько вводных элементов
uk: 2. Кілька вступних елементів

source: When several introductory elements appear together:
ru: Когда несколько вводных элементов появляются вместе:
uk: Коли кілька вступних елементів з'являються разом:

source: 3. Common Errors to Avoid
ru: 3. Распространенные ошибки, которых следует избегать
uk: 3. Поширені помилки, яких слід уникати

source: Frequent mistakes with introductory commas:
ru: Частые ошибки с вводными запятыми:
uk: Часті помилки з вступними комами:

source: Sophisticated applications of introductory commas:
ru: Сложные применения вводных запятых:
uk: Складні застосування вступних ком:

source: 1. Participial Phrases
ru: 1. Причастные обороты
uk: 1. Дієприкметникові звороти

source: Verbal phrases that function as adjectives:
ru: Глагольные фразы, которые функционируют как прилагательные:
uk: Дієслівні фрази, які функціонують як прикметники:

source: 2. Inverted Sentence Structure
ru: 2. Инвертированная структура предложения
uk: 2. Інвертована структура речення

source: When the usual word order is reversed for emphasis:
ru: Когда обычный порядок слов изменен для акцентирования:
uk: Коли звичайний порядок слів інвертується для наголосу:

source: 3. Absolute Constructions
ru: 3. Независимые конструкции
uk: 3. Абсолютні конструкції

source: Noun phrases with participles that modify the entire sentence:
ru: Именные фразы с причастиями, которые определяют все предложение:
uk: Іменникові фрази з дієприкметниками, які модифікують усе речення:

source: Comma - Separating Items in a List
ru: Запятая - Разделение элементов в списке
uk: Кома - Розділення елементів у списку

source: Comma: Separating Lists
ru: Запятая: Разделение списков
uk: Кома: Розділення списків

source: The Comma in List Separation
ru: Запятая при разделении списков
uk: Кома при розділенні списків

source: Commas serve as essential separators in lists, helping to clearly distinguish between multiple items while maintaining readability and preventing ambiguity.
ru: Запятые служат важными разделителями в списках, помогая четко различать несколько элементов, сохраняя при этом читабельность и предотвращая двусмысленность.
uk: Коми служать основними роздільниками в списках, допомагаючи чітко розрізняти кілька елементів, зберігаючи читабельність і запобігаючи двозначності.

source: Basic Rules for List Commas
ru: Основные правила для запятых в списках
uk: Основні правила для ком у списках

source: These fundamental rules govern comma usage in lists:
ru: Эти основные правила регулируют использование запятой в списках:
uk: Ці фундаментальні правила регулюють використання коми в списках:

source: 1. The Oxford (Serial) Comma
ru: 1. Оксфордская (серийная) запятая
uk: 1. Оксфордська (послідовна) кома

source: The comma before the final conjunction in a list is called the Oxford comma. Its usage varies by style:
ru: Запятая перед последним союзом в списке называется оксфордской запятой. Ее использование варьируется в зависимости от стиля:
uk: Кома перед фінальним сполучником у списку називається Оксфордською комою. Її використання варіюється залежно від стилю:

source: Style
ru: Стиль
uk: Стиль
