Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: The Bare Infinitive (Infinitive without \
ru: Голый инфинитив (Инфинитив без \
uk: Голий Інфінітив (Інфінітив без \

source: The bare infinitive is used in several specific contexts:
ru: Голый инфинитив используется в нескольких конкретных контекстах:
uk: Голий інфінітив використовується в кількох конкретних контекстах:

source: After Modal Verbs:
ru: После модальных глаголов:
uk: Після Модальних дієслів:

source: After Verbs of Perception (see, hear, feel, watch, notice) + Object:
ru: После глаголов восприятия (see, hear, feel, watch, notice) + Дополнение:
uk: Після Дієслів сприйняття (see, hear, feel, watch, notice) + Додаток:

source: After \
ru: После \
uk: Після \

source: Split Infinitives
ru: Расщепленные инфинитивы
uk: Розщеплені Інфінітиви (Split Infinitives)

source: Understanding the various forms and uses of the infinitive is fundamental for advanced English grammar and effective communication.
ru: Понимание различных форм и способов использования инфинитива является основополагающим для продвинутой грамматики английского языка и эффективного общения.
uk: Розуміння різних форм та використання інфінітива є фундаментальним для просунутої англійської граматики та ефективного спілкування.

source: The construction <span class=\
ru: Конструкция <span class=\
uk: Конструкція <span class=\

source: Unlike true modal verbs, \
ru: В отличие от настоящих модальных глаголов, \
uk: На відміну від справжніх модальних дієслів, \

source: Forms of Be to
ru: Формы Be to
uk: Форми Be to

source: The \
ru: Конструкция \
uk: Конструкція \

source: Tense
ru: Время
uk: Час

source: Example (Affirmative)
ru: Пример (Утвердительная)
uk: Приклад (Стверджувальне)

source: Example (Negative)
ru: Пример (Отрицательная)
uk: Приклад (Заперечне)

source: Example (Interrogative)
ru: Пример (Вопросительная)
uk: Приклад (Питальне)

source: Subject + am/is/are + to + Base Verb
ru: Подлежащее + am/is/are + to + Базовый глагол
uk: Підмет + am/is/are + to + Базова форма дієслова

source: Past Simple
ru: Past Simple (Простое прошедшее)
uk: Past Simple (Минулий простий)

source: Subject + was/were + to + Base Verb
ru: Подлежащее + was/were + to + Базовый глагол
uk: Підмет + was/were + to + Базова форма дієслова

source: Present Perfect
ru: Present Perfect (Настоящее совершенное)
uk: Present Perfect (Теперішній доконаний)

source: Subject + have/has been + to + Base Verb
ru: Подлежащее + have/has been + to + Базовый глагол
uk: Підмет + have/has been + to + Базова форма дієслова

source: Less common for 'be to' function, more for perfect tense of 'go'
ru: Менее распространено для функции 'be to', чаще для совершенного времени глагола 'go'
uk: Менш поширено для функції 'be to', частіше для доконаного часу дієслова 'go'

source: Not typical.
ru: Не типично.
uk: Не типово.

source: Passive Voice
ru: Пассивный залог
uk: Пасивний стан

source: Subject + form of \
ru: Подлежащее + форма \
uk: Підмет + форма \

source: Use of Be to
ru: Использование Be to
uk: Використання Be to

source: 1. Expressing Pre-arranged Plans or Scheduled Events
ru: 1. Выражение заранее оговоренных планов или запланированных событий
uk: 1. Вираження Заздалегідь узгоджених Планів або Запланованих Подій

source: This is one of the most common uses, indicating an arrangement, plan, or official schedule for the future.
ru: Это одно из наиболее распространенных применений, указывающее на договоренность, план или официальное расписание на будущее.
uk: Це одне з найпоширеніших використань, що вказує на домовленість, план або офіційний розклад на майбутнє.

source: Official schedule/arrangement
ru: Официальное расписание/договоренность
uk: Офіційний розклад/домовленість

source: Pre-arranged meeting
ru: Заранее оговоренная встреча
uk: Заздалегідь узгоджена зустріч

source: Scheduled event
ru: Запланированное событие
uk: Запланована подія

source: Past unfulfilled plan
ru: Прошлый невыполненный план
uk: Минулий нездійснений план

source: 2. Giving Instructions or Orders
ru: 2. Отдача инструкций или приказов
uk: 2. Надання Інструкцій або Наказів

source: It can convey a command or an instruction, often implying that the instruction comes from an authority or an agreement.
ru: Он может передавать команду или инструкцию, часто подразумевая, что инструкция исходит от властей или соглашения.
uk: Він може передавати наказ або інструкцію, часто маючи на увазі, що інструкція походить від влади або домовленості.

source: Order/Instruction
ru: Приказ/Инструкция
uk: Наказ/Інструкція

source: Prohibition/Instruction
ru: Запрет/Инструкция
uk: Заборона/Інструкція

source: Instruction in passive voice
ru: Инструкция в пассивном залоге
uk: Інструкція в пасивному стані

source: 3. Expressing Obligation or Necessity
ru: 3. Выражение обязанности или необходимости
uk: 3. Вираження Обов'язку або Необхідності

source: Similar to \
ru: Похоже на \
uk: Схоже на \

source: Moral obligation/duty
ru: Моральное обязательство/долг
uk: Моральний обов'язок/борг

source: Duty/Responsibility
ru: Долг/Ответственность
uk: Обов'язок/Відповідальність

source: Expressing a dilemma or need for instruction
ru: Выражение дилеммы или потребности в инструкции
uk: Вираження дилеми або потреби в інструкції

source: 4. Expressing Possibility (especially with \
ru: 4. Выражение возможности (особенно с \
uk: 4. Вираження Можливості (особливо з \

source: In formal contexts, particularly with negative constructions or in questions, \
ru: В формальных контекстах, особенно с отрицательными конструкциями или в вопросах, \
uk: У формальних контекстах, особливо із заперечними конструкціями або в питаннях, \

source: It is impossible to find a solution
ru: Невозможно найти решение
uk: Неможливо знайти рішення

source: He couldn't be seen
ru: Его нельзя было увидеть
uk: Його не можна було побачити

source: They can be seen
ru: Их можно увидеть
uk: Їх можна побачити

source: 5. Expressing Destiny or Fate
ru: 5. Выражение судьбы или рока
uk: 5. Вираження Долі або Фатуму

source: Used to talk about events that are destined or fated to happen, often with a sense of inevitability or tragedy.
ru: Используется для разговора о событиях, которым суждено или предначертано случиться, часто с ощущением неизбежности или трагедии.
uk: Використовується для розмови про події, яким судилося чи які визначені долею, часто з відчуттям неминучості чи трагедії.

source: Fated meeting
ru: Судьбоносная встреча
uk: Фатальна зустріч

source: Destiny
ru: Судьба
uk: Доля

source: Tragic fate
ru: Трагический рок
uk: Трагічна доля

source: While \
ru: В то время как \
uk: Хоча \

source: Forms of Can / Could
ru: Формы Can / Could
uk: Форми Can / Could

source: The forms of \
ru: Формы \
uk: Форми \

source: 1. Can (Present / Future)
ru: 1. Can (Настоящее / Будущее)
uk: 1. Can (Теперішній / Майбутній)

source: The verb \
ru: Глагол \
uk: Дієслово \

source: Affirmative
ru: Утвердительная
uk: Стверджувальна

source: Subject + can + Base Verb
ru: Подлежащее + can + Базовый глагол
uk: Підмет + can + Базова форма дієслова

source: Negative
ru: Отрицательная
uk: Заперечна

source: Subject + cannot / can't + Base Verb
ru: Подлежащее + cannot / can't + Базовый глагол
uk: Підмет + cannot / can't + Базова форма дієслова

source: Can + Subject + Base Verb?
ru: Can + Подлежащее + Базовый глагол?
uk: Can + Підмет + Базова форма дієслова?

source: 2. Could (Past / Polite / Possibility)
ru: 2. Could (Прошедшее / Вежливость / Возможность)
uk: 2. Could (Минулий / Ввічливий / Можливість)

source: Subject + could + Base Verb
ru: Подлежащее + could + Базовый глагол
uk: Підмет + could + Базова форма дієслова

source: Subject + could not / couldn't + Base Verb
ru: Подлежащее + could not / couldn't + Базовый глагол
uk: Підмет + could not / couldn't + Базова форма дієслова

source: Could + Subject + Base Verb?
ru: Could + Подлежащее + Базовый глагол?
uk: Could + Підмет + Базова форма дієслова?

source: 3. Could have + Past Participle (Unrealized Past Possibility)
ru: 3. Could have + Причастие прошедшего времени (Нереализованная возможность в прошлом)
uk: 3. Could have + Дієприкметник минулого часу (Нереалізована минула можливість)

source: This form is used to express possibilities that existed in the past but did not happen, or to express regret or criticism about a past action.
ru: Эта форма используется для выражения возможностей, которые существовали в прошлом, но не были реализованы, или для выражения сожаления/критики по поводу прошлого действия.
uk: Ця форма використовується для вираження можливостей, які існували в минулому, але не відбулися, або для вираження жалю чи критики щодо минулої дії.

source: Subject + could have + Past Participle
ru: Подлежащее + could have + Причастие прошедшего времени
uk: Підмет + could have + Дієприкметник минулого часу

source: Subject + could not have / couldn't have + Past Participle
ru: Подлежащее + could not have / couldn't have + Причастие прошедшего времени
uk: Підмет + could not have / couldn't have + Дієприкметник минулого часу

source: Use of Can / Could
ru: Использование Can / Could
uk: Використання Can / Could

source: 1. Expressing Ability
ru: 1. Выражение способности
uk: 1. Вираження Здібності

source: Can (Present / General Ability):
ru: Can (Настоящее / Общая способность):
uk: Can (Теперішня / Загальна Здатність):

source: Indicates capability or skill in the present.
ru: Указывает на возможность или навык в настоящем.
uk: Вказує на спроможність або навичку в теперішньому часі.

source: Physical ability
ru: Физическая способность
uk: Фізична здатність

source: Mental ability
ru: Умственная способность
uk: Розумова здатність

source: General ability
ru: Общая способность
uk: Загальна здатність

source: Could (Past Ability):
ru: Could (Прошлая способность):
uk: Could (Минула Здатність):

source: Refers to an ability someone had in the past.
ru: Относится к способности, которая была у кого-то в прошлом.
uk: Стосується здібності, яку хтось мав у минулому.

source: Note:
ru: Примечание:
uk: Примітка:

source: For a single, specific achievement in the past, \
ru: Для **одного, конкретного достижения** в прошлом \
uk: Для одного, конкретного досягнення в минулому, \

source: 2. Expressing Possibility
ru: 2. Выражение возможности
uk: 2. Вираження Можливості

source: Can (General / Theoretical Possibility):
ru: Can (Общая / Теоретическая возможность):
uk: Can (Загальна / Теоретична Можливість):

source: Used for things that are generally possible or allowed by rules/nature.
ru: Используется для вещей, которые в целом возможны или разрешены правилами/природой.
uk: Використовується для речей, які є загальноможливими або дозволені правилами/природою.

source: Could (Present / Future Possibility - less certain):
ru: Could (Возможность в настоящем / будущем — менее уверенная):
uk: Could (Теперішня / Майбутня Можливість — менш певна):

source: Suggests a less certain or more remote possibility than \
ru: Предполагает менее уверенную или более отдаленную возможность, чем \
uk: Пропонує менш певну або більш віддалену можливість, ніж \

source: Also used for suggestions.
ru: Также используется для предложений.
uk: Також використовується для пропозицій.

source: It's possible, but not definite
ru: Это возможно, но не определенно
uk: Це можливо, але не визначено

source: It's a possibility
ru: Это возможность
uk: Це є можливість

source: Suggesting an option
ru: Предложение варианта
uk: Пропонування варіанту

source: Could have + Past Participle (Past Possibility / Unrealized Possibility):
ru: Could have + Причастие прошедшего времени (Прошлая возможность / Нереализованная возможность):
uk: Could have + Дієприкметник минулого часу (Минула Можливість / Нереалізована Можливість):

source: Describes something that was possible but did not happen. It can also imply regret or criticism.
ru: Описывает нечто, что было возможно, но не произошло. Также может подразумевать сожаление или критику.
uk: Описує щось, що було можливим, але не відбулося. Це також може означати жаль або критику.

source: It was possible, but they didn't
ru: Это было возможно, но они этого не сделали
uk: Це було можливо, але вони не зробили

source: It was possible for him to be hurt
ru: Была возможность, что он поранится
uk: Було можливо, що йому зашкодять

source: Implies criticism or regret
ru: Подразумевает критику или сожаление
uk: Має на увазі критику або жаль

source: 3. Giving / Asking for Permission
ru: 3. Предоставление / Запрос разрешения
uk: 3. Надання / Запит Дозволу

source: Can (Informal Permission):
ru: Can (Неформальное разрешение):
uk: Can (Неформальний Дозвіл):

source: Commonly used for giving and asking for permission in casual situations.
ru: Обычно используется для предоставления и запроса разрешения в неформальных ситуациях.
uk: Широко використовується для надання та запиту дозволу в неформальних ситуаціях.

source: Giving permission
ru: Предоставление разрешения
uk: Надання дозволу

source: Asking for permission
ru: Запрос разрешения
uk: Запит дозволу

source: Could (Polite Permission / Requests):
ru: Could (Вежливое разрешение / Запросы):
uk: Could (Ввічливий Дозвіл / Прохання):

source: More formal or polite than \
ru: Более формально или вежливо, чем \
uk: Більш формально або ввічливо, ніж \

source: 4. Making Requests / Offers / Suggestions
ru: 4. Создание запросов / предложений / советов
uk: 4. Складання Прохань / Пропозицій / Припущень

source: Can (Informal Request):
ru: Can (Неформальный запрос):
uk: Can (Неформальне Прохання):

source: Could (Polite Request / Offering a suggestion):
ru: Could (Вежливый запрос / Предложение совета):
uk: Could (Ввічливе Прохання / Пропонування припущення):

source: Suggestion
ru: Предложение
uk: Пропозиція

source: Suggestion/Advice
ru: Предложение/Совет
uk: Пропозиція/Порада

source: Dare
ru: Dare (Сметь, осмеливаться)
uk: Dare (Насмілюватися)

source: The verb <span class=\
ru: Глагол <span class=\
uk: Дієслово <span class=\

source: The core meaning of \
ru: Основное значение \
uk: Основне значення \

source: Forms of Dare
ru: Формы Dare
uk: Форми Dare

source: When \
ru: Когда \
uk: Коли \

source: It changes form for the third person singular present (dares).
ru: Он изменяет форму для третьего лица единственного числа настоящего времени (dares).
uk: Він змінює форму для третьої особи однини теперішнього часу (dares).

source: It uses \
ru: Он использует \
uk: Він використовує \

source: It is followed by a \
ru: За ним следует \
uk: За ним слідує \

source: Subject + dare(s) + to + Base Verb
ru: Подлежащее + dare(s) + to + Базовый глагол
uk: Підмет + dare(s) + to + Базова форма дієслова

source: Subject + do/does/did not dare + to + Base Verb
ru: Подлежащее + do/does/did not dare + to + Базовый глагол
uk: Підмет + do/does/did not dare + to + Базова форма дієслова

source: Do/Does/Did + Subject + dare + to + Base Verb?
ru: Do/Does/Did + Подлежащее + dare + to + Базовый глагол?
uk: Do/Does/Did + Підмет + dare + to + Базова форма дієслова?

source: It does not change form (no \
ru: Он не меняет форму (нет \
uk: Він не змінює форму (без \

source: It does not use \
ru: Он не использует \
uk: Він не використовує \

source: It is followed directly by the base form of the main verb (without \
ru: За ним сразу следует базовая форма основного глагола (без \
uk: За ним безпосередньо слідує базова форма основного дієслова (без \

source: This usage is more formal or literary, often found in fixed expressions.
ru: Это использование более формальное или литературное, часто встречается в устойчивых выражениях.
uk: Це використання більш формальне або літературне, часто зустрічається у сталих виразах.

source: Subject + dare not / daren't + Base Verb
ru: Подлежащее + dare not / daren't + Базовый глагол
uk: Підмет + dare not / daren't + Базова форма дієслова

source: Dare + Subject + Base Verb?
ru: Dare + Подлежащее + Базовый глагол?
uk: Dare + Підмет + Базова форма дієслова?

source: Use of Dare
ru: Использование Dare
uk: Використання Dare

source: The usage of \
ru: Использование \
uk: Використання \

source: 1. Expressing Courage / Bravery (Main Verb & Modal)
ru: 1. Выражение смелости / отваги (Основной и модальный глагол)
uk: 1. Вираження Сміливості / Відваги (Основне дієслово та Модальне)

source: Both forms can express having the courage to do something, or the lack thereof.
ru: Обе формы могут выражать наличие смелости сделать что-либо, или ее отсутствие.
uk: Обидві форми можуть виражати наявність сміливості щось зробити або її відсутність.

source: Main Verb:
ru: Основной глагол:
uk: Основне дієслово:

source: Focus on the act of daring or having the courage.
ru: Фокусируется на акте осмеливания или наличии смелости.
uk: Зосередженість на дії насмілювання або наявності сміливості.

source: Modal Verb:
ru: Модальный глагол:
uk: Модальне дієслово:

source: More formal or emphatic, particularly in negatives.
ru: Более формальный или выразительный, особенно в отрицаниях.
uk: Більш формальне або підкреслене, особливо в заперечних формах.

source: I don't have the courage
ru: У меня нет смелости
uk: У мене немає сміливості

source: 2. Issuing a Challenge (Main Verb)
ru: 2. Вызов (Основной глагол)
uk: 2. Виклик (Основне дієслово)

source: 3. Expressing Indignation / Strong Disapproval (Modal \
ru: 3. Выражение возмущения / сильного неодобрения (Модальный \
uk: 3. Вираження Обурення / Різкого Несхвалення (Модальне \

source: The fixed phrase \
ru: Устойчивое выражение \
uk: Сталий вираз \

source: 4. Conditional Sentences (Often Modal)
ru: 4. Условные предложения (Часто модальный глагол)
uk: 4. Умовні Речення (Часто Модальне)

source: Main verb
ru: Основной глагол
uk: Основне дієслово

source: Modal, formal
ru: Модальный, формальный
uk: Модальне, формальне

source: 5. Fixed Phrases (Modal \
ru: 5. Устойчивые выражения (Модальный \
uk: 5. Сталі Вирази (Модальне \

source: The phrase \
ru: Фраза \
uk: Фраза \

source: Key Differences in Usage:
ru: Ключевые различия в использовании:
uk: Ключові Відмінності у Використанні:

source: Affirmative:
ru: Утвердительные:
uk: Стверджувальна форма:

source: Negatives/Questions:
ru: Отрицания/Вопросы:
uk: Заперечні/Питальні форми:

source: Both main verb (\
ru: Оба: основной глагол (\
uk: Обидва основне дієслово (\

source: Following Verb:
ru: Следующий глагол:
uk: Наступне дієслово:

source: Main verb \
ru: Основной глагол \
uk: Основне дієслово \

source: Modal verb
ru: Модальный глагол
uk: Модальне дієслово

source: Both <span class=\
ru: Обе конструкции <span class=\
uk: Обидва <span class=\

source: They are sometimes called \
ru: Их иногда называют \
uk: Їх іноді називають \

source: Forms of Have to / Have got to
ru: Формы Have to / Have got to
uk: Форми Have to / Have got to

source: 1. Have to (All Tenses for Obligation / Necessity)
ru: 1. Have to (Все времена для выражения обязанности / необходимости)
uk: 1. Have to (Усі часи для Обов'язку / Необхідності)

source: Subject + have/has to + Base Verb
ru: Подлежащее + have/has to + Базовый глагол
uk: Підмет + have/has to + Базова форма дієслова

source: Subject + had to + Base Verb
ru: Подлежащее + had to + Базовый глагол
uk: Підмет + had to + Базова форма дієслова

source: Future Simple
ru: Future Simple (Простое будущее)
uk: Future Simple (Майбутній простий)

source: Subject + will have to + Base Verb
ru: Подлежащее + will have to + Базовый глагол
uk: Підмет + will have to + Базова форма дієслова

source: Subject + have/has had to + Base Verb
ru: Подлежащее + have/has had to + Базовый глагол
uk: Підмет + have/has had to + Базова форма дієслова

source: 2. Have got to (Present / Future Obligation / Deduction)
ru: 2. Have got to (Настоящее / Будущее — обязанность / дедукция)
uk: 2. Have got to (Теперішній / Майбутній Обов'язок / Висновок)

source: Subject + 've got to / 's got to + Base Verb
ru: Подлежащее + 've got to / 's got to + Базовый глагол
uk: Підмет + 've got to / 's got to + Базова форма дієслова

source: Past
ru: Прошедшее
uk: Минулий час

source: Not typically used; use \
ru: Обычно не используется; использовать \
uk: Зазвичай не використовується; використовуйте \

source: Use
ru: Использование
uk: Використання

source: Future
ru: Будущее
uk: Майбутній час

source: Less common; \
ru: Менее распространено; \
uk: Менш поширено; \

source: Use of Have to / Have got to
ru: Использование Have to / Have got to
uk: Використання Have to / Have got to

source: Both phrases express obligation, but their usage differs slightly in context and formality.
ru: Обе фразы выражают обязанность, но их использование немного различается в контексте и формальности.
uk: Обидві фрази виражають обов'язок, але їх використання дещо відрізняється за контекстом і формальністю.

source: 1. Expressing Obligation or Necessity
ru: 1. Выражение обязанности или необходимости
uk: 1. Вираження Обов'язку або Необхідності

source: Have to (General/External Obligation):
ru: Have to (Общая/Внешняя обязанность):
uk: Have to (Загальний/Зовнішній Обов'язок):

source: Used for general, recurring, or external obligations (rules, laws, duties). It's generally more formal and can be used in all tenses.
ru: Используется для общих, повторяющихся или внешних обязанностей (правила, законы, долг). Обычно он более **формален** и может использоваться во **всех временах**.
uk: Використовується для загальних, повторюваних або зовнішніх обов'язків (правила, закони, борги). Загалом, він більш формальний і може використовуватися у всіх часах.

source: External rule
ru: Внешнее правило
uk: Зовнішнє правило

source: Legal obligation
ru: Юридическое обязательство
uk: Юридичний обов'язок

source: Past necessity
ru: Прошлая необходимость
uk: Минула необхідність

source: Have got to (Specific/Immediate/Internal Obligation):
ru: Have got to (Конкретная/Непосредственная/Внутренняя обязанность):
uk: Have got to (Конкретний/Негайний/Внутрішній Обов'язок):

source: Often refers to a specific, immediate, or more urgent obligation, or a personal, internal feeling of necessity. More common in spoken and informal English, particularly in British English.
ru: Часто относится к **конкретной, немедленной** или более **срочной** обязанности, или к **личному, внутреннему** чувству необходимости. Более распространен в **разговорном и неформальном** английском, особенно в британском варианте.
uk: Часто стосується конкретного, негайного або більш термінового обов'язку, або особистого, внутрішнього відчуття необхідності. Більш поширений у розмовній та неформальній англійській мові, особливо в британській англійській.

source: Immediate, urgent need
ru: Немедленная, срочная необходимость
uk: Негайний, терміновий

source: Strong recommendation/internal conviction
ru: Настоятельная рекомендация/внутреннее убеждение
uk: Сильна рекомендація/внутрішнє переконання

source: Specific, current necessity
ru: Конкретная, текущая необходимость
uk: Конкретна, поточна необхідність

source: 2. Expressing Logical Deduction / Certainty
ru: 2. Выражение логического вывода / уверенности
uk: 2. Вираження Логічного Висновку / Впевненості

source: Have to (Logical Conclusion - strong certainty):
ru: Have to (Логический вывод — сильная уверенность):
uk: Have to (Логічний Висновок — сильна впевненість):

source: Used to express a logical conclusion or strong certainty based on evidence. Similar to \
ru: Используется для выражения логического вывода или сильной уверенности, основанной на доказательствах. Аналогично \
uk: Використовується для вираження логічного висновку або сильної впевненості, заснованої на доказах. Схоже на \

source: Have got to (Logical Conclusion - strong certainty, informal):
ru: Have got to (Логический вывод — сильная уверенность, неформально):
uk: Have got to (Логічний Висновок — сильна впевненість, неформальний):

source: Used similarly to \
ru: Используется аналогично \
uk: Використовується аналогічно \
