Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: These conjunctions connect elements of equal grammatical rank: words with words, phrases with phrases, or independent clauses with independent clauses.
ru: Эти союзы соединяют элементы равного грамматического ранга: слова со словами, фразы с фразами или независимые клаузы с независимыми клаузами.
uk: Ці сполучники з'єднують елементи однакового граматичного рангу: слова зі словами, фрази з фразами або незалежні речення з незалежними реченнями.

source: The FANBOYS Acronym:
ru: Акроним FANBOYS:
uk: Акронім FANBOYS:

source: Joining words
ru: Соединение слов
uk: З'єднання слів

source: Joining phrases
ru: Соединение фраз
uk: З'єднання фраз

source: Joining clauses
ru: Соединение клауз
uk: З'єднання речень

source: Punctuation Rules:
ru: Правила пунктуации:
uk: Правила пунктуації:

source: With 'nor', the second clause typically uses inverted word order
ru: С 'nor' (ни), вторая клауза обычно использует обратный порядок слов
uk: З 'nor' (ні) друге речення зазвичай використовує інвертований порядок слів

source: These conjunctions introduce dependent clauses and show their relationship to the main clause (time, cause, condition, contrast, etc.).
ru: Эти союзы вводят зависимые клаузы и показывают их отношение к главной клаузе (время, причина, условие, контраст и т.д.).
uk: Ці сполучники вводять залежні речення та показують їхній зв'язок з головним реченням (час, причина, умова, контраст тощо).

source: Sentence Patterns:
ru: Модели предложений:
uk: Моделі речень:

source: <strong>Main clause first:</strong> I'll call you <span class=\
ru: <strong>Главная клауза первая:</strong> Я позвоню тебе <span class=\
uk: <strong>Головне речення спочатку:</strong> Я зателефоную тобі <span class=\

source: <strong>Subordinate clause first:</strong> <span class=\
ru: <strong>Подчинительная клауза первая:</strong> <span class=\
uk: <strong>Підрядне речення спочатку:</strong> <span class=\

source: Punctuation Note:
ru: Примечание о пунктуации:
uk: Примітка щодо пунктуації:

source: When the subordinate clause comes first, use a comma after it. When it follows the main clause, no comma is needed.
ru: Когда подчинительная клауза стоит в начале, используйте после нее запятую. Когда она следует за главной клаузой, запятая не нужна.
uk: Коли підрядне речення стоїть першим, використовуйте після нього кому. Коли воно слідує за головним реченням, кома не потрібна.

source: These are conjunction pairs that work together to connect equivalent sentence elements, requiring parallel structure.
ru: Это пары союзов, которые работают вместе для соединения эквивалентных элементов предложения, требуя параллельной структуры.
uk: Це пари сполучників, які працюють разом для з'єднання еквівалентних елементів речення, вимагаючи паралельної структури.

source: Examples with Parallel Structure:
ru: Примеры с параллельной структурой:
uk: Приклади з паралельною структурою:

source: Maintain parallel grammatical structure between the connected elements
ru: Сохраняйте параллельную грамматическую структуру между соединяемыми элементами
uk: Дотримуйтесь паралельної граматичної структури між з'єднаними елементами

source: With 'either/or' and 'neither/nor', the verb agrees with the closer subject
ru: С 'either/or' (либо/или) и 'neither/nor' (ни/ни) глагол согласуется с ближайшим подлежащим
uk: З 'either/or' (або/або) та 'neither/nor' (ні/ні) дієслово узгоджується з ближчим підметом

source: Comparison of Conjunction Types
ru: Сравнение типов союзов
uk: Порівняння типів сполучників

source: Coordinating
ru: Сочинительные
uk: Сурядні

source: Join equal elements
ru: Соединяют равные элементы
uk: З'єднують рівні елементи

source: Comma before when joining clauses
ru: Запятая перед союзом при соединении клауз
uk: Кома перед сполучником при з'єднанні речень

source: Subordinating
ru: Подчинительные
uk: Підрядні

source: Introduce dependent clauses
ru: Вводят зависимые клаузы
uk: Вводять залежні речення

source: Comma after initial dependent clause
ru: Запятая после вводной зависимой клаузы
uk: Кома після початкового залежного речення

source: Correlative
ru: Соотносительные
uk: Співвідносні

source: Paired connectors
ru: Парные соединители
uk: Парні з'єднувачі

source: No special punctuation
ru: Нет особой пунктуации
uk: Без особливої пунктуації

source: English Conjunctions
ru: Английские союзы
uk: Англійські сполучники

source: Conjunctions are words that connect other words, phrases, or clauses. They are essential for creating complex sentences and showing logical relationships between ideas.
ru: Союзы — это слова, которые соединяют другие слова, фразы или клаузы. Они необходимы для создания сложных предложений и демонстрации логических связей между идеями.
uk: Сполучники – це слова, які з'єднують інші слова, фрази або речення. Вони є важливими для створення складних речень та демонстрації логічних зв'язків між ідеями.

source: Definition of Conjunctions
ru: Определение союзов
uk: Визначення сполучників

source: Definition and Basic Function
ru: Определение и основная функция
uk: Визначення та основна функція

source: Types of Conjunctions (Coordinating, Subordinating, Correlative)
ru: Типы союзов (сочинительные, подчинительные, соотносительные)
uk: Типи сполучників (Сурядні, Підрядні, Співвідносні)

source: Classification of Conjunctions
ru: Классификация союзов
uk: Класифікація сполучників

source: Distinction from Prepositions and Adverbs
ru: Отличие от предлогов и наречий
uk: Відмінність від прийменників та прислівників

source: Conjunction vs. Adverb
ru: Союз против наречия
uk: Сполучник проти Прислівника

source: Key Differences and Examples
ru: Ключевые различия и примеры
uk: Ключові відмінності та приклади

source: Examples of Tense Sequence
ru: Примеры последовательности времен
uk: Приклади послідовності часів

source: Indirect Speech
ru: Косвенная речь
uk: Непряма мова

source: Tense Sequence in Indirect Speech
ru: Последовательность времен в косвенной речи
uk: Послідовність часів у непрямій мові

source: These examples demonstrate how verb tenses systematically change when converting direct speech to indirect speech, particularly when the reporting verb is in the past tense.
ru: Эти примеры демонстрируют, как систематически меняются глагольные времена при преобразовании прямой речи в косвенную, особенно когда глагол, вводящий речь, стоит в прошедшем времени.
uk: Ці приклади демонструють, як системно змінюються часи дієслів при перетворенні прямої мови в непряму, особливо коли головне дієслово стоїть у минулому часі.

source: Comprehensive Tense Sequence Examples
ru: Обширные примеры последовательности времен
uk: Вичерпні приклади послідовності часів

source: The following examples show complete tense transformations with explanations:
ru: Следующие примеры показывают полные преобразования времен с пояснениями:
uk: Наступні приклади демонструють повні перетворення часів з поясненнями:

source: Direct:
ru: Прямая речь:
uk: Пряма:

source: Indirect:
ru: Косвенная речь:
uk: Непряма:

source: Note: The present simple tense shifts to past simple in reported speech.
ru: Примечание: Настоящее простое время сдвигается на прошедшее простое время в косвенной речи.
uk: Примітка: Теперішній простий час змінюється на минулий простий у непрямій мові.

source: Modal Verb Transformations
ru: Трансформации модальных глаголов
uk: Перетворення модальних дієслів

source: Modal verbs undergo specific changes in indirect speech:
ru: Модальные глаголы претерпевают специфические изменения в косвенной речи:
uk: Модальні дієслова зазнають специфічних змін у непрямій мові:

source: Direct Speech
ru: Прямая речь
uk: Пряма мова

source: Mixed Tense Examples
ru: Примеры со смешанными временами
uk: Приклади зі змішаними часами

source: Real-life examples often contain multiple tense changes:
ru: Примеры из реальной жизни часто содержат множественные изменения времен:
uk: Приклади з реального життя часто містять численні зміни часів:

source: Complex Statement
ru: Сложное утверждение
uk: Складне твердження

source: Question with Multiple Tenses
ru: Вопрос с несколькими временами
uk: Питання з численними часами

source: Some situations don't follow the standard backshift rules:
ru: Некоторые ситуации не следуют стандартным правилам сдвига времени:
uk: Деякі ситуації не дотримуються стандартних правил зсуву часів:

source: General Truths
ru: Общие истины
uk: Загальні істини

source: Note: General truths remain in present tense.
ru: Примечание: Общие истины остаются в настоящем времени.
uk: Примітка: Загальні істини залишаються в теперішньому часі.

source: Reporting Immediately
ru: Немедленное сообщение
uk: Негайне повідомлення

source: Note: No backshift when reporting verb is in present tense.
ru: Примечание: Сдвиг времени не происходит, если глагол, вводящий речь, стоит в настоящем времени.
uk: Примітка: Немає зсуву часів, коли головне дієслово стоїть у теперішньому часі.

source: Back to Indirect Speech
ru: Назад к косвенной речи
uk: Повернутися до непрямої мови

source: 3. Second and Third Conditional Sentences
ru: 3. Второе и третье условные предложения
uk: 3. Другий та третій типи умовних речень

source: Conditional sentences types 2 and 3 remain unchanged:
ru: Условные предложения 2-го и 3-го типов остаются без изменений:
uk: Умовні речення типу 2 і 3 залишаються без змін:

source: When Backshift is Optional
ru: Когда сдвиг времени не обязателен
uk: Коли зсув часів є необов'язковим

source: In some cases, backshift may be either applied or omitted:
ru: В некоторых случаях сдвиг времени может быть как применен, так и опущен:
uk: У деяких випадках зсув часів може бути застосований або опущений:

source: 1. Habits and Repeated Actions
ru: 1. Привычки и повторяющиеся действия
uk: 1. Звички та повторювані дії

source: For habitual actions that are still true, both forms are acceptable:
ru: Для привычных действий, которые все еще верны, обе формы приемлемы:
uk: Для звичних дій, які все ще є правдивими, обидві форми є прийнятними:

source: Indirect (no backshift):
ru: Косвенная речь (без сдвига):
uk: Непряма (без зсуву часів):

source: Indirect (with backshift):
ru: Косвенная речь (со сдвигом):
uk: Непряма (зі зсувом часів):

source: 2. Future Events Still to Happen
ru: 2. Будущие события, которые еще должны произойти
uk: 2. Майбутні події, які ще не відбулися

source: For future events that haven't occurred yet at the time of reporting:
ru: Для будущих событий, которые еще не произошли на момент сообщения:
uk: Для майбутніх подій, які ще не відбулися на момент повідомлення:

source: Note: The version without backshift emphasizes that the event is still in the future.
ru: Примечание: Версия без сдвига подчеркивает, что событие все еще находится в будущем.
uk: Примітка: Версія без зсуву часів підкреслює, що подія все ще має відбутися в майбутньому.

source: Pronoun Changes in Reported Speech
ru: Изменения местоимений в косвенной речи
uk: Зміни займенників у непрямій мові

source: Pronoun Changes
ru: Изменения местоимений
uk: Зміни займенників

source: When converting direct speech to indirect speech, pronouns must change to reflect the shift in perspective from the original speaker to the reporter. These changes are essential for maintaining logical relationships between speakers and listeners.
ru: При преобразовании прямой речи в косвенную местоимения должны измениться, чтобы отразить сдвиг в перспективе от первоначального говорящего к сообщающему. Эти изменения необходимы для поддержания логических отношений между говорящими и слушающими.
uk: При перетворенні прямої мови в непряму, займенники повинні змінюватися, щоб відобразити зміну перспективи від початкового мовця до того, хто переказує. Ці зміни є необхідними для підтримки логічних зв'язків між мовцями та слухачами.

source: 1. Personal Pronoun Changes
ru: 1. Изменения личных местоимений
uk: 1. Зміни особових займенників

source: Personal pronouns typically shift according to the following patterns:
ru: Личные местоимения обычно сдвигаются в соответствии со следующими схемами:
uk: Особові займенники зазвичай змінюються відповідно до наступних схем:

source: Important Notes
ru: Важные примечания
uk: Важливі примітки

source: First person pronouns (<span class=\
ru: Местоимения первого лица (<span class=\
uk: Займенники першої особи (<span class=\

source: Second person pronouns (<span class=\
ru: Местоимения второго лица (<span class=\
uk: Займенники другої особи (<span class=\

source: Third person pronouns (<span class=\
ru: Местоимения третьего лица (<span class=\
uk: Займенники третьої особи (<span class=\

source: 2. Possessive Pronoun Changes
ru: 2. Изменения притяжательных местоимений
uk: 2. Зміни присвійних займенників

source: Possessive pronouns and adjectives follow similar transformation rules:
ru: Притяжательные местоимения и прилагательные следуют аналогичным правилам преобразования:
uk: Присвійні займенники та прикметники дотримуються схожих правил перетворення:

source: 3. Reflexive Pronoun Changes
ru: 3. Изменения возвратных местоимений
uk: 3. Зміни зворотних займенників

source: Reflexive pronouns must also adapt to the new context in reported speech:
ru: Возвратные местоимения также должны адаптироваться к новому контексту в косвенной речи:
uk: Зворотні займенники також повинні адаптуватися до нового контексту в непрямій мові:

source: 4. Special Cases and Exceptions
ru: 4. Особые случаи и исключения
uk: 4. Особливі випадки та винятки

source: When the Speaker Reports Their Own Words
ru: Когда говорящий сообщает свои собственные слова
uk: Коли мовець переказує власні слова

source: When Reporting General Truths
ru: При сообщении общих истин
uk: Коли повідомляються загальні істини

source: With Generic 'You'
ru: С обобщенным 'You' (ты/вы)
uk: Зі збірним 'You' (Ви/ти)

source: Complete Pronoun Transformation Guide
ru: Полное руководство по преобразованию местоимений
uk: Повний посібник з перетворення займенників

source: Pronoun Type
ru: Тип местоимения
uk: Тип займенника

source: Subject
ru: Подлежащее
uk: Підмет

source: Object
ru: Дополнение
uk: Додаток (Об'єкт)

source: Possessive Adjective
ru: Притяжательное прилагательное
uk: Присвійний прикметник

source: Possessive Pronoun
ru: Притяжательное местоимение
uk: Присвійний займенник

source: Reflexive
ru: Возвратное местоимение
uk: Зворотний

source: Practical Tips
ru: Практические советы
uk: Практичні поради

source: Always consider who is speaking to whom in the original and reported contexts
ru: Всегда учитывайте, кто говорит и кому в исходном контексте и контексте сообщения
uk: Завжди зважайте на те, хто до кого говорить в оригінальному та переказаному контекстах

source: When in doubt, diagram the speaker-listener relationships
ru: Если сомневаетесь, составьте схему отношений 'говорящий-слушающий'
uk: Якщо сумніваєтеся, схематично зобразіть відносини між мовцем та слухачем

source: Remember that pronoun changes often occur alongside verb tense changes
ru: Помните, что изменения местоимений часто происходят наряду с изменениями глагольных времен
uk: Пам'ятайте, що зміни займенників часто відбуваються одночасно зі змінами часів дієслів

source: Practice with dialogues to develop intuition for pronoun shifts
ru: Практикуйтесь с диалогами, чтобы развить интуицию в отношении сдвига местоимений
uk: Практикуйтеся з діалогами, щоб розвинути інтуїцію щодо зсуву займенників

source: Changes in Reporting Verbs and Structure
ru: Изменения во вводных глаголах и структуре
uk: Зміни у головних дієсловах та структурі

source: Reporting Verbs and Structure
ru: Вводные глаголы и структура
uk: Головні дієслова та структура

source: Reporting Verbs and Structural Changes in Indirect Speech
ru: Вводные глаголы и структурные изменения в косвенной речи
uk: Головні дієслова та структурні зміни в непрямій мові

source: When converting direct speech to indirect speech, the choice of reporting verb and the subsequent structural changes are crucial for maintaining the original meaning while adapting to grammatical rules.
ru: При преобразовании прямой речи в косвенную, выбор вводного глагола и последующие структурные изменения имеют решающее значение для сохранения исходного смысла при адаптации к грамматическим правилам.
uk: При перетворенні прямої мови в непряму, вибір головного дієслова та подальші структурні зміни є вирішальними для збереження оригінального значення та адаптації до граматичних правил.

source: 1. Statements
ru: 1. Утверждения
uk: 1. Твердження

source: For reporting statements, we typically use verbs like <span class='verb-highlight'>say</span>, <span class='verb-highlight'>tell</span>, <span class='verb-highlight'>explain</span>, <span class='verb-highlight'>mention</span>, etc.
ru: Для передачи утверждений мы обычно используем глаголы, такие как <span class='verb-highlight'>say</span> (сказать), <span class='verb-highlight'>tell</span> (рассказать), <span class='verb-highlight'>explain</span> (объяснить), <span class='verb-highlight'>mention</span> (упомянуть) и т.д.
uk: Для повідомлення тверджень ми зазвичай використовуємо дієслова, такі як <span class='verb-highlight'>say</span> (сказати), <span class='verb-highlight'>tell</span> (розповісти), <span class='verb-highlight'>explain</span> (пояснити), <span class='verb-highlight'>mention</span> (згадати) тощо.

source: Structure:
ru: Структура:
uk: Структура:

source: Key Points:
ru: Ключевые моменты:
uk: Ключові моменти:

source: The word <span class='term-highlight'>that</span> is often omitted in informal speech
ru: Слово <span class='term-highlight'>that</span> (что) часто опускается в неформальной речи
uk: Слово <span class='term-highlight'>that</span> (що) часто опускається в неформальній мові

source: <span class='verb-highlight'>Tell</span> must be followed by an object (tell me, tell John)
ru: После <span class='verb-highlight'>Tell</span> (сказать/рассказать) обязательно должно следовать дополнение (tell me, tell John)
uk: Після <span class='verb-highlight'>Tell</span> (розповідати) має стояти додаток (tell me, tell John)

source: <span class='verb-highlight'>Say</span> doesn't take an object directly (say to me, not say me)
ru: После <span class='verb-highlight'>Say</span> (сказать) дополнение не ставится напрямую (say to me, а не say me)
uk: Після <span class='verb-highlight'>Say</span> (сказати) не може стояти прямий додаток (say to me, а не say me)

source: 2. Questions
ru: 2. Вопросы
uk: 2. Питання

source: Questions are reported using verbs like <span class='verb-highlight'>ask</span>, <span class='verb-highlight'>wonder</span>, <span class='verb-highlight'>inquire</span>, etc.
ru: Вопросы передаются с помощью глаголов, таких как <span class='verb-highlight'>ask</span> (спрашивать), <span class='verb-highlight'>wonder</span> (интересоваться), <span class='verb-highlight'>inquire</span> (запрашивать) и т.д.
uk: Питання повідомляються за допомогою дієслів, таких як <span class='verb-highlight'>ask</span> (запитати), <span class='verb-highlight'>wonder</span> (цікавитися), <span class='verb-highlight'>inquire</span> (дізнаватися) тощо.

source: Structure Types:
ru: Типы структур:
uk: Типи структур:

source: Yes/No questions:
ru: Общие вопросы (Yes/No):
uk: Запитання типу 'Так/Ні':

source: Wh-questions:
ru: Специальные вопросы (Wh-questions):
uk: Wh-запитання:

source: Question word order changes to statement order in indirect speech
ru: Порядок слов в вопросе меняется на порядок слов в утверждении в косвенной речи
uk: Порядок слів у питанні змінюється на порядок слів у твердженні в непрямій мові

source: No auxiliary 'do/does/did' is used in the reported question
ru: В переданном вопросе не используются вспомогательные глаголы 'do/does/did'
uk: У повідомленому питанні не використовується допоміжне дієслово 'do/does/did'

source: Question marks are omitted in indirect questions
ru: Вопросительные знаки опускаются в косвенных вопросах
uk: Знаки питання опускаються в непрямих питаннях

source: 3. Commands and Requests
ru: 3. Приказы и просьбы
uk: 3. Накази та прохання

source: Imperatives are reported using verbs like <span class='verb-highlight'>tell</span>, <span class='verb-highlight'>order</span>, <span class='verb-highlight'>ask</span>, <span class='verb-highlight'>request</span>, etc.
ru: Повелительное наклонение передается с помощью глаголов, таких как <span class='verb-highlight'>tell</span> (сказать/велеть), <span class='verb-highlight'>order</span> (приказать), <span class='verb-highlight'>ask</span> (попросить), <span class='verb-highlight'>request</span> (запросить) и т.д.
uk: Наказовий спосіб повідомляється за допомогою дієслів, таких як <span class='verb-highlight'>tell</span> (наказати/сказати), <span class='verb-highlight'>order</span> (наказати), <span class='verb-highlight'>ask</span> (попросити), <span class='verb-highlight'>request</span> (запросити) тощо.

source: Negative Commands:
ru: Отрицательные команды/приказы:
uk: Негативні накази:

source: Reporting Verb Variations
ru: Вариации вводных глаголов
uk: Варіації головних дієслів

source: Speech Type
ru: Тип речи
uk: Тип мовлення

source: Common Reporting Verbs
ru: Распространенные вводные глаголы
uk: Поширені головні дієслова

source: Statements
ru: Утверждения
uk: Твердження

source: Questions
ru: Вопросы
uk: Питання

source: Commands
ru: Приказы
uk: Накази

source: Requests
ru: Просьбы
uk: Прохання

source: Suggestions
ru: Предложения
uk: Пропозиції

source: Special Cases and Advanced Usage
ru: Особые случаи и продвинутое использование
uk: Особливі випадки та просунуте використання

source: <span class='term-highlight'>Reporting modal verbs:</span> Some modals change in indirect speech
ru: <span class='term-highlight'>Передача модальных глаголов:</span> Некоторые модальные глаголы меняются в косвенной речи
uk: <span class='term-highlight'>Повідомлення модальних дієслів:</span> Деякі модальні дієслова змінюються в непрямій мові

source: <span class='term-highlight'>Reporting verb tense:</span> The reporting verb can affect tense usage
ru: <span class='term-highlight'>Время вводного глагола:</span> Вводной глагол может влиять на использование времен
uk: <span class='term-highlight'>Час головного дієслова:</span> Головне дієслово може впливати на використання часів

source: <span class='term-highlight'>Reporting questions with suggestions:</span> Special structures for suggestions
ru: <span class='term-highlight'>Передача вопросов с предложениями:</span> Специальные структуры для предложений
uk: <span class='term-highlight'>Повідомлення питань з пропозиціями:</span> Спеціальні структури для пропозицій

source: Rules for Tense Backshift
ru: Правила сдвига глагольных времен
uk: Правила зсуву часів

source: Rules for Backshift
ru: Правила сдвига времени
uk: Правила зсуву часів

source: Tense Backshift in Indirect Speech
ru: Сдвиг глагольных времен в косвенной речи
uk: Зсув часів (Backshift) у непрямій мові

source: When converting direct speech to indirect speech, verb tenses typically shift back in time. This phenomenon is called 'backshift' and is fundamental to accurate reported speech.
ru: При преобразовании прямой речи в косвенную, глагольные времена, как правило, сдвигаются назад во времени. Это явление называется 'backshift' (сдвиг времени) и является основополагающим для точной передачи речи.
uk: При перетворенні прямої мови в непряму, часи дієслів зазвичай зсуваються назад у часі. Це явище називається «backshift» і є основоположним для правильної непрямої мови.

source: Basic Tense Backshift Rules
ru: Основные правила сдвига глагольных времен
uk: Основні правила зсуву часів

source: The following table shows how tenses change in indirect speech when the reporting verb is in the past tense:
ru: Следующая таблица показывает, как меняются времена в косвенной речи, когда вводной глагол стоит в прошедшем времени:
uk: Наступна таблиця показує, як змінюються часи в непрямій мові, коли головне дієслово стоїть у минулому часі:
