Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: When modifying nouns, prepositional phrases:
ru: При модификации существительных предложные фразы:
uk: При модифікації іменників, прийменникові фрази:

source: Directly follow the nouns they modify
ru: Непосредственно следуют за существительными, которые они определяют
uk: Безпосередньо слідують за іменниками, які вони модифікують

source: Answer <span class="
uk: Відповідають на <span class="

source: Cannot be moved without changing meaning
ru: Не могут быть перемещены без изменения значения
uk: Не можуть бути переміщені без зміни значення

source: Adverbial Function
ru: Функция наречия
uk: Функція прислівника

source: When modifying verbs or clauses, prepositional phrases:
ru: При модификации глаголов или предложений предложные фразы:
uk: При модифікації дієслів або частин речення, прийменникові фрази:

source: Are more flexible in sentence position
ru: Более гибки в позиции в предложении
uk: Є більш гнучкими у розташуванні в реченні

source: Can often be moved for stylistic effect
ru: Часто могут быть перемещены для стилистического эффекта
uk: Часто можуть бути переміщені для стилістичного ефекту

source: Advanced Grammatical Roles
ru: Расширенные грамматические роли
uk: Розширені граматичні ролі

source: Complement vs. Adjunct
ru: Дополнение против Обстоятельства
uk: Доповнення проти Обставини

source: Complement
ru: Дополнение (Complement)
uk: Доповнення

source: Adjunct
ru: Обстоятельство (Adjunct)
uk: Обставина

source: Required by the verb
uk: Вимагається дієсловом

source: Optional information
uk: Необов'язкова інформація

source: Removability
ru: Удаляемость
uk: Можливість видалення

source: Creates incomplete sentence
ru: Создает неполное предложение
uk: Створює неповне речення

source: Can be removed
ru: Может быть удалено
uk: Може бути видалена

source: Special Grammatical Cases
ru: Особые грамматические случаи
uk: Особливі граматичні випадки

source: Verbal Complements:
uk: Дієслівні доповнення:

source: Some verbs require specific prepositions:
ru: Некоторые глаголы требуют определенных предлогов:
uk: Деякі дієслова вимагають певних прийменників:

source: Passive Constructions:
uk: Пасивні конструкції:

source: Prepositions remain after verb passivization:
ru: Предлоги остаются после пассивизации глагола:
uk: Прийменники залишаються після пасивізації дієслова:

source: Comparative Structures:
uk: Порівняльні структури:

source: Used in comparative expressions:
ru: Используется в сравнительных выражениях:
uk: Використовуються в порівняльних виразах:

source: Prepositions: Of, Since, To, and With
ru: Предлоги: Of, Since, To, и With
uk: Прийменники: Of, Since, To та With

source: Of, Since, To, and With
ru: Of, Since, To, и With
uk: Of, Since, To та With

source: Mastering the Prepositions: Of, Since, To, and With
ru: Освоение предлогов: Of, Since, To, и With
uk: Опанування прийменників: Of, Since, To та With

source: These four prepositions are among the most versatile in English, each serving multiple grammatical functions essential for precise communication.
ru: Эти четыре предлога являются одними из самых универсальных в английском языке, каждый из которых выполняет несколько грамматических функций, необходимых для точного общения.
uk: Ці чотири прийменники є одними з найбільш універсальних в англійській мові, кожен з яких виконує безліч граматичних функцій, необхідних для точного спілкування.

source: 1. The Preposition 'Of'
ru: 1. Предлог 'Of'
uk: 1. Прийменник 'Of'

source: Possession
uk: Володіння

source: Shows ownership or belonging
ru: Показывает владение или принадлежность
uk: Показує власність або приналежність

source: Composition
uk: Склад

source: Indicates what something is made from
ru: Указывает, из чего что-то сделано
uk: Вказує, з чого щось зроблене

source: Reference
uk: Посилання/Відношення

source: About a particular subject
ru: О конкретном предмете
uk: Про певну тему

source: Special Constructions with 'Of'
ru: Особые конструкции с 'Of'
uk: Спеціальні конструкції з 'Of'

source: Part of a group
uk: Частина групи

source: For specific times
uk: Для конкретного часу

source: To show qualities
uk: Для демонстрації якостей

source: 2. The Preposition 'Since'
ru: 2. Предлог 'Since'
uk: 2. Прийменник 'Since'

source: From a specific past time until now
uk: Від певного часу в минулому дотепер

source: Reason/cause
uk: Причина/підстава

source: Because of (formal usage)
ru: Из-за (формальное использование)
uk: Через (офіційне вживання)

source: Continuation
uk: Продовження

source: With present perfect/perfect continuous
ru: С Present Perfect/Perfect Continuous
uk: З теперішнім доконаним/тривалим доконаним часом

source: Important Notes about 'Since'
ru: Важные замечания о 'Since'
uk: Важливі примітки щодо 'Since'

source: Always refers to a point in time (not duration)
ru: Всегда относится к моменту времени (не к продолжительности)
uk: Завжди посилається на момент часу (а не на тривалість)

source: Typically used with perfect tenses
ru: Обычно используется с перфектными временами
uk: Зазвичай використовується з доконаними часами

source: Can begin a sentence when showing reason
ru: Может начинать предложение, когда показывает причину
uk: Може розпочинати речення, коли вказує на причину

source: 3. The Preposition 'To'
ru: 3. Предлог 'To'
uk: 3. Прийменник 'To'

source: Movement toward a place
uk: Рух до місця

source: Recipient
uk: Одержувач

source: Person receiving something
ru: Человек, получающий что-то
uk: Особа, що отримує щось

source: Until a certain time
ru: До определенного времени
uk: До певного часу

source: Showing a ratio or relationship
ru: Показывает соотношение или отношение
uk: Показ співвідношення або зв'язку

source: Special Patterns with 'To'
ru: Особые шаблоны с 'To'
uk: Спеціальні моделі з 'To'

source: Many verbs require this preposition
uk: Багато дієслів вимагають цього прийменника

source: Common with feelings and reactions
uk: Поширений з почуттями та реакціями

source: Direction vs. location
uk: Напрямок проти місця розташування

source: 4. The Preposition 'With'
ru: 4. Предлог 'With'
uk: 4. Прийменник 'With'

source: Accompaniment
uk: Супровід

source: Together with someone
ru: Вместе с кем-то
uk: Разом з кимось

source: Instrument
uk: Інструмент

source: Tool or means used
ru: Используемый инструмент или средство
uk: Використаний інструмент або засіб

source: Way something is done
ru: Способ, которым что-то делается
uk: Спосіб, яким щось зроблено

source: Having something
ru: Наличие чего-то
uk: Наявність чогось

source: Idiomatic Uses of 'With'
ru: Идиоматическое использование 'With'
uk: Ідіоматичне вживання 'With'

source: Describing feelings
uk: Опис почуттів

source: Suffering from
uk: Страждання від

source: In agreement
uk: У згоді

source: Comparative Usage: Key Distinctions
ru: Сравнительное использование: Ключевые различия
uk: Порівняльне вживання: Ключові відмінності

source: These prepositions sometimes cause confusion. Here's how to distinguish them:
ru: Эти предлоги иногда вызывают путаницу. Вот как их различать:
uk: Ці прийменники іноді викликають плутанину. Ось як їх розрізняти:

source: Correct Usage
ru: Правильное использование
uk: Правильне вживання

source: 'Of' vs. 'From'
uk: 'Of' проти 'From'

source: 'Since' vs. 'For'
uk: 'Since' проти 'For'

source: 'To' vs. 'With'
uk: 'To' проти 'With'

source: Prepositional Phrases: Structure and Function
ru: Предложные фразы: Структура и функция
uk: Прийменникові фрази: Структура та функція

source: Mastering Prepositional Phrases
ru: Освоение предложных фраз
uk: Опанування прийменникових фраз

source: Prepositional phrases are essential building blocks in English grammar that add depth and detail to sentences by showing relationships between different elements.
ru: Предложные фразы являются важными строительными блоками в английской грамматике, которые добавляют глубину и детализацию предложениям, показывая отношения между различными элементами.
uk: Прийменникові фрази є основними будівельними блоками в англійській граматиці, які додають глибини та деталізації реченням, показуючи зв'язки між різними елементами.

source: Anatomy of a Prepositional Phrase
ru: Анатомия предложной фразы
uk: Анатомія прийменникової фрази

source: Every prepositional phrase contains these core components:
ru: Каждая предложная фраза содержит эти основные компоненты:
uk: Кожна прийменникова фраза містить ці основні компоненти:

source: 1. The Preposition
ru: 1. Предлог
uk: 1. Прийменник

source: Always comes first in the phrase
ru: Всегда стоит первым в фразе
uk: Завжди стоїть першим у фразі

source: Determines the type of relationship shown
ru: Определяет тип показанных отношений
uk: Визначає тип показаного зв'язку

source: Can be simple (in), compound (inside), or phrasal (in front of)
ru: Может быть простым (in), составным (inside) или фразовым (in front of)
uk: Може бути простим (in), складеним (inside) або фразовим (in front of)

source: 2. The Object
ru: 2. Объект
uk: 2. Доповнення

source: Always a noun, pronoun, or noun equivalent
ru: Всегда является существительным, местоимением или эквивалентом существительного
uk: Завжди іменник, займенник або еквівалент іменника

source: Cannot be a verb (except gerunds)
ru: Не может быть глаголом (за исключением герундиев)
uk: Не може бути дієсловом (крім герундіїв)

source: May include determiners (the, my) or adjectives
ru: Может включать определители (the, my) или прилагательные
uk: Може включати визначники (the, my) або прикметники

source: 3. Modifiers (Optional)
ru: 3. Модификаторы (Необязательно)
uk: 3. Модифікатори (Необов'язково)

source: Add descriptive detail to the object
ru: Добавляют описательные детали к объекту
uk: Додають описові деталі до доповнення

source: Can include adjectives, adjective phrases, or other modifiers
ru: Могут включать прилагательные, прилагательные фразы или другие модификаторы
uk: Можуть включати прикметники, прикметникові фрази або інші модифікатори

source: Make the phrase more specific
ru: Делают фразу более конкретной
uk: Роблять фразу більш конкретною

source: Prepositional phrases serve two primary functions in sentences, each with distinct characteristics:
ru: Предложные фразы выполняют две основные функции в предложениях, каждая из которых имеет свои отличительные характеристики:
uk: Прийменникові фрази виконують дві основні функції в реченнях, кожна з яких має відмінні характеристики:

source: 1. Adjective Phrases
ru: 1. Фразы-прилагательные
uk: 1. Прикметникові фрази

source: When functioning as adjectives, prepositional phrases:
ru: Когда функционируют как прилагательные, предложные фразы:
uk: Коли функціонують як прикметники, прийменникові фрази:

source: Modify nouns or pronouns
ru: Определяют существительные или местоимения
uk: Модифікують іменники або займенники

source: Answer the questions <span class="
uk: Відповідають на запитання <span class="

source: Always appear immediately after the noun they modify
ru: Всегда появляются сразу после существительного, которое они определяют
uk: Завжди з'являються одразу після іменника, який вони модифікують

source: 2. Adverb Phrases
ru: 2. Фразы-наречия
uk: 2. Прислівникові фрази

source: When functioning as adverbs, prepositional phrases:
ru: Когда функционируют как наречия, предложные фразы:
uk: Коли функціонують як прислівники, прийменникові фрази:

source: Answer questions like <span class="
uk: Відповідають на запитання на зразок <span class="

source: Can appear in various positions in the sentence
ru: Могут появляться в различных позициях в предложении
uk: Можуть з'являтися в різних позиціях у реченні

source: Advanced Usage Patterns
ru: Расширенные модели использования
uk: Розширені моделі вживання

source: Multiple Prepositional Phrases
ru: Множественные предложные фразы
uk: Кілька прийменникових фраз

source: Sentences often contain multiple prepositional phrases that work together:
uk: Речення часто містять кілька прийменникових фраз, які працюють разом:

source: Distinguishing Between Functions
ru: Различение функций
uk: Розрізнення між функціями

source: Adjective Phrase
ru: Фраза-прилагательное
uk: Прикметникова фраза

source: Adverb Phrase
ru: Фраза-наречие
uk: Прислівникова фраза

source: Nouns/Pronouns
ru: Существительные/Местоимения
uk: Іменники/Займенники

source: Verbs/Adjectives/Adverbs
ru: Глаголы/Прилагательные/Наречия
uk: Дієслова/Прикметники/Прислівники

source: Right after noun
ru: Сразу после существительного
uk: Одразу після іменника

source: Flexible
ru: Гибкая
uk: Гнучке

source: Which one? What kind?
ru: Какой? Какого рода?
uk: Який? Якого роду?

source: Where? When? How? Why?
ru: Где? Когда? Как? Почему?
uk: Де? Коли? Як? Чому?

source: While acceptable in speech, avoid in formal writing
uk: Хоча це прийнятно в усному мовленні, уникайте в офіційному письмі

source: Keep adjective phrases close to the nouns they modify
uk: Тримайте прикметникові фрази близько до іменників, які вони модифікують

source: Prepositions: Semantic Relationships and Meaning
ru: Предлоги: Семантические отношения и значение
uk: Прийменники: Семантичні зв'язки та значення

source: Semantic Relationships
ru: Семантические отношения
uk: Семантичні зв'язки

source: The Meaning Behind Prepositions
ru: Смысл, стоящий за предлогами
uk: Значення, що стоїть за прийменниками

source: Prepositions create rich semantic networks in language, establishing precise relationships between ideas, objects, and actions. Understanding these relationships is key to mastering English expression.
ru: Предлоги создают богатые семантические сети в языке, устанавливая точные отношения между идеями, объектами и действиями. Понимание этих отношений является ключом к освоению английского выражения.
uk: Прийменники створюють багаті семантичні мережі в мові, встановлюючи точні зв'язки між ідеями, об'єктами та діями. Розуміння цих зв'язків є ключем до опанування англійського вираження.

source: 1. Temporal Relationships
ru: 1. Временные отношения
uk: 1. Часові зв'язки

source: Core Time Prepositions
uk: Основні прийменники часу

source: for precise times (at 3pm)
uk: для точного часу (at 3pm)

source: for days/dates (on Monday)
uk: для днів/дат (on Monday)

source: for months/years/seasons (in summer)
uk: для місяців/років/пір року (in summer)

source: duration (for two hours)
uk: тривалість (for two hours)

source: from past to present (since 2010)
uk: з минулого по теперішній час (since 2010)

source: Nuanced Time Relationships
uk: Нюансовані часові зв'язки

source: Earlier than
uk: Раніше ніж

source: Later than
uk: Пізніше ніж

source: Throughout
uk: Протягом

source: 2. Spatial Relationships
ru: 2. Пространственные отношения
uk: 2. Просторові зв'язки

source: Basic Spatial Concepts
uk: Основні просторові поняття

source: enclosed space (in the room)
uk: закритий простір (in the room)

source: surface contact (on the wall)
uk: контакт з поверхнею (on the wall)

source: specific point (at the door)
uk: конкретна точка (at the door)

source: below something (under the table)
uk: нижче чогось (under the table)

source: in the middle of two (between the houses)
uk: посеред двох (between the houses)

source: Advanced Spatial Concepts
uk: Розширені просторові поняття

source: suggests being covered
uk: натякає на те, що його покрито

source: implies being surrounded
uk: має на увазі, що його оточено

source: indicates close proximity
uk: вказує на близьку відстань

source: 3. Causal Relationships
ru: 3. Причинно-следственные отношения
uk: 3. Причинно-наслідкові зв'язки

source: Types of Causal Connections
ru: Типы причинно-следственных связей
uk: Типи причинно-наслідкових зв'язків

source: Direct Cause:
uk: Пряма причина:

source: Reason/Purpose:
uk: Підстава/Мета:

source: Agent in Passive:
uk: Дійова особа в пасиві:

source: Nuanced Causal Prepositions
uk: Нюансовані причинні прийменники

source: formal cause (The delay was due to weather)
uk: офіційна причина (Затримка відбулася через погоду)

source: similar to 'due to' but less common
uk: схоже на 'due to' (через), але менш поширене

source: often positive (We succeeded thanks to teamwork)
uk: часто має позитивне значення (Ми досягли успіху завдяки командній роботі)

source: 4. Manner and Method
ru: 4. Образ действия и метод
uk: 4. Спосіб та Метод

source: Expressing How Actions Are Performed
ru: Выражение того, как выполняются действия
uk: Вираження того, як виконуються дії

source: using instrument (Write with a pen)
uk: використання інструменту (Писати ручкою)

source: means/method (Travel by train)
uk: засіб/метод (Подорожувати потягом)

source: style/manner (Speak in whispers)
uk: стиль/манера (Говорити пошепки)

source: similarity (Act like a professional)
uk: подібність (Діяти як професіонал)

source: Special Manner Expressions
uk: Спеціальні вирази способу дії

source: Prepositions: Simple, Compound, and Phrasal
ru: Предлоги: Простые, составные и фразовые
uk: Прийменники: Прості, складені та фразові

source: Simple, Compound, and Phrasal Prepositions
ru: Простые, составные и фразовые предлоги
uk: Прості, складені та фразові прийменники

source: Understanding Preposition Types
ru: Понимание типов предлогов
uk: Розуміння типів прийменників

source: Prepositions can be categorized by their structure into three distinct types, each serving unique grammatical functions while maintaining the core purpose of showing relationships between sentence elements.
ru: Предлоги можно разделить по структуре на три различных типа, каждый из которых выполняет уникальные грамматические функции, сохраняя при этом основную цель — показывать отношения между элементами предложения.
uk: Прийменники можна класифікувати за їхньою структурою на три різні типи, кожен з яких виконує унікальні граматичні функції, зберігаючи основну мету — показувати зв'язки між елементами речення.

source: 1. Simple Prepositions
ru: 1. Простые предлоги
uk: 1. Прості прийменники

source: These are the most fundamental prepositions in English, consisting of just one word that establishes clear relationships between nouns/pronouns and other sentence elements.
ru: Это самые основные предлоги в английском языке, состоящие всего из одного слова, которое устанавливает четкие отношения между существительными/местоимениями и другими элементами предложения.
uk: Це найбільш фундаментальні прийменники в англійській мові, що складаються лише з одного слова, яке встановлює чіткі зв'язки між іменниками/займенниками та іншими елементами речення.

source: Core Examples
uk: Основні приклади

source: Functional Characteristics
ru: Функциональные характеристики
uk: Функціональні характеристики

source: Most versatile and most commonly used prepositions
uk: Найбільш універсальні та найпоширеніші прийменники

source: Can express time, place, direction, manner, and other relationships
ru: Может выражать отношения времени, места, направления, образа действия и другие
uk: Може виражати час, місце, напрямок, спосіб та інші зв'язки

source: Often polysemous (having multiple meanings)
ru: Часто многозначны (имеют несколько значений)
uk: Часто полісемічні (мають багато значень)

source: Contextual Examples
uk: Приклади в контексті

source: 2. Compound Prepositions
ru: 2. Составные предлоги
uk: 2. Складені прийменники

source: These single-word prepositions are formed by combining a prefix with a noun, adjective, or adverb, creating more specific spatial or temporal relationships.
ru: Эти однословные предлоги образуются путем объединения префикса с существительным, прилагательным или наречием, создавая более конкретные пространственные или временные отношения.
uk: Ці однослівні прийменники утворюються шляхом поєднання префікса з іменником, прикметником або прислівником, створюючи більш специфічні просторові або часові зв'язки.

source: Formation Patterns
uk: Моделі утворення

source: Key Features
ru: Ключевые особенности
uk: Ключові особливості

source: Often indicate more precise spatial relationships
ru: Часто указывают на более точные пространственные отношения
uk: Часто вказують на більш точні просторові зв'язки

source: Frequently paired with specific verbs or contexts
ru: Часто сочетаются с определенными глаголами или контекстами
uk: Часто поєднуються з конкретними дієсловами або контекстами

source: Some can function as both prepositions and adverbs
ru: Некоторые могут функционировать как предлоги, так и наречия
uk: Деякі можуть функціонувати як прийменники, так і як прислівники

source: Usage Examples
uk: Приклади вживання

source: 3. Phrasal Prepositions
ru: 3. Фразовые предлоги
uk: 3. Фразові прийменники

source: These complex prepositions consist of two or more words that function together as a single prepositional unit, often expressing more nuanced or abstract relationships.
ru: Эти сложные предлоги состоят из двух или более слов, которые функционируют вместе как единая предложная единица, часто выражая более тонкие или абстрактные отношения.
uk: Ці складні прийменники складаються з двох або більше слів, які функціонують разом як єдина прийменникова одиниця, часто виражаючи більш тонкі або абстрактні зв'язки.

source: Common Structures
uk: Поширені структури

source: Functional Roles
ru: Функциональные роли
uk: Функціональні ролі

source: Express cause-effect relationships (because of)
ru: Выражают причинно-следственные связи (because of - из-за)
uk: Виражають причинно-наслідкові зв'язки (because of)

source: Indicate exceptions (with the exception of)
ru: Указывают на исключения (with the exception of - за исключением)
uk: Вказують на винятки (with the exception of)

source: Show spatial arrangements (in between)
ru: Показывают пространственное расположение (in between - между)
uk: Показують просторове розташування (in between)

source: Demonstrate perspective (according to)
ru: Демонстрируют точку зрения (according to - согласно)
uk: Демонструють точку зору (according to)

source: Practical Examples
uk: Практичні приклади

source: Phrasal
uk: Фразовий

source: Word Count
ru: Количество слов
uk: Кількість слів

source: Single morpheme
uk: Один морфем

source: Prefix + root
uk: Префікс + корінь

source: Multiple words
uk: Кілька слів

source: Medium
uk: Середня

source: Low (fixed phrases)
ru: Низкая (фиксированные фразы)
uk: Низька (фіксовані фрази)

source: Meaning Specificity
ru: Специфичность значения
uk: Специфічність значення

source: Often multiple meanings
uk: Часто багато значень

source: More specific
uk: Більш специфічне

source: Very specific
uk: Дуже специфічне

source: Special Usage Notes
ru: Особые замечания по использованию
uk: Спеціальні примітки щодо вживання

source: When to Use Which Type
ru: Когда использовать какой тип
uk: Коли використовувати який тип

source: For basic, everyday relationships
ru: Для базовых, повседневных отношений
uk: Для основних, повсякденних зв'язків

source: When multiple interpretations are possible
ru: Когда возможны множественные толкования
uk: Коли можливі кілька інтерпретацій

source: In idiomatic expressions
ru: В идиоматических выражениях
uk: В ідіоматичних виразах

source: When precise spatial relationships are needed
uk: Коли потрібні точні просторові зв'язки

source: With specific verbs they commonly pair with
uk: З конкретними дієсловами, з якими вони зазвичай поєднуються

source: To avoid ambiguity of simple prepositions
uk: Щоб уникнути двозначності простих прийменників

source: For formal or academic writing
uk: Для формального або академічного письма

source: When expressing complex relationships
uk: При вираженні складних зв'язків

source: In set phrases and formal expressions
uk: У сталих фразах та формальних виразах

source: Prepositions: Standard Placement Rules
ru: Предлоги: Правила стандартного размещения
uk: Прийменники: Правила стандартного розташування

source: Standard Placement
ru: Стандартное размещение
uk: Стандартне розташування
