Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: This is the primary use. It emphasizes the duration of an activity that was ongoing before a specific time or another completed action in the past.
ru: Это основное использование. Оно подчеркивает **длительность** действия, которое продолжалось до определенного момента или до другого завершенного действия в прошлом.
uk: Це основне використання. Воно підкреслює тривалість діяльності, яка відбувалася до певного часу або іншої завершеної дії в минулому.

source: He waited for two hours, and then she arrived.
ru: Он ждал два часа, а затем она приехала.
uk: Він чекав дві години, а потім вона прибула.

source: First, I ran for an hour; then, I was tired.
ru: Сначала я бегал час; затем я устал.
uk: Спочатку я бігав годину, потім втомився.

source: They lived there for ten years, then they sold it.
ru: Они жили там десять лет, а затем продали его.
uk: Вони жили там десять років, потім продали.

source: To Show Cause and Effect in the Past:
ru: 2. Для указания причины и следствия в прошлом:
uk: Для Показу Причини Та Наслідку У Минулому:

source: The Past Perfect Continuous describes the cause (an ongoing action) of a past result.
ru: Past Perfect Continuous описывает причину (продолжающееся действие) прошлого результата.
uk: Past Perfect Continuous описує причину (триваючу дію) минулого результату.

source: The rain caused the wet ground.
ru: Дождь стал причиной мокрой земли.
uk: Дощ спричинив мокру землю.

source: Lack of studying caused the failure.
ru: Недостаток учебы стал причиной провала.
uk: Відсутність навчання призвела до провалу.

source: When reporting something that was originally said in the Present Perfect Continuous or Past Continuous, the tense shifts to the Past Perfect Continuous.
ru: При передаче сообщения, которое изначально было сказано в Present Perfect Continuous или Past Continuous, время смещается в Past Perfect Continuous.
uk: При передачі чогось, що було спочатку сказано в Present Perfect Continuous або Past Continuous, час змінюється на Past Perfect Continuous.

source: Past Perfect Continuous vs. Past Perfect Simple
ru: Past Perfect Continuous против Past Perfect Simple
uk: Past Perfect Continuous проти Past Perfect Simple

source: Emphasizes the <i>duration</i> or the <i>process</i> of an action up to a certain point in the past.
ru: Подчеркивает ***длительность*** или ***процесс*** действия, продолжавшегося до определенного момента в прошлом.
uk: Наголошує на <i>тривалості</i> або <i>процесі</i> дії до певного моменту в минулому.

source: Focus on the <i>process</i> of writing.
ru: Акцент на ***процессе*** написания.
uk: Акцент на <i>процесі</i> написання.

source: Emphasizes the <i>completion</i> of an action before a certain point in the past, or the <i>result</i> of the action.
ru: Подчеркивает ***завершение*** действия до определенного момента в прошлом или ***результат*** действия.
uk: Наголошує на <i>завершенні</i> дії до певного моменту в минулому, або на <i>результаті</i> дії.

source: Focus on the <i>completion</i> of the report.
ru: Акцент на ***завершении*** отчета.
uk: Акцент на <i>завершенні</i> звіту.

source: Focus on the <i>result</i> - my work was done.
ru: Акцент на ***результате*** — моя работа была выполнена.
uk: Акцент на <i>результаті</i> – моя робота була виконана.

source: Sometimes, especially with verbs like
ru: Иногда, особенно с глаголами, такими как
uk: Іноді, особливо з такими дієсловами, як

source: the Past Perfect Simple can be used to talk about duration, and the meaning is very similar:
ru: Past Perfect Simple может использоваться, чтобы говорить о длительности, и значение очень похоже:
uk: Past Perfect Simple може використовуватися для розмови про тривалість, і значення дуже схоже:

source: Both are correct and mean similar things, with the continuous emphasizing the ongoing nature.
ru: Оба варианта правильны и означают схожие вещи, при этом Continuous подчеркивает продолжающийся характер.
uk: Обидва варіанти правильні та означають схожі речі, причому continuous підкреслює триваючий характер.

source: The Past Perfect Continuous helps to provide a more dynamic description of past events, showing how long something was happening before something else occurred.
ru: Past Perfect Continuous помогает обеспечить более динамичное описание прошлых событий, показывая, как долго что-то происходило, прежде чем случилось что-то другое.
uk: Past Perfect Continuous допомагає надати більш динамічний опис минулих подій, показуючи, як довго щось відбувалося до того, як сталося щось інше.

source: The Past Simple
ru: Простое прошедшее время (The Past Simple)
uk: Простий Минулий Час (Past Simple)

source: Formation of the Past Simple
ru: Образование Past Simple
uk: Утворення Простого Минулого Часу

source: The formation of the Past Simple differs for <span class=\
ru: Образование Past Simple различается для <span class=\
uk: Утворення Past Simple відрізняється для <span class=\

source: Regular Verbs:
ru: Правильные глаголы:
uk: Правильні Дієслова:

source: Add
ru: Добавить
uk: Додати

source: to the base form of the verb.
ru: к базовой форме глагола.
uk: до базової форми дієслова.

source: Irregular Verbs:
ru: Неправильные глаголы:
uk: Неправильні Дієслова:

source: These verbs have unique past simple forms that must be memorized.
ru: Эти глаголы имеют уникальные формы Past Simple, которые необходимо запомнить.
uk: Ці дієслова мають унікальні форми Past Simple, які потрібно запам'ятовувати.

source: Regular Verb
ru: Правильный глагол
uk: Правильне Дієслово

source: Irregular Verb
ru: Неправильный глагол
uk: Неправильне Дієслово

source: Spelling Rules for Adding -ed to Regular Verbs:
ru: Правила правописания для добавления -ed к правильным глаголам:
uk: Правила Правопису Для Додавання -ed до Правильних Дієслів:

source: Most verbs simply add
ru: Большинство глаголов просто добавляют
uk: Більшість дієслів просто додають

source: Verbs ending in
ru: Глаголы, оканчивающиеся на
uk: Дієслова, що закінчуються на

source: just add
ru: просто добавляют
uk: просто додають

source: Verbs ending in a <span class=\
ru: Глаголы, оканчивающиеся на <span class=\
uk: Дієслова, що закінчуються на <span class=\

source: to
ru: на
uk: на

source: and add
ru: и добавляют
uk: та додають

source: does not change
ru: не меняется
uk: не змінюється

source: Verbs ending in <span class=\
ru: Глаголы, оканчивающиеся на <span class=\
uk: Дієслова, що закінчуються на <span class=\

source: In British English, verbs ending in a single <span class=\
ru: В британском английском, глаголы, оканчивающиеся на одну <span class=\
uk: У Британській англійській дієслова, що закінчуються на одну <span class=\

source: In American English, the
ru: В американском английском
uk: В Американській англійській

source: is not doubled unless the last syllable is stressed.
ru: не удваивается, если только последний слог не находится под ударением.
uk: не подвоюється, якщо останній склад не є наголошеним.

source: To form negative sentences, we use the auxiliary verb <span class=\
ru: Для образования отрицательных предложений мы используем вспомогательный глагол <span class=\
uk: Для утворення заперечних речень ми використовуємо допоміжне дієслово <span class=\

source: The verb
ru: Глагол
uk: Дієслово

source: does not use
ru: не использует
uk: не використовує

source: for negatives.
ru: для отрицаний.
uk: для заперечень.

source: NOT
ru: НЕ
uk: НЕ

source: To form questions, we use the auxiliary verb <span class=\
ru: Для образования вопросов мы используем вспомогательный глагол <span class=\
uk: Для утворення питань ми використовуємо допоміжне дієслово <span class=\

source: Main Verb (Base Form)
ru: Основной глагол (Базовая форма)
uk: Основне Дієслово (Базова Форма)

source: Again,
ru: Опять же,
uk: Знову ж таки,

source: forms questions differently.
ru: образует вопросы по-другому.
uk: утворює питання по-іншому.

source: Uses of the Past Simple
ru: Использование Past Simple
uk: Використання Past Simple

source: The Past Simple is used to express:
ru: Past Simple используется для выражения:
uk: Past Simple використовується для вираження:

source: Completed Actions in the Past at a Specific Time:
ru: 1. Завершенные действия в прошлом в определенное время:
uk: Завершені Дії У Минулому У Певний Час:

source: The action began and ended in the past, and the time is usually mentioned or implied.
ru: Действие началось и закончилось в прошлом, и время обычно упоминается или подразумевается.
uk: Дія розпочалася і закінчилася в минулому, і час зазвичай згадується або мається на увазі.

source: A Series of Completed Actions in the Past:
ru: 2. Серия завершенных действий в прошлом:
uk: Серія Завершених Дій У Минулому:

source: Used to describe events in chronological order, often in storytelling.
ru: Используется для описания событий в хронологическом порядке, часто в повествовании.
uk: Використовується для опису подій у хронологічному порядку, часто в оповіданні.

source: Past Habits or Routines:
ru: 3. Прошлые привычки или повторяющиеся действия:
uk: Минулі Звички Або Розпорядки:

source: Actions that happened regularly in the past but don't happen anymore. Often used with adverbs like
ru: Действия, которые регулярно происходили в прошлом, но больше не происходят. Часто используются с наречиями, такими как
uk: Дії, які регулярно відбувалися в минулому, але більше не відбуваються. Часто вживається з прислівниками, такими як

source: in the past
ru: в прошлом
uk: у минулому

source: is also common for past habits: <i>
ru: также часто используется для прошлых привычек: <i>
uk: також поширений для минулих звичок: <i>

source: Facts or Generalizations About the Past:
ru: 4. Факты или обобщения о прошлом:
uk: Факти Або Узагальнення Щодо Минулого:

source: States that were true in the past but may not be true now.
ru: Утверждения, которые были правдивы в прошлом, но могут быть неправдивы сейчас.
uk: Стани, які були правдивими в минулому, але можуть бути неправдивими зараз.

source: In Type 2 Conditional Sentences:
ru: 5. В условных предложениях 2-го типа:
uk: В Умовних Реченнях Другого Типу:

source: Time Expressions Used with the Past Simple
ru: Временные выражения, используемые с Past Simple
uk: Часові Вирази, Що Використовуються З Past Simple

source: Common time expressions that indicate a specific past time and are typically used with the Past Simple include:
ru: Распространенные временные выражения, которые указывают на конкретное прошедшее время и обычно используются с Past Simple, включают:
uk: Поширені часові вирази, які вказують на конкретний минулий час і зазвичай використовуються з Past Simple, включають:

source: or any specific year
ru: или любой конкретный год
uk: або будь-який конкретний рік

source: or any specific day
ru: или любой конкретный день
uk: або будь-який конкретний день

source: or any specific past period
ru: или любой конкретный прошедший период
uk: або будь-який конкретний минулий період

source: The Past Simple is fundamental for talking about history, personal anecdotes, and any events that have concluded in the past.
ru: Past Simple является основополагающим для рассказа об истории, личных анекдотах и любых событиях, которые завершились в прошлом.
uk: Past Simple є фундаментальним для розмови про історію, особисті анекдоти та будь-які події, які завершилися в минулому.

source: Person and Number of the English Verb
ru: Лицо и число английского глагола
uk: Особа та Число Англійського Дієслова

source: In English, verbs generally do not change their form significantly based on the person and number of the subject, unlike many other languages. The primary exception occurs in the <span class=\
ru: В английском языке глаголы, как правило, не меняют свою форму значительно в зависимости от лица и числа подлежащего, в отличие от многих других языков. Основное исключение происходит в <span class=\
uk: В англійській мові дієслова, як правило, не змінюють свою форму суттєво залежно від особи та числа підмета, на відміну від багатьох інших мов. Основний виняток трапляється в <span class=\

source: Conjugation by Person and Number (Present Simple)
ru: Спряжение по лицу и числу (Present Simple)
uk: Дієвідмінювання за Особою та Числом (Present Simple)

source: For most verbs, the form remains the same for all persons and numbers, except for the <span class=\
ru: Для большинства глаголов форма остается одинаковой для всех лиц и чисел, за исключением <span class=\
uk: Для більшості дієслів форма залишається однаковою для всіх осіб та чисел, за винятком <span class=\

source: First Person Singular:
ru: Первое лицо, единственное число:
uk: Перша Особа Однини:

source: I
ru: Я
uk: Я

source: Second Person Singular:
ru: Второе лицо, единственное число:
uk: Друга Особа Однини:

source: You
ru: Ты/Вы
uk: Ти/Ви

source: Third Person Singular:
ru: Третье лицо, единственное число:
uk: Третя Особа Однини:

source: He, She, It
ru: Он, Она, Оно
uk: Він, Вона, Воно

source: First Person Plural:
ru: Первое лицо, множественное число:
uk: Перша Особа Множини:

source: We
ru: Мы
uk: Ми

source: Second Person Plural:
ru: Второе лицо, множественное число:
uk: Друга Особа Множини:

source: Third Person Plural:
ru: Третье лицо, множественное число:
uk: Третя Особа Множини:

source: They
ru: Они
uk: Вони

source: Rules for Adding -s / -es in Third Person Singular (Present Simple)
ru: Правила добавления -s / -es в третьем лице единственного числа (Present Simple)
uk: Правила Додавання -s / -es у Третій Особі Однини (Present Simple)

source: The rules for adding <span class=\
ru: Правила добавления <span class=\
uk: Правила додавання <span class=\

source: Most verbs simply add <span class=\
ru: Большинство глаголов просто добавляют <span class=\
uk: Більшість дієслів просто додають <span class=\

source: In other tenses (e.g., Past Simple, Future Simple) and with modal verbs, English verbs typically do not change their form based on person or number, which simplifies conjugation considerably compared to many other languages.
ru: В других временах (например, Past Simple, Future Simple) и с модальными глаголами английские глаголы, как правило, не меняют свою форму в зависимости от лица или числа, что значительно упрощает спряжение по сравнению со многими другими языками.
uk: В інших часах (наприклад, Past Simple, Future Simple) та з модальними дієсловами, англійські дієслова зазвичай не змінюють свою форму залежно від особи чи числа, що значно спрощує дієвідмінювання порівняно з багатьма іншими мовами.

source: Phrasal Verbs
ru: Фразовые глаголы (Phrasal Verbs)
uk: Фразові Дієслова

source: Understanding phrasal verbs is crucial for fluent communication, as they are used constantly by native speakers. Their meanings can sometimes be deduced from context, but often they need to be learned as distinct vocabulary items.
ru: Понимание фразовых глаголов имеет решающее значение для свободного общения, так как они постоянно используются носителями языка. Их значение иногда можно вывести из контекста, но часто их необходимо изучать как отдельные словарные единицы.
uk: Розуміння фразових дієслів є вирішальним для вільного спілкування, оскільки носії мови використовують їх постійно. Їхнє значення іноді можна вивести з контексту, але часто їх потрібно вивчати як окремі лексичні одиниці.

source: Common Phrasal Verbs
ru: Распространенные фразовые глаголы
uk: Поширені Фразові Дієслова

source: Here's a table with some common phrasal verbs, their meanings, and example sentences.
ru: Вот таблица с некоторыми распространенными фразовыми глаголами, их значениями и примерами предложений.
uk: Ось таблиця з деякими поширеними фразовими дієсловами, їхніми значеннями та прикладами речень.

source: Phrasal Verb
ru: Фразовый глагол
uk: Фразове Дієслово

source: To stop working (for a machine)
ru: Перестать работать (о машине)
uk: Перестати працювати (про машину)

source: To lose control of one's feelings
ru: Потерять контроль над своими чувствами
uk: Втратити контроль над своїми почуттями

source: To raise (a child)
ru: Воспитывать (ребенка)
uk: Виховувати (дитину)

source: To mention (a topic)
ru: Упомянуть (тему)
uk: Згадувати (тему)

source: To cancel something
ru: Отменить что-либо
uk: Скасувати щось

source: To find or meet by chance
ru: Наткнуться или встретить случайно
uk: Випадково знайти або зустріти

source: To have a friendly relationship with someone
ru: Поддерживать дружеские отношения с кем-либо
uk: Мати дружні стосунки з кимось

source: To recover from an illness, shock, or disappointment
ru: Оправиться от болезни, шока или разочарования
uk: Оговтатися від хвороби, шоку або розчарування

source: To stop trying/quit
ru: Перестать пытаться/бросить
uk: Припинити спроби/кинути

source: To stop doing something (a habit)
ru: Прекратить что-либо делать (привычку)
uk: Перестати робити щось (звичку)

source: To take care of someone or something
ru: Заботиться о ком-либо или чем-либо
uk: Дбати про когось або щось

source: To search for something
ru: Искать что-либо
uk: Шукати щось

source: To search for information (in a dictionary, on the internet, etc.)
ru: Искать информацию (в словаре, в интернете и т. д.)
uk: Шукати інформацію (у словнику, в Інтернеті тощо)

source: To invent (a story, an excuse)
ru: Придумать (историю, оправдание)
uk: Вигадувати (історію, виправдання)

source: To reconcile after an argument
ru: Помириться после ссоры
uk: Примиритися після сварки

source: To postpone
ru: Отложить
uk: Відкладати

source: To use up all of something and have no more left
ru: Израсходовать что-либо полностью, не иметь больше
uk: Витратити все і нічого не залишити

source: To remove clothing
ru: Снять одежду
uk: Знімати одяг

source: (For an aircraft) to leave the ground
ru: (О самолете) оторваться от земли
uk: (Про літак) злітати

source: To reduce the volume or intensity
ru: Уменьшить громкость или интенсивность
uk: Зменшити гучність або інтенсивність

source: To reject an offer or request
ru: Отклонить предложение или просьбу
uk: Відхилити пропозицію або запит

source: To increase the volume or intensity
ru: Увеличить громкость или интенсивность
uk: Збільшити гучність або інтенсивність

source: To arrive or appear unexpectedly
ru: Прибыть или появиться неожиданно
uk: Несподівано прибути або з'явитися

source: Phrasal verbs can be categorized based on their grammatical structure and whether they can take an object, and if so, whether the object can be separated from the verb and particle(s).
ru: Фразовые глаголы можно классифицировать на основе их грамматической структуры и того, могут ли они иметь **объект**, и если да, может ли этот объект быть **отделен** от глагола и частицы(частиц).
uk: Фразові дієслова можна класифікувати на основі їхньої граматичної структури та того, чи можуть вони мати об'єкт, і якщо так, чи може цей об'єкт бути відокремлений від дієслова та частки(часток).

source: Transitive vs. Intransitive:
ru: Переходные vs. Непереходные:
uk: Перехідні проти Неперехідних:

source: Transitive:
ru: Переходные:
uk: Перехідні:

source: Take a direct object (e.g.,
ru: Имеют прямое дополнение (например,
uk: Мають прямий об'єкт (наприклад,

source: Intransitive:
ru: Непереходные:
uk: Неперехідні:

source: Do not take a direct object (e.g.,
ru: Не имеют прямого дополнения (например,
uk: Не мають прямого об'єкта (наприклад,

source: Separable vs. Inseparable:
ru: Разделяемые vs. Неразделяемые:
uk: Відокремлювані проти Невідокремлюваних:

source: Separable:
ru: Разделяемые:
uk: Відокремлювані:

source: The object can come between the verb and the particle, especially if the object is a pronoun (e.g.,
ru: Дополнение может стоять между глаголом и частицей, особенно если дополнение является местоимением (например,
uk: Об'єкт може стояти між дієсловом та часткою, особливо якщо об'єкт є займенником (наприклад,

source: Inseparable:
ru: Неразделяемые:
uk: Невідокремлювані:

source: The object must come after the particle (e.g.,
ru: Дополнение должно стоять после частицы (например,
uk: Об'єкт повинен стояти після частки (наприклад,

source: not
ru: не
uk: не

source: Learning phrasal verbs often involves memorizing not just their meaning but also their grammatical behavior (whether they are transitive/intransitive and separable/inseparable).
ru: Изучение фразовых глаголов часто включает запоминание не только их значения, но и их грамматического поведения (являются ли они переходными/непереходными и разделяемыми/неразделяемыми).
uk: Вивчення фразових дієслів часто вимагає запам'ятовування не лише їхнього значення, але й їхньої граматичної поведінки (чи є вони перехідними/неперехідними та відокремлюваними/невідокремлюваними).

source: Table of Phrasal Verbs
ru: Таблица фразовых глаголов
uk: Таблиця Фразових Дієслів

source: Here's a more extensive list of phrasal verbs to help you expand your vocabulary. Remember that many phrasal verbs have multiple meanings depending on the context.
ru: Вот более обширный список фразовых глаголов, который поможет вам расширить словарный запас. Помните, что многие фразовые глаголы имеют несколько значений в зависимости от контекста.
uk: Ось більш розширений список фразових дієслів, щоб допомогти вам розширити свій словниковий запас. Пам'ятайте, що багато фразових дієслів мають кілька значень залежно від контексту.

source: To take action according to advice or information
ru: Действовать в соответствии с советом или информацией
uk: Діяти відповідно до поради чи інформації

source: To make sense; to seem reasonable
ru: Иметь смысл; казаться разумным
uk: Мати сенс; здаватися розумним

source: To ask many different people in order to get information or help
ru: Спрашивать у многих разных людей, чтобы получить информацию или помощь
uk: Запитувати багатьох різних людей, щоб отримати інформацію або допомогу

source: To support (someone)
ru: Поддерживать (кого-либо)
uk: Підтримувати (когось)

source: To make a copy of computer data
ru: Сделать копию компьютерных данных
uk: Створювати резервну копію комп'ютерних даних

source: To explode
ru: Взорваться
uk: Вибухати

source: To inflate something (e.g., a balloon)
ru: Надуть что-либо (например, воздушный шар)
uk: Надувати щось (наприклад, повітряну кульку)

source: To enter a building illegally, usually by force
ru: Незаконно проникнуть в здание, обычно силой
uk: Незаконно проникати у будівлю, зазвичай силою

source: To escape (from prison)
ru: Сбежать (из тюрьмы)
uk: Втікати (з в'язниці)

source: To start suddenly (e.g., a war, a fire)
ru: Начаться внезапно (например, война, пожар)
uk: Початися раптово (наприклад, війна, пожежа)

source: To understand (informal)
ru: Понять (неформально)
uk: Розуміти (неформально)

source: To become popular
ru: Стать популярным
uk: Ставати популярним

source: To investigate; to examine
ru: Расследовать; изучать
uk: Розслідувати; перевіряти

source: To leave a hotel
ru: Выписаться из отеля
uk: Виїжджати з готелю

source: To make something tidy or clean
ru: Навести порядок или чистоту
uk: Приводити щось до ладу або чистити

source: To think of an idea or a plan
ru: Придумать идею или план
uk: Придумати ідею або план

source: To disconnect (a phone call, electricity)
ru: Разорвать соединение (телефонный звонок, электричество)
uk: Роз'єднати (телефонний дзвінок, електрику)

source: To separate or isolate
ru: Разделить или изолировать
uk: Розділяти або ізолювати

source: To handle; to manage
ru: Справляться; управлять
uk: Справлятися; керувати

source: To manage or survive without something
ru: Обойтись или выжить без чего-либо
uk: Справлятися або виживати без чогось

source: To take someone/something to a place and leave them there
ru: Отвезти кого-либо/что-либо в место и оставить там
uk: Підвезти когось/щось до місця і залишити там

source: To eat in a restaurant, not at home
ru: Поесть в ресторане, не дома
uk: Їсти в ресторані, не вдома
