Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: 1. Joining Independent Clauses
ru: 1. Соединение независимых клауз
uk: 1. З'єднання незалежних речень

source: When connecting two complete sentences (independent clauses), use a comma before the conjunction:
ru: При соединении двух полных предложений (независимых клауз) используйте запятую перед союзом:
uk: При з'єднанні двох повних речень (незалежних речень) використовуйте кому перед сполучником:

source: Exception:
ru: Исключение:
uk: Виняток:

source: When the clauses are very short, the comma may be omitted:
ru: Если клаузы очень короткие, запятая может быть опущена:
uk: Коли речення дуже короткі, кому можна опустити:

source: 2. Joining Words or Phrases
ru: 2. Соединение слов или фраз
uk: 2. З'єднання слів або фраз

source: No comma is needed when connecting words or short phrases:
ru: Запятая не нужна при соединении слов или коротких фраз:
uk: Кома не потрібна при з'єднанні слів або коротких фраз:

source: 3. Serial Commas (Oxford Comma)
ru: 3. Разделяющие запятые (Оксфордская запятая)
uk: 3. Перелікові коми (Оксфордська кома)

source: When listing three or more items, use commas between them, with a conjunction before the last item:
ru: При перечислении трех и более элементов используйте запятые между ними, а также союз перед последним элементом:
uk: При переліку трьох або більше елементів використовуйте коми між ними, зі сполучником перед останнім елементом:

source: Special Cases and Common Mistakes
ru: Особые случаи и распространенные ошибки
uk: Особливі випадки та поширені помилки

source: 1. Starting Sentences with Coordinating Conjunctions
ru: 1. Начало предложений с сочинительных союзов
uk: 1. Початок речень із сурядних сполучників

source: While traditionally discouraged, starting sentences with coordinating conjunctions can be effective for emphasis in informal writing:
ru: Хотя традиционно это не поощряется, начало предложений с сочинительных союзов может быть эффективным для выделения в неформальном письме:
uk: Хоча традиційно це не заохочується, початок речень із сурядних сполучників може бути ефективним для наголошення в неформальному письмі:

source: Avoid overusing this in formal writing.
ru: Избегайте чрезмерного использования этого приема в формальном письме.
uk: Уникайте надмірного використання цього у формальному письмі.

source: 2. 'Nor' with Inverted Word Order
ru: 2. 'Nor' с обратным порядком слов
uk: 2. 'Nor' з інвертованим порядком слів

source: After 'nor', the auxiliary verb comes before the subject:
ru: После 'nor' (и не) вспомогательный глагол ставится перед подлежащим:
uk: Після 'nor' допоміжне дієслово стоїть перед підметом:

source: 3. 'For' vs. 'Because'
ru: 3. 'For' против 'Because'
uk: 3. 'For' проти 'Because'

source: 'For' as a conjunction is more formal and less common than 'because'. It typically appears between the clauses it connects:
ru: 'For' как союз является более формальным и менее распространенным, чем 'because'. Он обычно появляется между частями, которые соединяет:
uk: 'For' як сполучник є більш формальним і менш поширеним, ніж 'because'. Він зазвичай з'являється між реченнями, які він з'єднує:

source: 1. Fill in the Blank
ru: 1. Заполните пропуск
uk: 1. Заповніть пропуск

source: Choose the correct FANBOYS conjunction:
ru: Выберите правильный сочинительный союз (FANBOYS):
uk: Оберіть правильний сполучник FANBOYS:

source: I wanted to go swimming, ___ the pool was closed.
ru: Я хотел пойти поплавать, ___ бассейн был закрыт.
uk: Я хотів піти плавати, ___ басейн був зачинений.

source: She doesn't like coffee ___ tea.
ru: Она не любит кофе ___ чай.
uk: Вона не любить каву ___ чай.

source: He studied hard, ___ he passed the exam.
ru: Он усердно учился, ___ сдал экзамен.
uk: Він старанно вчився, ___ він склав іспит.

source: Fix the punctuation in these sentences:
ru: Исправьте пунктуацию в этих предложениях:
uk: Виправте пунктуацію в цих реченнях:

source: I like apples and I like oranges.
ru: Я люблю яблоки и я люблю апельсины.
uk: Мені подобаються яблука і мені подобаються апельсини.

source: She was tired, so she went to bed early.
ru: Она устала, поэтому рано легла спать.
uk: Вона була стомлена, тому рано лягла спати.

source: We can go now or we can wait until later.
ru: Мы можем пойти сейчас или можем подождать до позже.
uk: Ми можемо піти зараз або можемо почекати до пізніше.

source: Correlative Conjunctions: The Paired Connectors
ru: Соотносительные союзы: Парные соединители
uk: Співвідносні сполучники: Парні з'єднувачі

source: Correlative Conjunctions
ru: Соотносительные союзы
uk: Співвідносні сполучники

source: Correlative Conjunctions: The Power of Pairs
ru: Соотносительные союзы: Сила пар
uk: Співвідносні сполучники: Сила пар

source: Correlative conjunctions are powerful grammatical tools that work in pairs to connect equivalent elements in a sentence, creating balanced and parallel structures that enhance clarity and rhythm.
ru: Соотносительные союзы — это мощные грамматические инструменты, которые работают в парах для соединения эквивалентных элементов в предложении, создавая сбалансированные и параллельные структуры, улучшающие ясность и ритм.
uk: Співвідносні сполучники – це потужні граматичні інструменти, які працюють у парі для з'єднання еквівалентних елементів у реченні, створюючи збалансовані та паралельні структури, що підвищують чіткість та ритм.

source: Essential Correlative Conjunction Pairs
ru: Основные пары соотносительных союзов
uk: Основні пари співвідносних сполучників

source: Pair
ru: Пара
uk: Пара

source: Connects two positive alternatives
ru: Соединяет две положительные альтернативы
uk: З'єднує дві позитивні альтернативи

source: Presents two alternatives (positive)
ru: Представляет две альтернативы (положительные)
uk: Представляє дві альтернативи (позитивні)

source: Presents two negative alternatives
ru: Представляет две отрицательные альтернативы
uk: Представляє дві негативні альтернативи

source: Emphasizes two qualities/actions
ru: Подчеркивает два качества/действия
uk: Наголошує на двох якостях/діях

source: Indicates alternatives in a choice
ru: Указывает альтернативы при выборе
uk: Вказує на альтернативи у виборі

source: Makes comparisons between equals
ru: Проводит сравнения между равными
uk: Проводить порівняння між рівними

source: The Golden Rule: Parallel Structure
ru: Золотое правило: Параллельная структура
uk: Золоте правило: Паралельна структура

source: Elements connected by correlative conjunctions must be <span class=\
ru: Элементы, соединенные соотносительными союзами, должны быть <span class=\
uk: Елементи, з'єднані співвідносними сполучниками, повинні бути <span class=\

source: Noun + Noun, Verb + Verb, Adjective + Adjective, etc.
ru: Существительное + Существительное, Глагол + Глагол, Прилагательное + Прилагательное и т.д.
uk: Іменник + Іменник, Дієслово + Дієслово, Прикметник + Прикметник тощо.

source: Examples of Parallel Structure
ru: Примеры параллельной структуры
uk: Приклади паралельної структури

source: Correct (Parallel)
ru: Правильно (Параллельно)
uk: Правильно (Паралельно)

source: Incorrect (Non-Parallel)
ru: Неправильно (Непараллельно)
uk: Неправильно (Непаралельно)

source: Pro Tip:
ru: Профессиональный совет:
uk: Професійна порада:

source: When using 'not only...but also', the element after 'not only' determines what should follow 'but also'. Keep them in the same grammatical form.
ru: При использовании 'not only...but also' (не только... но и) элемент после 'not only' определяет, что должно следовать за 'but also'. Сохраняйте их в одной и той же грамматической форме.
uk: При використанні 'not only...but also' (не тільки...але й) елемент після 'not only' визначає, що має слідувати за 'but also'. Зберігайте їх в одній і тій самій граматичній формі.

source: Special Grammar Rules
ru: Особые правила грамматики
uk: Спеціальні граматичні правила

source: 1. Subject-Verb Agreement
ru: 1. Согласование подлежащего и сказуемого
uk: 1. Узгодження підмета та присудка

source: With 'either...or' and 'neither...nor', the verb agrees with the subject closer to it:
ru: С 'either...or' (либо... либо) и 'neither...nor' (ни... ни) глагол согласуется с подлежащим, которое находится ближе к нему:
uk: У конструкціях 'either...or' (або...або) та 'neither...nor' (ні...ні) дієслово узгоджується з підметом, що стоїть ближче до нього:

source: 2. Positioning for Clarity
ru: 2. Расположение для ясности
uk: 2. Розташування для чіткості

source: Place correlative conjunctions immediately before the words/phrases being connected:
ru: Располагайте соотносительные союзы непосредственно перед соединяемыми словами/фразами:
uk: Розташовуйте співвідносні сполучники безпосередньо перед словами/фразами, які вони з'єднують:

source: 3. Avoiding Double Negatives
ru: 3. Избегание двойных отрицаний
uk: 3. Уникнення подвійних заперечень

source: With 'neither...nor', don't use other negative words:
ru: С 'neither...nor' не используйте другие отрицательные слова:
uk: З 'neither...nor' (ні...ні) не використовуйте інші заперечні слова:

source: 1. Complete the Sentences
ru: 1. Дополните предложения
uk: 1. Доповніть речення

source: Fill in the blanks with the correct correlative conjunctions:
ru: Заполните пропуски правильными соотносительными союзами:
uk: Заповніть пропуски правильними співвідносними сполучниками:

source: ___ my parents ___ my grandparents could attend the wedding.
ru: ___ мои родители, ___ мои бабушка и дедушка смогли посетить свадьбу.
uk: ___ мої батьки ___ мої дідусь і бабуся не змогли бути на весіллі.

source: You can ___ stay here ___ come with us.
ru: Вы можете ___ остаться здесь, ___ пойти с нами.
uk: Ти можеш ___ залишитися тут ___ піти з нами.

source: She is ___ intelligent ___ hardworking.
ru: Она ___ умна, ___ трудолюбива.
uk: Вона ___ розумна ___ працьовита.

source: Fix the parallel structure errors:
ru: Исправьте ошибки параллельной структуры:
uk: Виправте помилки паралельної структури:

source: He not only enjoys swimming but also to hike.
ru: Он не только любит плавать, но и ходить в походы.
uk: Він не тільки любить плавати, але й ходити в похід.

source: Both my sister and going to the park are fun.
ru: И моя сестра, и поход в парк доставляют удовольствие.
uk: І моя сестра, і похід у парк – це весело.

source: I neither have the time nor the patience for this.
ru: У меня нет ни времени, ни терпения для этого.
uk: У мене немає ні часу, ні терпіння для цього.

source: Conjunctions: Definition, Types and Usage
ru: Союзы: Определение, типы и использование
uk: Сполучники: Визначення, типи та використання

source: Definition and Types
ru: Определение и типы
uk: Визначення та типи

source: Conjunctions: The Connectors of English
ru: Союзы: Соединители английского языка
uk: Сполучники: З'єднувачі англійської мови

source: Conjunctions are the <span class=\
ru: Союзы — это <span class=\
uk: Сполучники – це <span class=\

source: Definition and Core Functions
ru: Определение и основные функции
uk: Визначення та основні функції

source: 1. Joining Words
ru: 1. Соединение слов
uk: 1. З'єднання слів

source: Connects two or more words of the same type (nouns, verbs, adjectives, etc.)
ru: Соединяет два или более слов одного типа (существительные, глаголы, прилагательные и т.д.)
uk: З'єднує два або більше слів одного типу (іменники, дієслова, прикметники тощо)

source: 2. Joining Phrases
ru: 2. Соединение фраз
uk: 2. З'єднання фраз

source: Links prepositional phrases, verb phrases, etc.
ru: Связывает предложные фразы, глагольные фразы и т.д.
uk: З'єднує прийменникові фрази, дієслівні фрази тощо.

source: 3. Joining Clauses
ru: 3. Соединение частей предложения (клауз)
uk: 3. З'єднання речень

source: Connects independent and/or dependent clauses
ru: Соединяет независимые и/или зависимые клаузы
uk: З'єднує незалежні та/або залежні речення

source: Types of Conjunctions
ru: Типы союзов
uk: Типи сполучників

source: 1. Coordinating Conjunctions (FANBOYS)
ru: 1. Сочинительные союзы (FANBOYS)
uk: 1. Сурядні сполучники (FANBOYS)

source: Join elements of equal grammatical rank (words with words, phrases with phrases, etc.)
ru: Соединяют элементы равного грамматического ранга (слова со словами, фразы с фразами и т.д.)
uk: З'єднують елементи однакового граматичного рангу (слова зі словами, фрази з фразами тощо)

source: The 7 coordinating conjunctions:
ru: 7 сочинительных союзов:
uk: 7 сурядних сполучників:

source: Usage Rules:
ru: Правила использования:
uk: Правила використання:

source: Use a comma before the conjunction when joining two independent clauses
ru: Используйте запятую перед союзом при соединении двух независимых клауз
uk: Використовуйте кому перед сполучником, коли з'єднуєте два незалежні речення

source: No comma needed when joining words or short phrases
ru: Запятая не нужна при соединении слов или коротких фраз
uk: Кома не потрібна при з'єднанні слів або коротких фраз

source: 2. Subordinating Conjunctions
ru: 2. Подчинительные союзы
uk: 2. Підрядні сполучники

source: Introduce dependent clauses and show their relationship to the main clause
ru: Вводят зависимые клаузы и показывают их отношение к главной клаузе
uk: Вводять залежні речення та показують їхній зв'язок з головним реченням

source: Common Subordinating Conjunctions:
ru: Распространенные подчинительные союзы:
uk: Поширені підрядні сполучники:

source: Key Functions:
ru: Ключевые функции:
uk: Ключові функції:

source: 3. Correlative Conjunctions
ru: 3. Соотносительные союзы
uk: 3. Співвідносні сполучники

source: Pairs of conjunctions that work together to join elements
ru: Пары союзов, которые работают вместе для соединения элементов
uk: Пари сполучників, які працюють разом для з'єднання елементів

source: Common Correlative Pairs:
ru: Распространенные соотносительные пары:
uk: Поширені співвідносні пари:

source: Important Rules:
ru: Важные правила:
uk: Важливі правила:

source: Maintain parallel structure between the connected elements
ru: Сохраняйте параллельную структуру между соединяемыми элементами
uk: Дотримуйтесь паралельної структури між з'єднаними елементами

source: Subject-verb agreement follows the second element in 'or/nor' pairs
ru: Согласование подлежащего и сказуемого происходит по второму элементу в парах 'or/nor'
uk: Узгодження підмета та присудка слідує за другим елементом у парах 'or/nor'

source: Place the correlative conjunctions immediately before the elements being connected
ru: Располагайте соотносительные союзы непосредственно перед соединяемыми элементами
uk: Розташовуйте співвідносні сполучники безпосередньо перед елементами, що з'єднуються

source: Common Errors and How to Avoid Them
ru: Распространенные ошибки и как их избежать
uk: Поширені помилки та як їх уникнути

source: 1. Comma Splices
ru: 1. Слияние запятой (Comma Splices)
uk: 1. Розділення комами (Comma Splices)

source: Using a comma alone to join two independent clauses (a comma splice)
ru: Использование только запятой для соединения двух независимых клауз (ошибка 'слияние запятой')
uk: Використання лише коми для з'єднання двох незалежних речень (розділення комою)

source: 2. Misplaced Correlatives
ru: 2. Неправильно расположенные соотносительные союзы
uk: 2. Неправильно розташовані співвідносні сполучники

source: Breaking the parallel structure in correlative conjunctions
ru: Нарушение параллельной структуры в соотносительных союзах
uk: Порушення паралельної структури у співвідносних сполучниках

source: 3. Overusing 'And'
ru: 3. Чрезмерное использование 'And' (и)
uk: 3. Надмірне використання 'And' (і)

source: Stringing together too many ideas with 'and'
ru: Связывание слишком большого количества идей с помощью 'and'
uk: З'єднання занадто багатьох ідей за допомогою 'and'

source: Analyze sentences in books/articles - identify conjunction types
ru: Анализируйте предложения в книгах/статьях — определяйте типы союзов
uk: Аналізуйте речення в книгах/статтях - ідентифікуйте типи сполучників

source: Practice rewriting simple sentences into complex ones using conjunctions
ru: Попрактикуйтесь в переписывании простых предложений в сложные с использованием союзов
uk: Практикуйте переписування простих речень у складні за допомогою сполучників

source: Create flashcards for different conjunction types and their functions
ru: Создайте карточки для разных типов союзов и их функций
uk: Створіть картки для різних типів сполучників та їхніх функцій

source: Pay special attention to punctuation rules with different conjunctions
ru: Обращайте особое внимание на правила пунктуации с разными союзами
uk: Звертайте особливу увагу на правила пунктуації з різними сполучниками

source: Conjunctions vs. Prepositions vs. Adverbs
ru: Союзы против предлогов против наречий
uk: Сполучники проти Прийменників проти Прислівників

source: Understanding the differences between these word types is crucial for proper sentence construction. Many words can function as different parts of speech depending on context.
ru: Понимание различий между этими типами слов имеет решающее значение для правильного построения предложения. Многие слова могут выполнять функции разных частей речи в зависимости от контекста.
uk: Розуміння відмінностей між цими типами слів є вирішальним для правильної побудови речень. Багато слів можуть функціонувати як різні частини мови залежно від контексту.

source: Join words, phrases, or clauses of equal importance
ru: Соединяют слова, фразы или клаузы равной важности
uk: З'єднують слова, фрази або речення однакової важливості

source: Coordinating conjunctions (FANBOYS) connect independent clauses
uk: Сурядні сполучники (FANBOYS) з'єднують незалежні речення

source: Subordinating conjunctions introduce dependent clauses
uk: Підрядні сполучники вводять залежні речення

source: Correlative conjunctions work in pairs (both...and, either...or)
uk: Співвідносні сполучники працюють у парах (both...and, either...or)

source: Prepositions
uk: Прийменники

source: Show relationship between a noun/pronoun and other words
uk: Показують зв'язок між іменником/займенником та іншими словами

source: Always followed by a noun or pronoun (the object of the preposition)
uk: Завжди слідує іменник або займенник (додаток прийменника)

source: Form prepositional phrases that function as adjectives or adverbs
uk: Утворюють прийменникові фрази, які функціонують як прикметники або прислівники

source: Cannot connect clauses or sentences
uk: Не можуть з'єднувати речення або частини речень

source: Common Prepositions:
uk: Поширені прийменники:

source: Modify verbs, adjectives, or other adverbs
uk: Модифікують дієслова, прикметники або інші прислівники

source: Answer questions like how, when, where, why, or to what extent
uk: Відповідають на запитання, як-от: як, коли, де, чому або якою мірою

source: Often end in -ly (but not always)
uk: Часто закінчуються на -ly (але не завжди)

source: Can appear in various positions in a sentence
uk: Можуть з'являтися в різних позиціях у реченні

source: Words That Can Be Both
uk: Слова, які можуть бути і тим, і іншим

source: What follows
uk: Що слідує

source: Subordinating Conjunctions: The Complete Guide
uk: Підрядні сполучники: Повний посібник

source: Subordinating Conjunctions
uk: Підрядні сполучники

source: Subordinating conjunctions are essential for creating complex sentences by connecting dependent clauses to independent clauses. They establish relationships of time, cause, condition, contrast, and more between ideas.
uk: Підрядні сполучники необхідні для створення складних речень шляхом з'єднання залежних речень з незалежними. Вони встановлюють зв'язки часу, причини, умови, контрасту та інше між ідеями.

source: Always introduce a dependent (subordinate) clause
uk: Завжди вводять залежне (підрядне) речення

source: Show the relationship between the dependent and independent clause
uk: Показують зв'язок між залежним та незалежним реченням

source: Cannot stand alone - the dependent clause is not a complete sentence
uk: Не можуть існувати самостійно - залежне речення не є повним реченням

source: Can appear at the beginning or middle of a sentence
uk: Можуть з'являтися на початку або в середині речення

source: Common Conjunctions
uk: Поширені сполучники

source: Cause/Reason
uk: Причина/Підстава

source: Sentence Structure and Punctuation
uk: Структура речення та пунктуація

source: 1. Dependent Clause First
uk: 1. Залежне речення спочатку

source: When the dependent clause comes before the independent clause, use a comma after it:
uk: Коли залежне речення стоїть перед незалежним реченням, використовуйте кому після нього:

source: 2. Independent Clause First
uk: 2. Незалежне речення спочатку

source: When the independent clause comes first, no comma is needed:
uk: Коли незалежне речення стоїть першим, кома не потрібна:

source: When the dependent clause shows strong contrast (using 'although', 'though', 'even though'), a comma may be used even when it appears second for emphasis:
uk: Коли залежне речення показує сильний контраст (використовуючи 'although', 'though', 'even though'), кома може використовуватися навіть тоді, коли воно стоїть другим, для підкреслення:

source: Special Cases and Common Errors
uk: Особливі випадки та поширені помилки

source: 1. 'That' as a Subordinating Conjunction
uk: 1. 'That' як підрядний сполучник

source: The word 'that' often functions as a subordinating conjunction introducing noun clauses:
uk: Слово **'that'** (що) часто функціонує як підрядний сполучник, що вводить іменникові речення:

source: In many cases, 'that' can be omitted in informal English:
uk: У багатьох випадках **'that'** може бути опущено в неформальній англійській мові:

source: 2. 'While' for Time vs. Contrast
uk: 2. 'While' (поки/тоді як) для часу vs. контрасту

source: 'While' can indicate either time or contrast - the meaning depends on context:
uk: 'While' може вказувати або на **час**, або на **контраст** – значення залежить від контексту:

source: 3. 'Since' for Time vs. Reason
uk: 3. 'Since' (з тих пір як/оскільки) для часу vs. причини

source: Similarly, 'since' can indicate either time or cause:
uk: Так само, 'since' може вказувати або на **час**, або на **причину**:

source: 1. Identify the Function
uk: 1. Визначте функцію

source: What relationship does each subordinating conjunction show?
uk: Який зв'язок показує кожен підрядний сполучник?

source: We'll start the meeting <span class=\
uk: Ми розпочнемо зустріч <span class=\

source: 2. Correct the Punctuation
uk: 2. Виправте пунктуацію

source: Add commas where needed:
uk: Додайте коми там, де це необхідно:

source: After we finish our work we'll go to the park.
uk: Після того, як ми закінчимо роботу ми підемо до парку.

source: She can't come to the party because she's sick.
uk: Вона не може прийти на вечірку тому що хвора.

source: Whereas I prefer tea my brother drinks only coffee.
uk: Тоді як я віддаю перевагу чаю мій брат п'є тільки каву.

source: Conjunctions: Types and Functions
uk: Сполучники: Типи та функції

source: Types and Functions
uk: Типи та функції

source: Comprehensive Guide to Conjunction Types
ru: Полное руководство по типам союзов
uk: Вичерпний посібник з типів сполучників

source: Understanding the different types of conjunctions is essential for constructing clear, complex sentences in English. Each type serves specific grammatical functions and follows distinct rules.
ru: Понимание различных типов союзов необходимо для построения ясных, сложных предложений в английском языке. Каждый тип выполняет определенные грамматические функции и следует определенным правилам.
uk: Розуміння різних типів сполучників є важливим для побудови чітких, складних речень в англійській мові. Кожен тип виконує певні граматичні функції та дотримується чітких правил.
