Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: A common point of confusion is when to use a gerund versus an infinitive. The choice often depends on the preceding verb or expression. Some verbs can be followed by both with a change in meaning, while others allow both without a significant change.
ru: Часто возникает путаница, когда использовать герундий, а когда инфинитив. Выбор часто зависит от предшествующего глагола или выражения. За некоторыми глаголами могут следовать обе формы с изменением значения, в то время как другие допускают обе формы без существенного изменения.
uk: Поширеним моментом плутанини є те, коли використовувати герундій, а коли інфінітив. Вибір часто залежить від попереднього дієслова чи виразу. Деякі дієслова можуть супроводжуватися обома формами зі зміною значення, тоді як інші дозволяють обидві без значної зміни.

source: Verbs followed by Gerund or Infinitive with different meanings:
ru: Глаголы, за которыми следует герундий или инфинитив с разными значениями:
uk: Дієслова, після яких іде Герундій або Інфінітив із різними значеннями:

source: He quit the habit
ru: Он бросил привычку
uk: Він кинув цю звичку

source: He paused to have a cigarette
ru: Он остановился, чтобы выкурить сигарету
uk: Він зупинився, щоб викурити сигарету

source: Recalling a past event
ru: Вспоминая прошлое событие
uk: Згадування минулої події

source: Don't forget to do it
ru: Не забудь это сделать
uk: Не забудь це зробити

source: Verbs followed by Gerund or Infinitive with similar meanings:
ru: Глаголы, за которыми следует герундий или инфинитив с похожими значениями:
uk: Дієслова, після яких іде Герундій або Інфінітив із схожими значеннями:

source: Mastering the gerund is crucial for accurate and natural-sounding English, especially when dealing with complex sentence structures and verb patterns.
ru: Мастерство использования герундия имеет решающее значение для правильного и естественно звучащего английского языка, особенно при работе со сложными конструкциями предложений и глагольными моделями.
uk: Опанування герундію є вирішальним для точної та природної англійської мови, особливо при роботі зі складними структурами речень та моделями дієслів.

source: The Imperative Mood
ru: Повелительное наклонение (The Imperative Mood)
uk: Наказовий спосіб (The Imperative Mood)

source: The **Imperative Mood** is used to give **commands, instructions, requests, advice, or express prohibitions**. It's the mood you use when you want someone to *do* something.
uk: **Наказовий спосіб** використовується для надання **наказів, інструкцій, прохань, порад або вираження заборон**. Це спосіб, який ви використовуєте, коли хочете, щоб хтось щось *зробив*.

source: Forms of the Imperative Mood
ru: Формы повелительного наклонения
uk: Форми Наказового способу

source: 1. Affirmative Imperatives (Commands/Requests)
ru: 1. Утвердительное повелительное наклонение (Команды/Просьбы)
uk: 1. Стверджувальні наказові речення (Накази/Прохання)

source: To form an affirmative imperative, simply use the <span class=\
ru: Чтобы образовать утвердительное повелительное наклонение, просто используйте <span class=\
uk: Щоб утворити стверджувальне наказове речення, просто використовуйте <span class=\

source: Verb \
ru: Глагол \
uk: Дієслово \

source: For the verb \
ru: Для глагола \
uk: Для дієслова \

source: 2. Negative Imperatives (Prohibitions)
ru: 2. Отрицательное повелительное наклонение (Запреты)
uk: 2. Заперечні наказові речення (Заборони)

source: To make an imperative negative, place
ru: Чтобы сделать повелительное наклонение отрицательным, поставьте
uk: Щоб зробити наказове речення заперечним, поставте

source: or its common contraction
ru: или его общепринятое сокращение
uk: або його поширене скорочення

source: before the base form of the verb.
ru: перед базовой формой глагола.
uk: перед базовою формою дієслова.

source: 3. Imperatives with \
ru: 3. Повелительное наклонение с \
uk: 3. Наказові речення з \

source: To make a suggestion that includes yourself (the speaker) and others, use
ru: Чтобы внести предложение, которое включает вас (говорящего) и других, используйте
uk: Щоб зробити пропозицію, яка включає вас (мовця) та інших, використовуйте

source: a contraction of \
ru: сокращение от \
uk: скорочення від \

source: followed by the base form of the verb. For a negative suggestion, use \
ru: за которым следует базовая форма глагола. Для отрицательного предложения используйте \
uk: за яким слідує базова форма дієслова. Для заперечної пропозиції використовуйте \

source: Positive suggestion
ru: Положительное предложение
uk: Стверджувальна пропозиція

source: Negative suggestion
ru: Отрицательное предложение
uk: Заперечна пропозиція

source: 4. Emphasized Imperatives (with Explicit Subject)
ru: 4. Выделенное повелительное наклонение (с явным подлежащим)
uk: 4. Наказові речення з наголосом (з явним підметом)

source: Although rare, the subject
ru: Хотя это редкость, подлежащее
uk: Хоча це рідко, підмет

source: can be included in an imperative for emphasis, contrast, or to direct the command to a specific person in a group. This is often used in more formal or frustrated tones.
ru: может быть включено в повелительное наклонение для усиления, контраста или для направления команды конкретному лицу в группе. Это часто используется в более формальном или раздраженном тоне.
uk: може бути включений у наказове речення для наголосу, контрасту або для спрямування наказу до конкретної особи в групі. Це часто використовується в більш формальному або роздратованому тоні.

source: Strong command, possibly out of exasperation
ru: Сильная команда, возможно, от раздражения
uk: Сильний наказ, можливо, від роздратування

source: When the bell rings,
ru: Когда прозвенит звонок,
uk: Коли дзвонить дзвінок,

source: to the principal's office.
ru: в кабинет директора.
uk: до кабінету директора.

source: Punctuation for Imperatives
ru: Пунктуация для повелительного наклонения
uk: Пунктуація для Наказових речень

source: Imperative sentences typically end with a <span class=\
ru: Повелительные предложения обычно заканчиваются <span class=\
uk: Наказові речення зазвичай закінчуються <span class=\

source: Mild request
ru: Мягкая просьба
uk: М'яке прохання

source: Strong command
ru: Сильная команда
uk: Сильний наказ

source: Urgent command
ru: Срочная команда
uk: Терміновий наказ

source: Use of the Imperative Mood
ru: Использование повелительного наклонения
uk: Використання Наказового способу

source: 1. Giving Commands or Orders
ru: 1. Отдача команд или приказов
uk: 1. Надання Наказів або Розпоряджень

source: This is the most direct and common use of the imperative, conveying a forceful instruction.
ru: Это наиболее прямое и распространенное использование повелительного наклонения, передающее решительное указание.
uk: Це найбільш пряме та поширене використання наказового способу, що передає рішучу інструкцію.

source: 2. Providing Instructions or Directions
ru: 2. Предоставление инструкций или указаний
uk: 2. Надання Інструкцій або Вказівок

source: Imperatives are frequently used when guiding someone through a process or telling them how to get somewhere.
ru: Повелительное наклонение часто используется, когда направляют кого-либо через процесс или говорят, как куда-то добраться.
uk: Наказовий спосіб часто використовується, коли направляють когось через процес або пояснюють, як кудись дістатися.

source: 3. Making Requests (often with \
ru: 3. Выражение просьб (часто с \
uk: 3. Висловлення Прохань (часто з \

source: While commands are direct, adding \
ru: В то время как команды прямые, добавление \
uk: Хоча накази є прямими, додавання \

source: Here, \
ru: Здесь, \
uk: Тут, \

source: 4. Offering Advice or Suggestions
ru: 4. Предложение советов или рекомендаций
uk: 4. Надання Порад або Пропозицій

source: Imperatives can be used to give strong recommendations or gentle advice.
ru: Повелительное наклонение может использоваться для выражения сильных рекомендаций или мягкого совета.
uk: Наказовий спосіб можна використовувати для надання рішучих рекомендацій або м'яких порад.

source: 5. Expressing Prohibitions
ru: 5. Выражение запретов
uk: 5. Вираження Заборон

source: Using negative imperative forms (e.g., \
ru: Использование отрицательных форм повелительного наклонения (напр., \
uk: Використання заперечних наказових форм (наприклад, \

source: 6. Extending Invitations or Making Offers
ru: 6. Выражение приглашений или предложений
uk: 6. Надання Запрошень або Здійснення Пропозицій

source: Imperatives are often used to welcome someone or offer something.
ru: Повелительное наклонение часто используется для приветствия или предложения чего-либо.
uk: Наказовий спосіб часто використовується, щоб вітати когось або щось пропонувати.

source: The Indicative Mood
ru: Изъявительное наклонение (The Indicative Mood)
uk: Дійсний спосіб (The Indicative Mood)

source: Forms of the Indicative Mood
ru: Формы изъявительного наклонения
uk: Форми Дійсного способу

source: 1. Present Tenses
ru: 1. Настоящие времена
uk: 1. Теперішні часи

source: Used for current facts, habits, ongoing actions, or scheduled future events.
ru: Используется для текущих фактов, привычек, продолжающихся действий или запланированных будущих событий.
uk: Використовується для поточних фактів, звичок, тривалих дій або запланованих майбутніх подій.

source: Present Simple:
ru: Present Simple (Простое настоящее):
uk: Present Simple (Теперішній простий):

source: For habitual actions, general truths, or scheduled events.
ru: Для привычных действий, общих истин или запланированных событий.
uk: Для звичних дій, загальних істин або запланованих подій.

source: General truth
ru: Общая истина
uk: Загальна істина

source: Habit/Fact
ru: Привычка/Факт
uk: Звичка/Факт

source: Scheduled future event
ru: Запланированное будущее событие
uk: Запланована майбутня подія

source: Present Continuous:
ru: Present Continuous (Настоящее длительное):
uk: Present Continuous (Теперішній тривалий):

source: For actions happening now, temporary situations, or definite future plans.
ru: Для действий, происходящих сейчас, временных ситуаций или определенных планов на будущее.
uk: Для дій, що відбуваються зараз, тимчасових ситуацій або чітких майбутніх планів.

source: Action happening now
ru: Действие, происходящее сейчас
uk: Дія, що відбувається зараз

source: Temporary situation
ru: Временная ситуация
uk: Тимчасова ситуація

source: Definite future plan
ru: Определенный план на будущее
uk: Чіткий майбутній план

source: Present Perfect:
ru: Present Perfect (Настоящее совершенное):
uk: Present Perfect (Теперішній доконаний):

source: For actions that started in the past and continue to the present, or actions completed in the past with present relevance.
ru: Для действий, которые начались в прошлом и продолжаются до настоящего момента, или действий, завершенных в прошлом, но имеющих отношение к настоящему.
uk: Для дій, які почалися в минулому і тривають до теперішнього часу, або дій, завершених у минулому з теперішньою актуальністю.

source: Started in past, continues
ru: Началось в прошлом, продолжается
uk: Почалося в минулому, продовжується

source: Completed, relevant now
ru: Завершено, актуально сейчас
uk: Завершено, актуально зараз

source: Present Perfect Continuous:
ru: Present Perfect Continuous (Настоящее совершенное длительное):
uk: Present Perfect Continuous (Теперішній доконано-тривалий):

source: For actions that started in the past, have continued until recently, and may still be ongoing.
ru: Для действий, которые начались в прошлом, продолжались до недавнего времени и, возможно, все еще продолжаются.
uk: Для дій, які почалися в минулому, тривали донедавна і, можливо, все ще тривають.

source: Started in past, possibly still ongoing
ru: Началось в прошлом, возможно, все еще продолжается
uk: Почалося в минулому, можливо, все ще триває

source: 2. Past Tenses
ru: 2. Прошедшие времена
uk: 2. Минулі часи

source: Used for actions or states that occurred and were completed in the past.
ru: Используется для действий или состояний, которые произошли и были завершены в прошлом.
uk: Використовується для дій або станів, які відбулися та були завершені в минулому.

source: Past Simple:
ru: Past Simple (Простое прошедшее):
uk: Past Simple (Минулий простий):

source: For actions completed at a specific time in the past.
ru: Для действий, завершенных в определенное время в прошлом.
uk: Для дій, завершених у певний час у минулому.

source: Completed past action
ru: Завершенное действие в прошлом
uk: Завершена минула дія

source: Past Continuous:
ru: Past Continuous (Прошедшее длительное):
uk: Past Continuous (Минулий тривалий):

source: For an action that was ongoing at a specific time in the past, or when another action interrupted it.
ru: Для действия, которое продолжалось в определенное время в прошлом, или когда другое действие прервало его.
uk: Для дії, яка тривала в певний час у минулому, або коли її перервала інша дія.

source: Ongoing past action
ru: Продолжающееся действие в прошлом
uk: Тривала минула дія

source: Past Perfect:
ru: Past Perfect (Прошедшее совершенное):
uk: Past Perfect (Минулий доконаний):

source: For an action that was completed before another past action.
ru: Для действия, которое было завершено до другого действия в прошлом.
uk: Для дії, яка була завершена перед іншою минулою дією.

source: Action completed before another past action
ru: Действие, завершенное до другого действия в прошлом
uk: Дія, завершена перед іншою минулою дією

source: Past Perfect Continuous:
ru: Past Perfect Continuous (Прошедшее совершенное длительное):
uk: Past Perfect Continuous (Минулий доконано-тривалий):

source: For an action that was ongoing for a period up to another point in the past.
ru: Для действия, которое продолжалось в течение определенного периода времени до другого момента в прошлом.
uk: Для дії, яка тривала протягом певного періоду аж до іншого моменту в минулому.

source: 3. Future Tenses
ru: 3. Будущие времена
uk: 3. Майбутні часи

source: Used for actions or states that will happen in the future.
ru: Используется для действий или состояний, которые произойдут в будущем.
uk: Використовується для дій або станів, які відбудуться в майбутньому.

source: For predictions, spontaneous decisions, or definite plans.
ru: Для предсказаний, спонтанных решений или определенных планов.
uk: Для прогнозів, спонтанних рішень або чітких планів.

source: Prediction
ru: Предсказание
uk: Прогноз

source: Spontaneous decision
ru: Спонтанное решение
uk: Спонтанне рішення

source: Definite plan
ru: Определенный план
uk: Чіткий план

source: For an action that will be ongoing at a specific time in the future.
ru: Для действия, которое будет продолжаться в определенное время в будущем.
uk: Для дії, яка буде тривати в певний час у майбутньому.

source: For an action that will be completed before a specific point in the future.
ru: Для действия, которое будет завершено до определенного момента в будущем.
uk: Для дії, яка буде завершена до певного моменту в майбутньому.

source: For an action that will have been ongoing for a duration up to a specific point in the future.
ru: Для действия, которое будет продолжаться в течение определенного периода времени до определенного момента в будущем.
uk: Для дії, яка буде тривати протягом певного періоду аж до певного моменту в майбутньому.

source: Use of the Indicative Mood
ru: Использование изъявительного наклонения
uk: Використання Дійсного способу (Indicative Mood)

source: 1. Stating Facts and Opinions:
ru: 1. Изложение фактов и мнений:
uk: 1. Констатація Фактів та Думок:

source: The most fundamental use of the indicative mood is to convey information that is true, or believed to be true, at a particular point in time.
ru: Самое основное использование изъявительного наклонения — это передача информации, которая является истинной или считается истинной в определенный момент времени.
uk: Найбільш фундаментальне використання дійсного способу — це передача інформації, яка є правдивою, або вважається правдивою, у певний момент часу.

source: Facts and General Truths:
ru: Факты и общие истины:
uk: Факти та Загальні істини:

source: Statements about Reality:
ru: Утверждения о реальности:
uk: Твердження про Реальне:

source: Expressing Opinions or Beliefs:
ru: Выражение мнений или убеждений:
uk: Вираження Думок або Переконань:

source: 2. Asking Direct Questions:
ru: 2. Задание прямых вопросов:
uk: 2. Ставлення Прямих Питань:

source: When you seek information about a factual situation or reality, you use the indicative mood in your questions.
ru: Когда вы ищете информацию о фактической ситуации или реальности, вы используете изъявительное наклонение в своих вопросах.
uk: Коли ви шукаєте інформацію про фактичну ситуацію або реальність, ви використовуєте дійсний спосіб у своїх питаннях.

source: 3. Describing Certainty or Reality:
ru: 3. Описание уверенности или реальности:
uk: 3. Опис Впевненості або Реальності:

source: The indicative mood implies that the speaker considers the action or state to be real, certain, or highly probable.
ru: Изъявительное наклонение подразумевает, что говорящий считает действие или состояние реальным, определенным или весьма вероятным.
uk: Дійсний спосіб має на увазі, що мовець вважає дію або стан реальними, певними або високо ймовірними.

source: A current, observable fact
ru: Текущий, наблюдаемый факт
uk: Поточний, спостережуваний факт

source: A regular occurrence
ru: Регулярное явление
uk: Регулярне явище

source: A definite plan
ru: Определенный план
uk: Чіткий план

source: 4. Distinguishing from Other Moods (Brief Recap):
ru: 4. Различие с другими наклонениями (Краткий обзор):
uk: 4. Відмінність від Інших Способів (Короткий огляд):

source: Understanding the indicative mood is clearer when contrasted with the other two main moods:
ru: Понимание изъявительного наклонения становится более ясным при сопоставлении с двумя другими основными наклонениями:
uk: Розуміння дійсного способу стає зрозумілішим при порівнянні з двома іншими основними способами:

source: Vs. Imperative Mood:
ru: Против повелительного наклонения:
uk: Проти Наказового способу:

source: Indicative:
ru: Изъявительное:
uk: Дійсний:

source: A statement of fact
ru: Утверждение факта
uk: Констатація факту

source: Imperative:
ru: Повелительное:
uk: Наказовий:

source: A command or instruction
ru: Команда или инструкция
uk: Наказ або інструкція

source: Vs. Subjunctive Mood:
ru: Против сослагательного наклонения:
uk: Проти Умовного способу:

source: A fact
ru: Факт
uk: Факт

source: Subjunctive:
ru: Сослагательное:
uk: Умовний:

source: A wish, expressing unreality
ru: Пожелание, выражающее нереальность
uk: Бажання, вираження нереальності

source: Often used informally for necessity
ru: Часто используется неформально для выражения необходимости
uk: Часто використовується неформально для необхідності

source: Formal usage for necessity, expressing a requirement rather than a fact
ru: Формальное использование для выражения необходимости, требования, а не факта
uk: Формальне використання для необхідності, вираження вимоги, а не факту

source: The indicative mood is foundational for most communicative acts, enabling us to describe the world as it is.
ru: Изъявительное наклонение является основополагающим для большинства коммуникативных актов, позволяя нам описывать мир таким, какой он есть.
uk: Дійсний спосіб є основоположним для більшості комунікативних актів, дозволяючи нам описувати світ таким, яким він є.

source: The Infinitive
ru: Инфинитив (The Infinitive)
uk: Інфінітив (The Infinitive)

source: Forms of the Infinitive
ru: Формы инфинитива
uk: Форми Інфінітива

source: The infinitive has several forms to express different aspects and voices:
ru: Инфинитив имеет несколько форм для выражения различных аспектов и залогов:
uk: Інфінітив має кілька форм для вираження різних аспектів та станів:

source: Simple Infinitive:
ru: Простой инфинитив:
uk: Простий Інфінітив:

source: (to) + base form (e.g., to do, to write)
ru: (to) + базовая форма (напр., to do, to write)
uk: (to) + базова форма (напр., to do, to write)

source: Continuous Infinitive:
ru: Длительный инфинитив:
uk: Тривалий Інфінітив:

source: (to) be + V-ing (e.g., to be doing, to be writing)
ru: (to) be + V-ing (напр., to be doing, to be writing)
uk: (to) be + V-ing (напр., to be doing, to be writing)

source: Perfect Infinitive:
ru: Совершенный инфинитив:
uk: Доконаний Інфінітив:

source: (to) have + Past Participle (V3) (e.g., to have done, to have written)
ru: (to) have + Причастие прошедшего времени (V3) (напр., to have done, to have written)
uk: (to) have + Дієприкметник минулого часу (V3) (напр., to have done, to have written)

source: Perfect Continuous Infinitive:
ru: Совершенный длительный инфинитив:
uk: Доконано-тривалий Інфінітив:

source: (to) have been + V-ing (e.g., to have been doing, to have been writing)
ru: (to) have been + V-ing (напр., to have been doing, to have been writing)
uk: (to) have been + V-ing (напр., to have been doing, to have been writing)

source: Passive Infinitive (Simple):
ru: Пассивный инфинитив (Простой):
uk: Пасивний Інфінітив (Простий):

source: (to) be + Past Participle (V3) (e.g., to be done, to be written)
ru: (to) be + Причастие прошедшего времени (V3) (напр., to be done, to be written)
uk: (to) be + Дієприкметник минулого часу (V3) (напр., to be done, to be written)

source: Passive Infinitive (Perfect):
ru: Пассивный инфинитив (Совершенный):
uk: Пасивний Інфінітив (Доконаний):

source: (to) have been + Past Participle (V3) (e.g., to have been done, to have been written)
ru: (to) have been + Причастие прошедшего времени (V3) (напр., to have been done, to have been written)
uk: (to) have been + Дієприкметник минулого часу (V3) (напр., to have been done, to have been written)

source: Uses of the Infinitive
ru: Использование инфинитива
uk: Використання Інфінітива

source: The infinitive can function as a noun, an adjective, or an adverb in a sentence:
ru: Инфинитив может функционировать в предложении как существительное, прилагательное или наречие:
uk: Інфінітив може функціонувати як іменник, прикметник або прислівник у реченні:

source: As a Noun (Subject or Object):
ru: Как существительное (подлежащее или дополнение):
uk: Як Іменник (Підмет або Додаток):

source: Subject:
ru: Подлежащее:
uk: Підмет:

source: As an Adjective (modifying a noun or pronoun):
ru: Как прилагательное (определяющее существительное или местоимение):
uk: Як Прикметник (модифікує іменник або займенник):

source: As an Adverb (expressing purpose, result, or reason):
ru: Как наречие (выражающее цель, результат или причину):
uk: Як Прислівник (виражає мету, результат або причину):

source: Purpose:
ru: Цель:
uk: Мета:

source: Why did she come?
ru: Зачем она пришла?
uk: Навіщо вона прийшла?

source: Result:
ru: Результат:
uk: Результат:

source: Reason/Cause (often after adjectives):
ru: Причина/Основание (часто после прилагательных):
uk: Причина/Підстава (часто після прикметників):

source: After certain verbs:
ru: После определенных глаголов:
uk: Після певних дієслів:

source: Many verbs are typically followed by a to-infinitive.
ru: За многими глаголами обычно следует to-инфинитив.
uk: Багато дієслів типово супроводжуються to-інфінітивом.

source: After adjectives:
ru: После прилагательных:
uk: Після прикметників:

source: After question words (how, what, when, where, which, who, why):
ru: После вопросительных слов (how, what, when, where, which, who, why):
uk: Після питальних слів (how, what, when, where, which, who, why):

source: As a substitute for a clause (e.g., in relative clauses):
ru: В качестве замены придаточного предложения (напр., в относительных придаточных предложениях):
uk: Як замінник підрядного речення (напр., у відносних реченнях):

source: instead of 'who arrived'
ru: вместо 'who arrived' (который прибыл)
uk: замість 'who arrived' (хто прибув)
