Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: A. Relative Clauses
ru: A. Относительные придаточные предложения
uk: A. Відносні підрядні речення

source: B. Infinitives
ru: B. Инфинитивы
uk: B. Інфінітиви

source: C. Adverbs
ru: C. Наречия
uk: C. Прислівники

source: D. Whole Sentences
ru: D. Целые предложения
uk: D. Цілі речення

source: Comparison of Attributive Forms
ru: Сравнение форм определения
uk: Порівняння форм означень

source: Pre-noun
ru: Перед существительным
uk: Перед іменником

source: Most common form
ru: Самая распространенная форма
uk: Найпоширеніша форма

source: Shows ownership
ru: Показывает владение
uk: Показує приналежність

source: Verbal adjective
ru: Глагольное прилагательное
uk: Дієслівний прикметник

source: Post-noun
ru: После существительного
uk: Після іменника

source: Often replaceable with relative clause
ru: Часто заменяемо относительным придаточным предложением
uk: Часто можна замінити відносним підрядним реченням

source: In addition to the main parts (subject and predicate), sentences are enriched with minor parts that add detail and modify the main components. The most important minor parts are the object, the attribute, and the adverbial modifier.
ru: В дополнение к главным частям (подлежащему и сказуемому), предложения обогащаются второстепенными членами, которые добавляют детали и модифицируют главные компоненты. Наиболее важными второстепенными членами являются дополнение, определение и обстоятельство.
uk: На додаток до головних частин (підмета і присудка), речення збагачуються другорядними членами, які додають деталі та модифікують головні компоненти. Найважливішими другорядними членами є додаток, означення та обставина.

source: The Object
ru: Дополнение
uk: Додаток

source: Definition and Purpose
ru: Определение и назначение
uk: Визначення та призначення

source: The Attribute
ru: Определение
uk: Означення

source: The Adverbial Modifier
ru: Обстоятельство
uk: Обставина

source: A noun is a word that names a person, place, thing, quality, or idea. Nouns are fundamental building blocks of a sentence and can function as the subject, object, or complement. In English, they have various forms and classifications that determine their use in speech.
ru: Существительное — это слово, которое называет лицо, место, предмет, качество или идею. Существительные являются основными строительными блоками предложения и могут функционировать как подлежащее, дополнение или предикатив. В английском языке они имеют различные формы и классификации, которые определяют их использование в речи.
uk: Іменник — це слово, що називає особу, місце, річ, якість або ідею. Іменники є основними будівельними блоками речення і можуть функціонувати як підмет, додаток або предикатив. В англійській мові вони мають різні форми та класифікації, які визначають їхнє використання в мовленні.

source: Nouns: Definition and Classification
ru: Существительные: Определение и классификация
uk: Іменники: Визначення та класифікація

source: Proper vs Common Nouns
ru: Имена собственные против нарицательных
uk: Власні vs загальні іменники

source: Concrete vs Abstract
ru: Конкретные против абстрактных
uk: Конкретні vs абстрактні

source: Countable/Uncountable
ru: Исчисляемые/неисчисляемые
uk: Злічувані/незлічувані

source: Collective Nouns
ru: Собирательные существительные
uk: Збірні іменники

source: Compound Nouns
ru: Составные существительные
uk: Складені іменники

source: Gender of Nouns
ru: Род существительных
uk: Рід іменників

source: Natural Gender
ru: Естественный род
uk: Природний рід

source: Male/Female Pairs
ru: Пары мужского/женского рода
uk: Пари чоловічого/жіночого роду

source: Gender Suffixes
ru: Суффиксы рода
uk: Суфікси роду

source: Gender-Neutral Terms
ru: Гендерно-нейтральные термины
uk: Гендерно-нейтральні терміни

source: Gender in Pronouns
ru: Род в местоимениях
uk: Рід у займенниках

source: Plural Forms of Nouns
ru: Формы множественного числа существительных
uk: Форми множини іменників

source: Regular Plurals (-s/-es)
ru: Правильное множественное число (-s/-es)
uk: Правильна множина (-s/-es)

source: Nouns ending in -y/-o/-f
ru: Существительные, оканчивающиеся на -y/-o/-f
uk: Іменники, що закінчуються на -y/-o/-f

source: Irregular Plurals
ru: Неправильное множественное число
uk: Неправильна множина

source: Zero Plurals
ru: Нулевое множественное число
uk: Нульова множина

source: Always Plural Nouns
ru: Существительные всегда во множественном числе
uk: Іменники, що завжди у множині

source: Latin/Greek Plurals
ru: Латинское/Греческое множественное число
uk: Латинська/грецька множина

source: Case of Nouns
ru: Падеж существительных
uk: Відмінок іменників

source: Common Case
ru: Общий падеж
uk: Загальний відмінок

source: Possessive Case
ru: Притяжательный падеж
uk: Присвійний відмінок

source: Subject/Object Functions
ru: Функции подлежащего/дополнения
uk: Функції підмета/додатка

source: Joint Possession
ru: Совместное владение
uk: Спільна приналежність

source: Determiners
ru: Определители
uk: Детермінативи

source: Articles (a/an/the)
ru: Артикли (a/an/the)
uk: Артиклі (a/an/the)

source: Possessive Determiners
ru: Притяжательные определители
uk: Присвійні детермінативи

source: Quantifiers
ru: Квантификаторы (слова, обозначающие количество)
uk: Квантифікатори

source: Interrogative Determiners
ru: Вопросительные определители
uk: Питальні детермінативи

source: Functions of Nouns in a Sentence
ru: Функции существительных в предложении
uk: Функції іменників у реченні

source: Subject of Verb
ru: Подлежащее
uk: Підмет дієслова

source: Direct/Indirect Object
ru: Прямое/косвенное дополнение
uk: Прямий/непрямий додаток

source: Object of Preposition
ru: Дополнение при предлоге
uk: Додаток прийменника

source: Appositive
ru: Приложение
uk: Прикладка

source: For People
ru: Для людей
uk: Для людей

source: For Animals
ru: Для животных
uk: Для тварин

source: For Objects
ru: Для предметов
uk: Для об'єктів

source: Verb Agreement Rules
ru: Правила согласования глаголов
uk: Правила узгодження дієслів

source: BrE vs AmE Usage
ru: Использование в BrE против AmE
uk: Вживання у британській та американській англійській

source: Unlike regular nouns that simply add
uk: На відміну від правильних іменників, які просто додають

source: Common Irregular Nouns
ru: Распространенные неправильные существительные
uk: Поширені неправильні іменники

source: Vowel Change
ru: Изменение гласной
uk: Зміна голосного

source: Some nouns change their internal vowels to form the plural.
ru: Некоторые существительные меняют свою внутреннюю гласную для образования множественного числа.
uk: Деякі іменники змінюють свій внутрішній голосний для утворення множини.

source: Singular
ru: Единственное число
uk: Однина

source: Plural
ru: Множественное число
uk: Множина

source: Adding -en or a similar ending
ru: Добавление -en или похожего окончания
uk: Додавання -en або подібного закінчення

source: A few nouns form their plural by adding an
uk: Кілька іменників утворюють множину додаванням

source: No Change
ru: Без изменений
uk: Без змін

source: Some nouns have the same form for both singular and plural. These are often referred to as <a href="#invariable">invariable nouns</a>.
uk: Деякі іменники мають однакову форму як для однини, так і для множини. Їх часто називають <a href="#invariable">незмінними іменниками</a>.

source: Ending in -is or -on
ru: Окончание на -is или -on
uk: Закінчення на -is або -on

source: Some words of Greek or Latin origin follow their original pluralization rules.
ru: Некоторые слова греческого или латинского происхождения следуют своим первоначальным правилам образования множественного числа.
uk: Деякі слова грецького або латинського походження дотримуються своїх оригінальних правил утворення множини.

source: Some nouns in English exist only in the plural form and are always used with a plural verb. These nouns often refer to objects that have two parts or items that come in a set.
ru: Некоторые существительные в английском языке существуют только во форме множественного числа и всегда используются с глаголом во множественном числе. Эти существительные часто относятся к предметам, которые имеют две части, или к предметам, которые идут в наборе.
uk: Деякі іменники в англійській мові існують лише у формі множини та завжди вживаються з дієсловом у множині. Ці іменники часто позначають об'єкти, що мають дві частини, або предмети, які йдуть у комплекті.

source: Nouns for Two-Part Objects
ru: Существительные для предметов из двух частей
uk: Іменники для об'єктів із двох частин

source: This group includes items that are symmetrical and consist of two identical parts joined together.
ru: В эту группу входят предметы, которые симметричны и состоят из двух одинаковых, соединенных вместе частей.
uk: До цієї групи входять предмети, які є симетричними і складаються з двох однакових частин, з'єднаних разом.

source: Nouns for Clothing and Tools
ru: Существительные для одежды и инструментов
uk: Іменники для одягу та інструментів

source: Some articles of clothing and tools also fall into this category.
ru: Некоторые предметы одежды и инструменты также попадают в эту категорию.
uk: Деякі предмети одягу та інструменти також належать до цієї категорії.

source: Other Categories
ru: Другие категории
uk: Інші категорії

source: Some other nouns, including abstract concepts and names of places, are always plural.
ru: Некоторые другие существительные, включая абстрактные понятия и названия мест, всегда стоят во множественном числе.
uk: Деякі інші іменники, включаючи абстрактні поняття та назви місць, завжди є у множині.

source: Using 'a pair of' with These Nouns
ru: Использование 'a pair of' (пара) с этими существительными
uk: Використання 'a pair of' (пара) з цими іменниками

source: To refer to a single item from these categories, we use the phrase <span class="gram_rule">a pair of</span>.
uk: Щоб послатися на один предмет з цих категорій, ми використовуємо фразу <span class="gram_rule">пара</span>.

source: Types of Appositives
ru: Типы приложений
uk: Типи прикладок

source: Non-Restrictive Appositive
ru: Неограничительное приложение
uk: Необмежувальна прикладка

source: A non-restrictive appositive provides extra, non-essential information. The sentence would still make sense without it. These are usually set off by commas.
ru: Неограничительное приложение предоставляет дополнительную, несущественную информацию. Предложение всё равно имело бы смысл без него. Оно обычно выделяется запятыми.
uk: Необмежувальна прикладка надає додаткову, несуттєву інформацію. Речення залишатиметься зрозумілим і без неї. Вони зазвичай відокремлюються комами.

source: Sentence
ru: Предложение
uk: Речення

source: Restrictive Appositive
ru: Ограничительное приложение
uk: Обмежувальна прикладка

source: A restrictive appositive is essential to the meaning of the sentence. It specifies or identifies the noun and cannot be removed without changing the sentence's meaning or creating confusion. Restrictive appositives are not set off by commas.
ru: Ограничительное приложение является существенным для значения предложения. Оно уточняет или идентифицирует существительное и не может быть удалено без изменения смысла предложения или создания путаницы. Ограничительные приложения не выделяются запятыми.
uk: Обмежувальна прикладка є суттєвою для значення речення. Вона уточнює або ідентифікує іменник і не може бути вилучена без зміни значення речення або створення плутанини. Обмежувальні прикладки комами не відокремлюються.

source: Key Difference and Punctuation
ru: Ключевое различие и пунктуация
uk: Ключова відмінність та пунктуація

source: The main difference between restrictive and non-restrictive appositives lies in the use of commas. If the appositive could be removed without making the sentence unclear, use commas. If the appositive is necessary to identify the noun, do not use commas.
ru: Основное различие между ограничительными и неограничительными приложениями заключается в использовании запятых. Если приложение может быть удалено без того, чтобы предложение стало неясным, используйте запятые. Если приложение необходимо для идентификации существительного, не используйте запятые.
uk: Основна відмінність між обмежувальними та необмежувальними прикладками полягає у використанні ком. Якщо прикладку можна вилучити, і речення залишиться зрозумілим, використовуйте коми. Якщо прикладка необхідна для ідентифікації іменника, не використовуйте коми.

source: With commas (non-restrictive):
ru: С запятыми (неограничительное):
uk: З комами (необмежувальна):

source: I only have one dog, and his name is Bob. The name is extra information.
ru: У меня только одна собака, и его зовут Боб. Имя — дополнительная информация.
uk: У мене лише один собака, і його звуть Боб. Ім'я є додатковою інформацією.

source: Without commas (restrictive):
ru: Без запятых (ограничительное):
uk: Без ком (обмежувальна):

source: I have multiple dogs, and I am specifying that I mean the one named Bob. The name is essential information.
ru: У меня несколько собак, и я уточняю, что имею в виду ту, которую зовут Боб. Имя — существенная информация.
uk: У мене кілька собак, і я уточнюю, що маю на увазі того, якого звуть Боб. Ім'я є суттєвою інформацією.

source: One of the most notable differences between British English (BrE) and American English (AmE) is the way they handle verb agreement with collective nouns. While both can be considered correct, there are clear preferences in each dialect.
ru: Одним из наиболее заметных различий между британским (BrE) и американским (AmE) английским языком является то, как они обрабатывают согласование глаголов с собирательными существительными. Хотя оба варианта могут считаться правильными, в каждом диалекте есть четкие предпочтения.
uk: Однією з найбільш помітних відмінностей між британською (BrE) та американською (AmE) англійською є те, як вони узгоджують дієслова зі збірними іменниками. Хоча обидва варіанти можуть вважатися правильними, у кожному діалекті є чіткі переваги.

source: British English
ru: Британский английский
uk: Британська англійська

source: In British English, collective nouns can take either a singular or a plural verb. The choice depends on whether the speaker is thinking of the group as a single, unified entity or as a collection of individual members.
ru: В британском английском языке собирательные существительные могут принимать как глагол в единственном, так и во множественном числе. Выбор зависит от того, рассматривает ли говорящий группу как единое целое или как совокупность отдельных членов.
uk: У британській англійській збірні іменники можуть вживатися як з дієсловом в однині, так і в множині. Вибір залежить від того, чи розглядає мовець групу як єдину, об'єднану сутність, чи як сукупність окремих членів.

source: Perspective
ru: Перспектива
uk: Перспектива

source: As a single unit
ru: Как единое целое
uk: Як єдине ціле

source: The committee as one body is having a meeting.
ru: Комитет как единый орган проводит встречу. (Комитет проводит встречу.)
uk: Комітет як єдиний орган проводить засідання.

source: As individual members
ru: Как отдельные члены
uk: Як окремі члени

source: The members of the committee are in disagreement with each other.
ru: Члены комитета не согласны друг с другом. (Комитет не согласен друг с другом.)
uk: Члени комітету не згодні один з одним.

source: Key point for BrE
ru: Ключевой момент для BrE
uk: Ключовий момент для BrE

source: The use of a plural verb is very common in British English, especially when talking about groups of people like a
uk: Вживання дієслова у множині є дуже поширеним у британській англійській, особливо коли йдеться про групи людей, наприклад

source: American English
ru: Американский английский
uk: Американська англійська

source: In American English, the standard practice is to treat collective nouns as a single unit and use a singular verb, regardless of whether the members are acting together or individually. A plural verb is considered informal and is rarely used.
ru: В американском английском стандартной практикой является рассмотрение собирательных существительных как единого целого и использование глагола в единственном числе, независимо от того, действуют ли члены вместе или индивидуально. Глагол во множественном числе считается неформальным и редко используется.
uk: В американській англійській стандартна практика полягає в тому, щоб розглядати збірні іменники як єдине ціле та використовувати дієслово в однині, незалежно від того, діють члени разом чи індивідуально. Дієслово у множині вважається неформальним і використовується рідко.

source: Even when individuals disagree, the group is still a single unit.
ru: Даже когда отдельные лица не согласны, группа по-прежнему является единым целым.
uk: Навіть коли окремі особи не згодні, група все ще є єдиним цілим.

source: Key point for AmE
ru: Ключевой момент для AmE
uk: Ключовий момент для AmE

source: To emphasize the individual members, Americans often rephrase the sentence rather than using a plural verb with the collective noun.
ru: Чтобы подчеркнуть отдельных членов, американцы часто перефразируют предложение, а не используют глагол во множественном числе с собирательным существительным.
uk: Щоб підкреслити окремих членів, американці часто перефразовують речення, замість того, щоб використовувати дієслово у множині зі збірним іменником.

source: Instead of: The
uk: Замість:

source: It is more common to say: The
uk: Частіше кажуть:

source: Common Collective Nouns
ru: Распространенные собирательные существительные
uk: Поширені збірні іменники

source: Group of
ru: Группа (кого/чего)
uk: Група (кого/чого)

source: For Things
ru: Для предметов
uk: Для речей

source: Whether to use a singular or plural verb with a collective noun depends on the context and the dialect (British vs. American English).
ru: Использовать ли глагол в единственном или во множественном числе с собирательным существительным, зависит от контекста и диалекта (британский против американского английского).
uk: Вибір дієслова в однині чи множині зі збірним іменником залежить від контексту та діалекту (британська чи американська англійська).

source: Singular Verb (as a single unit):
ru: Глагол в единственном числе (как единое целое):
uk: Дієслово в однині (як єдине ціле):

source: Use a singular verb when the group is acting together as one unit.
ru: Используйте глагол в единственном числе, когда группа действует вместе как единое целое.
uk: Використовуйте дієслово в однині, коли група діє разом як єдине ціле.

source: The entire team is acting as one entity.
ru: Вся команда действует как единое целое.
uk: Вся команда діє як єдиний суб'єкт.

source: The committee is making a single, unified decision.
ru: Комитет принимает единое, согласованное решение.
uk: Комітет приймає єдине, узгоджене рішення.

source: Plural Verb (as individual members):
ru: Глагол во множественном числе (как отдельные члены):
uk: Дієслово у множині (як окремі члени):

source: Use a plural verb when the members of the group are acting individually.
ru: Используйте глагол во множественном числе, когда члены группы действуют индивидуально.
uk: Використовуйте дієслово у множині, коли члени групи діють індивідуально.

source: Each member of the team is trying on their own uniform.
ru: Каждый член команды примеряет свою собственную форму. (Множественное число, так как действие индивидуально).
uk: Кожен член команди приміряє свою власну форму.

source: The members of the committee are in disagreement.
ru: Члены комитета не согласны. (Множественное число, так как действие индивидуально).
uk: Члени комітету не згодні.

source: American English (AmE):
ru: Американский английский (AmE):
uk: Американська англійська (AmE):

source: Typically favors singular verb agreement for collective nouns, treating the group as a single unit in most cases.
ru: Обычно предпочитает согласование глагола в единственном числе для собирательных существительных, рассматривая группу как единое целое в большинстве случаев.
uk: Зазвичай віддає перевагу узгодженню дієслова в однині для збірних іменників, розглядаючи групу як єдине ціле в більшості випадків.

source: British English (BrE):
ru: Британский английский (BrE):
uk: Британська англійська (BrE):

source: More often uses plural verb agreement, especially when referring to groups of people, emphasizing the individual members.
ru: Чаще использует согласование глагола во множественном числе, особенно когда речь идет о группах людей, подчеркивая отдельных членов.
uk: Частіше використовує узгодження дієслова у множині, особливо коли йдеться про групи людей, підкреслюючи окремих членів.

source: Collective Nouns for Animals
ru: Собирательные существительные для животных
uk: Збірні іменники для тварин

source: Common Collective Nouns for Animals
ru: Распространенные собирательные существительные для животных
uk: Поширені збірні іменники для тварин

source: These are some of the most widely recognized collective nouns for animal groups.
ru: Это некоторые из наиболее широко известных собирательных существительных для групп животных.
uk: Це деякі з найбільш загальновизнаних збірних іменників для груп тварин.

source: Collective Noun
ru: Собирательное существительное
uk: Збірний іменник

source: Animal
ru: Животное
uk: Тварина

source: More Unusual Collective Nouns for Animals
ru: Более необычные собирательные существительные для животных
uk: Більш незвичайні збірні іменники для тварин

source: The English language has many creative and historical terms for groups of animals, some of which are less common today.
ru: В английском языке есть много креативных и исторических терминов для групп животных, некоторые из которых менее распространены сегодня.
uk: В англійській мові є багато творчих та історичних термінів для позначення груп тварин, деякі з яких сьогодні менш поширені.

source: Usage Note
ru: Примечание по использованию
uk: Примітка про вживання

source: While many of these terms are specific to certain animals, you can often use more general collective nouns like <span class="gram_rule">herd</span> or <span class="gram_rule">group</span>.
uk: Хоча багато з цих термінів є специфічними для певних тварин, ви часто можете використовувати більш загальні збірні іменники, як-от <span class="gram_rule">herd</span> або <span class="gram_rule">group</span>.

source: Collective Nouns for Objects
ru: Собирательные существительные для предметов
uk: Збірні іменники для об'єктів

source: Common Collective Nouns for Objects
ru: Распространенные собирательные существительные для предметов
uk: Поширені збірні іменники для об'єктів

source: Here is a list of frequently used collective nouns for various items.
ru: Вот список часто используемых собирательных существительных для различных предметов.
uk: Ось список часто використовуваних збірних іменників для різних предметів.

source: Objects
ru: Предметы
uk: Об'єкти (речі)

source: While many of these nouns are specific, some can be used more generally to describe any collection. For example, a
uk: Хоча багато з цих іменників є специфічними, деякі можуть використовуватися більш загально для опису будь-якої колекції. Наприклад,

source: Collective Nouns for People
ru: Собирательные существительные для людей
uk: Збірні іменники для людей

source: Common Collective Nouns for People
ru: Распространенные собирательные существительные для людей
uk: Поширені збірні іменники для людей

source: These are some of the most frequently used collective nouns for groups of people.
ru: Это некоторые из наиболее часто используемых собирательных существительных для групп людей.
uk: Це деякі з найбільш часто використовуваних збірних іменників для груп людей.

source: Specific Collective Nouns for People
ru: Специфические собирательные существительные для людей
uk: Специфічні збірні іменники для людей
