Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: If you have configured your browser to disable “Referer” headers, please re-enable them, at least for this site, or for HTTPS connections, or for “same-origin” requests.
ru: Если вы настроили свой браузер на отключение заголовков “Referer”, пожалуйста, включите их снова, по крайней мере для этого сайта, или для HTTPS-соединений, или для запросов с “тем же источником”.
uk: Якщо ви налаштували свій браузер на вимкнення заголовків «Referer», будь ласка, увімкніть їх знову, принаймні для цього сайту, або для HTTPS-з'єднань, або для запитів «same-origin».

source: If you are using the <meta name="referrer" content="no-referrer"> tag or including the “Referrer-Policy: no-referrer” header, please remove them. The CSRF protection requires the “Referer” header to do strict referer checking. If you’re concerned about privacy, use alternatives like <a rel="noreferrer" …> for links to third-party sites.
ru: Если вы используете тег <meta name="referrer" content="no-referrer"> или включаете заголовок “Referrer-Policy: no-referrer”, пожалуйста, удалите их. Защита CSRF требует наличия заголовка “Referer” для строгой проверки реферера. Если вы беспокоитесь о конфиденциальности, используйте альтернативы, такие как <a rel="noreferrer" …> для ссылок на сторонние сайты.
uk: Якщо ви використовуєте тег <meta name="referrer" content="no-referrer"> або включаєте заголовок «Referrer-Policy: no-referrer», будь ласка, видаліть їх. Захист CSRF вимагає заголовок «Referer» для здійснення суворої перевірки реферера. Якщо вас турбує конфіденційність, використовуйте альтернативи, такі як <a rel="noreferrer" …> для посилань на сторонні сайти.

source: You are seeing this message because this site requires a CSRF cookie when submitting forms. This cookie is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ru: Вы видите это сообщение, потому что этот сайт требует наличия CSRF-куки при отправке форм. Эта куки требуется по соображениям безопасности, чтобы гарантировать, что ваш браузер не будет перехвачен третьими лицами.
uk: Ви бачите це повідомлення, оскільки цей сайт вимагає файлу cookie CSRF при надсиланні форм. Цей файл cookie вимагається з міркувань безпеки, щоб гарантувати, що ваш браузер не захоплюється третіми сторонами.

source: If you have configured your browser to disable cookies, please re-enable them, at least for this site, or for “same-origin” requests.
ru: Если вы настроили свой браузер на отключение куки, пожалуйста, включите их снова, по крайней мере для этого сайта, или для запросов с “тем же источником”.
uk: Якщо ви налаштували свій браузер на вимкнення файлів cookie, будь ласка, увімкніть їх знову, принаймні для цього сайту, або для запитів «same-origin».

source: More information is available with DEBUG=True.
ru: Дополнительная информация доступна при DEBUG=True.
uk: Більше інформації доступно, якщо DEBUG=True.

source: No year specified
ru: Год не указан
uk: Не вказано рік

source: Date out of range
ru: Дата вне диапазона
uk: Дата виходить за межі діапазону

source: No month specified
ru: Месяц не указан
uk: Не вказано місяць

source: No day specified
ru: День не указан
uk: Не вказано день

source: No week specified
ru: Неделя не указана
uk: Не вказано тиждень

source: No %(verbose_name_plural)s available
ru: Нет доступных %(verbose_name_plural)s
uk: Немає доступних %(verbose_name_plural)s

source: Future %(verbose_name_plural)s not available because %(class_name)s.allow_future is False.
ru: Будущие %(verbose_name_plural)s недоступны, так как %(class_name)s.allow_future имеет значение False.
uk: Майбутні %(verbose_name_plural)s недоступні, оскільки %(class_name)s.allow_future має значення False.

source: Invalid date string “%(datestr)s” given format “%(format)s”
ru: Недопустимая строка даты «%(datestr)s» для формата «%(format)s»
uk: Недійсний рядок дати «%(datestr)s» при заданому форматі «%(format)s»

source: No %(verbose_name)s found matching the query
ru: Не найдено %(verbose_name)s, соответствующего запросу
uk: Не знайдено %(verbose_name)s, що відповідає запиту

source: Page is not “last”, nor can it be converted to an int.
ru: Страница не является «last» и не может быть преобразована в целое число.
uk: Сторінка не є «last» і не може бути перетворена на ціле число.

source: Invalid page (%(page_number)s): %(message)s
ru: Недопустимая страница (%(page_number)s): %(message)s
uk: Недійсна сторінка (%(page_number)s): %(message)s

source: Empty list and “%(class_name)s.allow_empty” is False.
ru: Список пуст, и «%(class_name)s.allow_empty» имеет значение False.
uk: Порожній список, а «%(class_name)s.allow_empty» має значення False.

source: Directory indexes are not allowed here.
ru: Индексы каталогов здесь не разрешены.
uk: Індекси каталогів тут не дозволені.

source: “%(path)s” does not exist
ru: «%(path)s» не существует
uk: «%(path)s» не існує

source: Index of %(directory)s
ru: Индекс %(directory)s
uk: Індекс %(directory)s

source: The install worked successfully! Congratulations!
ru: Установка прошла успешно! Поздравляем!
uk: Встановлення пройшло успішно! Вітаємо!

source: View <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">release notes</a> for Django %(version)s
ru: Смотрите <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">примечания к выпуску</a> Django %(version)s
uk: Переглянути <a href="https://docs.djangoproject.com/en/%(version)s/releases/" target="_blank" rel="noopener">примітки до випуску</a> Django %(version)s

source: You are seeing this page because <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> is in your settings file and you have not configured any URLs.
ru: Вы видите эту страницу, потому что в вашем файле настроек указано <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> и вы не настроили ни один URL-адрес.
uk: Ви бачите цю сторінку, оскільки <a href="https://docs.djangoproject.com/en/%(version)s/ref/settings/#debug" target="_blank" rel="noopener">DEBUG=True</a> встановлено у вашому файлі налаштувань, і ви не налаштували жодних URL-адрес.

source: Django Documentation
ru: Документация Django
uk: Документація Django

source: Topics, references, &amp; how-to’s
ru: Темы, справочники и руководства
uk: Теми, довідники та інструкції

source: Tutorial: A Polling App
ru: Учебник: Приложение для опросов
uk: Підручник: Додаток для опитування

source: Get started with Django
ru: Начните работу с Django
uk: Початок роботи з Django

source: Django Community
ru: Сообщество Django
uk: Спільнота Django

source: Connect, get help, or contribute
ru: Общайтесь, получайте помощь или вносите вклад
uk: Спілкуйтеся, отримуйте допомогу або робіть внесок

source: Covers the classification of English verbs, including regular and irregular verbs, their forms, and usage.
ru: Рассматривает классификацию английских глаголов, включая правильные и неправильные глаголы, их формы и употребление.
uk: Охоплює класифікацію англійських дієслів, включаючи правильні та неправильні дієслова, їхні форми та вживання.

source: Discusses the definition, classification, gender, plural forms, case, and functions of nouns in a sentence.
ru: Обсуждает определение, классификацию, род, формы множественного числа, падеж и функции существительных в предложении.
uk: Обговорює визначення, класифікацію, рід, форми множини, відмінок та функції іменників у реченні.

source: Explains the definition, origin, types (definite, indefinite), and placement of articles in sentences.
ru: Объясняет определение, происхождение, типы (определенный, неопределенный) и расположение артиклей в предложениях.
uk: Пояснює визначення, походження, типи (означений, неозначений) та розміщення артиклів у реченнях.

source: Covers the definition, structure, types, degrees of comparison, and functions of adjectives.
ru: Рассматривает определение, структуру, типы, степени сравнения и функции прилагательных.
uk: Охоплює визначення, структуру, типи, ступені порівняння та функції прикметників.

source: Discusses the definition, structure, usage, and groups of pronouns based on their meaning.
ru: Обсуждает определение, структуру, употребление и группы местоимений на основе их значения.
uk: Обговорює визначення, структуру, вживання та групи займенників на основі їхнього значення.

source: Explains the definition, types (cardinal, ordinal), and usage of numbers, including dates, time, and fractions.
ru: Объясняет определение, типы (количественные, порядковые) и использование чисел, включая даты, время и дроби.
uk: Пояснює визначення, типи (кількісні, порядкові) та вживання числівників, включаючи дати, час та дроби.

source: Covers the definition, usage, types (time, place, manner, degree), degrees of comparison, and placement of adverbs.
ru: Рассматривает определение, употребление, типы (времени, места, образа действия, степени), степени сравнения и расположение наречий.
uk: Охоплює визначення, вживання, типи (часу, місця, способу дії, ступеня), ступені порівняння та розміщення прислівників.

source: Discusses the definition, form, grammatical and semantic meaning, and placement of prepositions.
ru: Обсуждает определение, форму, грамматическое и семантическое значение, а также расположение предлогов.
uk: Обговорює визначення, форму, граматичне та семантичне значення, а також розміщення прийменників.

source: Explains the definition, classification (coordinating, subordinating), and distinction between conjunctions, prepositions, and adverbs.
ru: Объясняет определение, классификацию (сочинительные, подчинительные) и различие между союзами, предлогами и наречиями.
uk: Пояснює визначення, класифікацію (сурядні, підрядні) та відмінність між сполучниками, прийменниками та прислівниками.

source: Covers the definition, classification, usage, and distinction of particles from other parts of speech.
ru: Рассматривает определение, классификацию, употребление и отличие частиц от других частей речи.
uk: Охоплює визначення, класифікацію, вживання та відмінність часток від інших частин мови.

source: Discusses the definition and usage of interjections.
ru: Обсуждает определение и употребление междометий.
uk: Обговорює визначення та вживання вигуків.

source: Explains the subject and predicate.
ru: Объясняет подлежащее и сказуемое.
uk: Пояснює підмет та присудок.

source: Covers the object, attribute, and adverbial modifier.
ru: Рассматривает дополнение, определение и обстоятельство.
uk: Охоплює додаток, означення та обставину.

source: Discussid Explains compound and complex sentences, including conditional sentences.
uk: Пояснює складносурядні та складнопідрядні речення, включаючи умовні речення.

source: Covers the formation, usage, and sequence of tenses in reported speech.
ru: Рассматривает образование, употребление и последовательность времен в косвенной речи.
uk: Охоплює утворення, вживання та узгодження часів у непрямій мові.

source: Discusses punctuation marks.
ru: Обсуждает знаки препинания.
uk: Обговорює розділові знаки.

source: Similar to how adjectives can refer to a group of people, they can also be used with the definite article
ru: Подобно тому, как прилагательные могут относиться к группе людей, их также можно использовать с определенным артиклем =\

source: The structure is
ru: Структура выглядит так

source: This structure remains attributive, так как все прилагательные являются частью именной фразы, которая стоит перед самим существительным.
ru: Эта структура остается атрибутивной, поскольку все прилагательные являются частью именной фразы, которая стоит перед самим существительным.

source: Let's describe a car using a few adjectives. The correct order is based on the OSASCOMP rule:
ru: Давайте опишем автомобиль с помощью нескольких прилагательных. Правильный порядок основан на правиле OSASCOMP:

source: Let's describe a piece of furniture with a more detailed combination. The order is:
ru: Давайте опишем предмет мебели с более подробной комбинацией. Порядок следующий:

source: Here's an example that includes an adjective of origin:
ru: Вот пример, включающий прилагательное происхождения:

source: For most two-syllable adjectives, you use
ru: Для большинства двусложных прилагательных вы используете

source: <strong>Note:</strong> Adjectives ending in
ru: <strong>Примечание:</strong> Прилагательные, оканчивающиеся на

source: All adjectives with three or more syllables form the comparative and superlative degrees using
ru: Все прилагательные с тремя и более слогами образуют сравнительную и превосходную степени, используя

source: While most adjectives follow the standard rules for forming comparative and superlative degrees, some common adjectives have irregular forms that must be memorized. These forms do not follow the
ru: Хотя большинство прилагательных следуют стандартным правилам образования сравнительной и превосходной степеней, некоторые распространенные прилагательные имеют неправильные формы, которые необходимо запомнить. Эти формы не следуют

source: Singular vs. Plural Distinction
ru: Различие единственного и множественного числа

source: It is important to remember the distinction between the abstract, singular noun use (e.g.,
ru: Важно помнить о различии между абстрактным, единственным числом (например,

source: ) and the plural human group use (e.g.,
ru: ) и использованием для обозначения группы людей во множественном числе (например,

source: Most one-syllable adverbs form their comparative and superlative by adding
ru: Большинство односложных наречий образуют сравнительную и превосходную степени путем добавления

source: Most adverbs formed by adding
ru: Большинство наречий, образованных добавлением

source: Never add
ru: Никогда не добавляйте

source: These can be tricky - some take
ru: Они могут быть сложными – некоторые принимают

source: Adverbs identical to adjectives often take
ru: Наречия, идентичные прилагательным, часто принимают

source: Most others use
ru: Большинство других используют

source: When in doubt, use
ru: Если сомневаетесь, используйте

source: Remember that
ru: Помните, что

source: Proper adverb ordering creates clear, natural-sounding English. The standard sequence follows the
ru: Правильный порядок наречий создает ясный, естественно звучащий английский язык. Стандартная последовательность следует

source: These describe
ru: Они описывают

source: An <span class=\
ru: Артикль <span class=\

source: A <span class=\
ru: <span class=\

source: If + Past Perfect
ru: If + Past Perfect (Если бы + Past Perfect)

source: If + Past Simple
ru: If + Past Simple (Если бы + Past Simple)

source: Present Simple → Past Simple
ru: Настоящее простое → Прошедшее простое

source: Present Continuous → Past Continuous
ru: Настоящее длительное → Прошедшее длительное

source: Present Perfect → Past Perfect
ru: Настоящее совершенное → Прошедшее совершенное

source: Past Simple → Past Perfect
ru: Прошедшее простое → Прошедшее совершенное

source: Future Simple → Conditional
ru: Будущее простое → Условное наклонение

source: Exceptions to Tense Backshift
ru: Исключения из правил сдвига времени

source: Exceptions to Backshift
ru: Исключения из сдвига времени

source: Exceptions to Tense Backshift Rules
ru: Исключения из правил сдвига глагольных времен

source: While tense backshift is the general rule in indirect speech, there are several important exceptions where the original tense is maintained. Understanding these exceptions is crucial for accurate reporting.
ru: Хотя сдвиг глагольных времен является общим правилом в косвенной речи, существует несколько важных исключений, когда исходное время сохраняется. Понимание этих исключений крайне важно для точной передачи речи.

source: Primary Exceptions to Tense Backshift
ru: Основные исключения из правил сдвига времени

source: These are the most common situations where tense backshift is not applied:
ru: Это наиболее распространенные ситуации, когда сдвиг глагольного времени не применяется:

source: 1. Universal Truths and Scientific Facts
ru: 1. Общеизвестные истины и научные факты

source: When reporting statements that express general truths or scientific facts that remain true regardless of time:
ru: При передаче утверждений, выражающих общие истины или научные факты, которые остаются верными независимо от времени:

source: Note: These facts are permanently true, so the present tense is maintained.
ru: Примечание: Эти факты являются постоянно верными, поэтому настоящее время сохраняется.

source: 2. Present Tense Reporting Verbs
ru: 2. Глаголы, вводящие речь, в настоящем времени

source: When the reporting verb is in the present, present perfect, or future tense:
ru: Когда глагол, вводящий речь, стоит в настоящем, настоящем совершенном или будущем времени:

source: 3. Unchanged Modal Verbs
ru: 3. Неизменяемые модальные глаголы

source: Certain modal verbs don't change in reported speech:
ru: Некоторые модальные глаголы не изменяются в косвенной речи:

source: Modal Verb
ru: Модальный глагол

source: Reported Speech
ru: Косвенная речь

source: Additional Special Cases
ru: Дополнительные особые случаи

source: Other situations where tense backshift may not apply:
ru: Другие ситуации, где сдвиг времени может не применяться:

source: 1. Past Perfect Remains Unchanged
ru: 1. Прошедшее совершенное (Past Perfect) остается без изменений

source: The past perfect tense doesn't change because there's no 'more past' form:
ru: Прошедшее совершенное время не меняется, потому что нет 'более прошедшей' формы:

source: 2. Situations Still True at Time of Reporting
ru: 2. Ситуации, которые остаются истинными на момент сообщения

source: When the original statement remains true when reported:
ru: Когда исходное утверждение остается верным на момент сообщения:

source: Note: If the situation has changed, backshift is required.
ru: Примечание: Если ситуация изменилась, сдвиг времени обязателен.

source: Answers the questions <span class=\
ru: Отвечает на вопросы <span class=\

source: Ask <span class=\
ru: Спросите <span class=\

source: Change number and see what changes
ru: Измените число и посмотрите, что изменится

source: Modify verbs by describing <span class=\
ru: Модифицируют глаголы, описывая <span class=\

source: Modify adjectives by indicating <span class=\
ru: Модифицируют прилагательные, указывая <span class=\

source: Modify other adverbs by showing <span class=\
ru: Модифицируют другие наречия, показывая <span class=\

source: Modify entire sentences to express <span class=\
ru: Модифицируют целые предложения, чтобы выразить <span class=\

source: When using multiple adverbials, typical order is: <span class=\
ru: При использовании нескольких обстоятельств, типичный порядок: <span class=\

source: Objects complete the meaning of transitive verbs, with <span class=\
ru: Дополнения завершают значение переходных глаголов, при этом <span class=\

source: Always associated with <span class=\
ru: Всегда связано с <span class=\

source: Answers <span class=\
ru: Отвечает на <span class=\

source: Typical order when combining different types: <span class=\
ru: Типичный порядок при объединении разных типов: <span class=\

source: Typically formed by adding <span class=\
ru: Обычно образуются добавлением <span class=\

source: Unlike regular nouns that simply add <span class=\
ru: В отличие от правильных существительных, которые просто добавляют <span class=\

source: A few nouns form their plural by adding an <span class=\
ru: Некоторые существительные образуют множественное число добавлением <span class=\

source: Some nouns have the same form for both singular and plural. These are often referred to as <a href=\
ru: Некоторые существительные имеют одинаковую форму как для единственного, так и для множественного числа. Их часто называют <a href=\

source: To refer to a single item from these categories, we use the phrase <span class=\
ru: Чтобы сослаться на один предмет из этих категорий, мы используем фразу <span class=\

source: The use of a plural verb is very common in British English, especially when talking about groups of people like a <span class=\
ru: Использование глагола во множественном числе очень распространено в британском английском, особенно при обсуждении групп людей, таких как <span class=\

source: Instead of: The <span class=\
ru: Вместо: <span class=\

source: It is more common to say: The <span class=\
ru: Чаще говорят: <span class=\

source: While many of these terms are specific to certain animals, you can often use more general collective nouns like <span class=\
ru: В то время как многие из этих терминов специфичны для определенных животных, вы часто можете использовать более общие собирательные существительные, такие как <span class=\

source: While many of these nouns are specific, some can be used more generally to describe any collection. For example, a <span class=\
ru: В то время как многие из этих существительных специфичны, некоторые могут использоваться более обобщенно для описания любой коллекции. Например, <span class=\

source: It's important to note that the form of the noun (<span class=\
ru: Важно отметить, что форма существительного (<span class=\

source: Some abstract nouns can be formed by adding a suffix to an adjective or verb (e.g., <span class=\
ru: Некоторые абстрактные существительные могут быть образованы путем добавления суффикса к прилагательному или глаголу (например, <span class=\

source: They can be used with indefinite articles <span class=\
ru: Они могут использоваться с неопределенными артиклями <span class=\

source: They can be used with quantifiers like <span class=\
ru: Они могут использоваться с квантификаторами, такими как <span class=\

source: They do not take the indefinite articles <span class=\
ru: Они не используются с неопределенными артиклями <span class=\

source: They are used with quantifiers like <span class=\
ru: Они используются с квантификаторами, такими как <span class=\

source: To count them, we use phrases like <span class=\
ru: Чтобы посчитать их, мы используем фразы, такие как <span class=\

source: Nouns can function as either a <span class=\
ru: Существительные могут функционировать как <span class=\

source: The indirect object can be rephrased using a prepositional phrase, usually with <span class=\
ru: Косвенное дополнение может быть перефразировано с использованием предложной фразы, обычно с <span class=\

source: Modern English widely uses singular <span class=\
ru: В современном английском широко используется единственное <span class=\

source: The pronoun <span class=\
ru: Местоимение <span class=\

source: When the gender of a pet or a specific animal is known, it is common to use <span class=\
ru: Когда пол домашнего животного или конкретного животного известен, обычно используется <span class=\

source: The most common suffix used to create a feminine noun is <span class=\
ru: Самый распространенный суффикс, используемый для создания существительного женского рода, — это <span class=\

source: Still common, but <span class=\
ru: Все еще распространен, но <span class=\

source: Gender-neutral <span class=\
ru: Гендерно-нейтральный <span class=\

source: Instead of <span class=\
ru: Вместо <span class=\

source: When two or more nouns share a single item, ownership is indicated by adding <span class=\
ru: Когда два или более существительных делят один предмет, владение обозначается добавлением <span class=\

source: When two or more nouns possess their own separate items, ownership is indicated by adding <span class=\
ru: Когда два или более существительных владеют своими отдельными предметами, владение обозначается добавлением <span class=\
