Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: These three prepositions form a hierarchy from specific to general, creating a mental framework that applies to both time and space. Understanding this pattern is key to mastering their usage.
ru: Эти три предлога образуют иерархию от специфического к общему, создавая ментальную основу, применимую как ко времени, так и к пространству. Понимание этой закономерности является ключом к освоению их использования.
uk: Ці три прийменники утворюють ієрархію від конкретного до загального, створюючи ментальну основу, яка застосовується як до часу, так і до простору. Розуміння цього шаблону є ключем до опанування їхнього вживання.

source: Spatial Relationships
ru: Пространственные отношения
uk: Просторові зв'язки

source: Specific Points
uk: Конкретні точки

source: Exact locations and addresses
uk: Точні місця та адреси

source: General locations when the exact position isn't important
uk: Загальні місця, коли точне положення не важливе

source: Surfaces and Lines
uk: Поверхні та лінії

source: Horizontal and vertical surfaces
uk: Горизонтальні та вертикальні поверхні

source: Transportation (except cars)
uk: Транспорт (крім автомобілів)

source: Streets and roads
uk: Вулиці та дороги

source: Enclosed Spaces
uk: Закриті простори

source: Geographical areas
uk: Географічні зони

source: Enclosed containers
uk: Закриті контейнери

source: Transportation (cars)
uk: Транспорт (автомобілі)

source: Temporal Relationships
ru: Временные отношения
uk: Часові зв'язки

source: Precise Times
uk: Точний час

source: Clock times
uk: Час на годиннику

source: Specific points in daily routines
uk: Конкретні моменти у щоденних рутинах

source: Holiday periods (when referring to the time itself)
uk: Святкові періоди (при посиланні на сам час)

source: Specific Days
uk: Конкретні дні

source: Days of the week
uk: Дні тижня

source: Special days
uk: Особливі дні

source: Day parts with modifiers
uk: Частини дня з модифікаторами

source: Longer Periods
uk: Довші періоди

source: Months
uk: Місяці

source: Seasons
uk: Пори року

source: Years
uk: Роки

source: General day parts
uk: Загальні частини дня

source: 1. Time Expressions That Break the Pattern
ru: 1. Выражения времени, которые нарушают шаблон
uk: 1. Часові вирази, що порушують шаблон

source: British: at the weekend; American: on the weekend
ru: Британский вариант: at the weekend; Американский вариант: on the weekend
uk: Британська: at the weekend; Американська: on the weekend

source: at present (not 'in present')
ru: at present (в настоящее время) (не 'in present')
uk: at present (не 'in present')

source: over the weekend (duration)
ru: over the weekend (на протяжении выходных) (длительность)
uk: over the weekend (тривалість)

source: 2. Place Expressions That Break the Pattern
ru: 2. Выражения места, которые нарушают шаблон
uk: 2. Місцеві вирази, що порушують шаблон

source: 3. When Prepositions Are Omitted
ru: 3. Когда предлоги опускаются
uk: 3. Коли прийменники опускаються

source: Before <span class="
uk: Перед <span class="

source: Prepositions: By, For, and From
ru: Предлоги: By, For, и From
uk: Прийменники: By, For та From

source: By, For, and From
ru: By, For, и From
uk: By, For та From

source: Mastering the Prepositions: By, For, and From
ru: Освоение предлогов: By, For, и From
uk: Опанування прийменників: By, For та From

source: These three prepositions are among the most frequently used in English, each serving distinct grammatical functions to express relationships of agency, purpose, and origin.
ru: Эти три предлога являются одними из наиболее часто используемых в английском языке, каждый из которых выполняет определенные грамматические функции для выражения отношений действующего лица, цели и происхождения.
uk: Ці три прийменники є одними з найбільш вживаних в англійській мові, кожен з яких виконує різні граматичні функції для вираження зв'язків дійової особи, мети та походження.

source: 1. The Preposition 'By'
ru: 1. Предлог 'By'
uk: 1. Прийменник 'By'

source: Core Meanings and Uses
ru: Основные значения и использования
uk: Основні значення та вживання

source: Agent in passive voice
uk: Дійова особа в пасивному стані

source: Indicates who performs the action
ru: Указывает, кто выполняет действие
uk: Вказує, хто виконує дію

source: Means/method
uk: Засіб/метод

source: Shows how something is done
ru: Показывает, как что-то делается
uk: Показує, як щось робиться

source: Time deadline
uk: Крайній термін часу

source: Indicates a time before which something must happen
ru: Указывает время, до которого что-то должно произойти
uk: Вказує час, до якого щось має статися

source: Proximity
uk: Близькість

source: Shows physical closeness
ru: Показывает физическую близость
uk: Показує фізичну близькість

source: Special Constructions with 'By'
ru: Особые конструкции с 'By'
uk: Спеціальні конструкції з 'By'

source: By + reflexive pronoun:
uk: By + зворотний займенник:

source: To mean 'alone'
ru: В значении 'в одиночку'
uk: У значенні 'сам'

source: By + time expressions:
uk: By + часові вирази:

source: For regular intervals
ru: Для регулярных интервалов
uk: Для регулярних інтервалів

source: By + gerund:
uk: By + герундій:

source: To describe methods
ru: Для описания методов
uk: Для опису методів

source: 2. The Preposition 'For'
ru: 2. Предлог 'For'
uk: 2. Прийменник 'For'

source: Indicates why something is done
ru: Указывает, почему что-то делается
uk: Вказує, чому щось робиться

source: Beneficiary
uk: Бенефіціар

source: Shows who benefits from an action
ru: Показывает, кто получает выгоду от действия
uk: Показує, хто отримує користь від дії

source: Expresses how long something lasts
ru: Выражает, как долго что-то длится
uk: Виражає, як довго щось триває

source: Exchange
uk: Обмін

source: Indicates a trade or substitution
ru: Указывает на торговлю или замену
uk: Вказує на торгівлю або заміну

source: Idiomatic Uses of 'For'
ru: Идиоматическое использование 'For'
uk: Ідіоматичне вживання 'For'

source: For + noun:
uk: For + іменник:

source: To express purpose
ru: Для выражения цели
uk: Для вираження мети

source: For + gerund:
uk: For + герундій:

source: After certain adjectives
ru: После определенных прилагательных
uk: Після певних прикметників

source: For + period:
uk: For + період:

source: With present perfect
ru: С Present Perfect
uk: З теперішнім доконаним часом (present perfect)

source: 3. The Preposition 'From'
ru: 3. Предлог 'From'
uk: 3. Прийменник 'From'

source: Key Applications
ru: Ключевые применения
uk: Ключове застосування

source: Shows where someone/something comes from
ru: Показывает, откуда кто-то/что-то родом
uk: Показує, звідки походить хтось/щось

source: Source
uk: Джерело

source: Indicates where something originates
ru: Указывает, откуда что-то берет начало
uk: Вказує, звідки щось походить

source: Time starting point
uk: Початкова точка часу

source: Marks when something begins
ru: Отмечает, когда что-то начинается
uk: Позначає, коли щось починається

source: Material change
uk: Зміна матеріалу

source: Shows transformation
ru: Показывает преобразование
uk: Показує перетворення

source: Special Patterns with 'From'
ru: Особые шаблоны с 'From'
uk: Спеціальні моделі з 'From'

source: For ranges
ru: Для диапазонов
uk: Для діапазонів

source: For avoidance
ru: Для избежания
uk: Для уникнення

source: For comparisons
ru: Для сравнений
uk: Для порівнянь

source: Comparative Usage: By vs. For vs. From
ru: Сравнительное использование: By vs. For vs. From
uk: Порівняльне вживання: By проти For проти From

source: These prepositions sometimes overlap in usage, leading to common confusion. Here's how to distinguish them:
ru: Эти предлоги иногда пересекаются в использовании, что приводит к распространенной путанице. Вот как их различить:
uk: Ці прийменники іноді перетинаються у вживанні, що призводить до поширеної плутанини. Ось як їх розрізняти:

source: Correct Preposition
ru: Правильный предлог
uk: Правильний прийменник

source: Creator vs. Purpose
uk: Творець проти Мети

source: Duration vs. Deadline
uk: Тривалість проти Крайнього терміну

source: Origin vs. Purpose
uk: Походження проти Мети

source: Fill in the blanks with <span class="
uk: Заповніть пропуски <span class="

source: Prepositions: Common Stranding Scenarios
ru: Предлоги: Распространенные сценарии концевого расположения
uk: Прийменники: Поширені сценарії кінцевого розташування

source: Common Stranding Scenarios
ru: Распространенные сценарии концевого расположения
uk: Поширені сценарії кінцевого розташування

source: Natural Contexts for Stranded Prepositions
ru: Естественные контексты для концевого расположения предлогов
uk: Природні контексти для кінцевого розташування прийменників

source: Preposition stranding occurs naturally in several grammatical constructions where moving the preposition would create awkward or unnatural sentences. These scenarios reflect how native speakers actually use English in daily communication.
ru: Концевое расположение предлога естественным образом происходит в нескольких грамматических конструкциях, где перемещение предлога привело бы к созданию неловких или неестественных предложений. Эти сценарии отражают то, как носители языка на самом деле используют английский в повседневном общении.
uk: Кінцеве розташування прийменників природно відбувається в декількох граматичних конструкціях, де переміщення прийменника створило б незграбні або неприродні речення. Ці сценарії відображають те, як носії мови фактично використовують англійську в щоденному спілкуванні.

source: 1. Questions with Interrogatives
ru: 1. Вопросы с вопросительными словами
uk: 1. Запитання з питальними словами

source: When It Happens
ru: Когда это происходит
uk: Коли це відбувається

source: When the question word (who, what, where, etc.) is the object of the preposition, the preposition naturally strands at the end.
ru: Когда вопросительное слово (who, what, where и т.д.) является объектом предлога, предлог естественным образом располагается в конце.
uk: Коли питальне слово (хто, що, де тощо) є доповненням прийменника, прийменник природно розташовується в кінці речення.

source: Formal Alternatives
ru: Формальные альтернативы
uk: Формальні альтернативи

source: Natural Question
ru: Естественный вопрос
uk: Природне запитання

source: Formal Version
ru: Формальная версия
uk: Формальна версія

source: 2. Relative Clauses
ru: 2. Относительные придаточные предложения
uk: 2. Відносні речення

source: Standard Usage
ru: Стандартное использование
uk: Стандартне вживання

source: In defining relative clauses, especially with 'that' or omitted relative pronouns, prepositions must strand:
ru: В определяющих относительных придаточных предложениях, особенно с 'that' или опущенными относительными местоимениями, предлоги должны располагаться в конце:
uk: У відносних реченнях, що визначають, особливо з 'that' або пропущеними відносними займенниками, прийменники повинні розташовуватися в кінці:

source: Relative Pronoun Variations
ru: Варианты относительных местоимений
uk: Варіації відносних займенників

source: With 'That'
uk: З 'That'

source: With 'Which/Whom'
uk: З 'Which/Whom'

source: 3. Passive Constructions
ru: 3. Пассивные конструкции
uk: 3. Пасивні конструкції

source: Common Passive Structures
ru: Общие пассивные структуры
uk: Поширені пасивні структури

source: When converting active sentences with prepositional verbs to passive, the preposition remains stranded:
ru: При преобразовании активных предложений с предложными глаголами в пассивные, предлог остается в конце:
uk: При перетворенні активних речень з прийменниковими дієсловами на пасивні, прийменник залишається в кінці:

source: Phrasal verbs in passive always strand:
uk: Фразові дієслова в пасиві завжди розташовуються в кінці:

source: Some formal alternatives exist but sound unnatural:
uk: Існують деякі формальні альтернативи, але вони звучать неприродно:

source: 4. Infinitive Constructions
ru: 4. Инфинитивные конструкции
uk: 4. Інфінітивні конструкції

source: Purpose and Need Expressions
ru: Выражения цели и необходимости
uk: Вирази мети та потреби

source: When infinitives modify nouns and include prepositions, stranding is natural:
ru: Когда инфинитивы определяют существительные и включают предлоги, концевое расположение естественно:
uk: Коли інфінітиви модифікують іменники та включають прийменники, кінцеве розташування є природним:

source: Why Stranding Works Here
ru: Почему концевое расположение здесь уместно
uk: Чому кінцеве розташування тут працює

source: Fronting the preposition creates awkward constructions:
uk: Винесення прийменника наперед створює незграбні конструкції:

source: The stranded version maintains the natural flow of speech
ru: Вариант с концевым расположением сохраняет естественный поток речи
uk: Варіант з кінцевим розташуванням підтримує природний потік мовлення

source: This structure is particularly common in spoken English
ru: Эта структура особенно распространена в разговорном английском
uk: Ця структура особливо поширена в розмовному англійському мовленні

source: Prepositions: Definition, Types, and Usage
ru: Предлоги: Определение, типы и использование
uk: Прийменники: Визначення, Типи та Вживання

source: Prepositions: The Connectors of Language
ru: Предлоги: Соединители языка
uk: Прийменники: З'єднувачі мови

source: Prepositions are small but mighty words that create essential relationships between different elements in a sentence. They act as bridges, showing how nouns or pronouns relate to other words in terms of space, time, direction, and more.
ru: Предлоги — это маленькие, но могущественные слова, которые создают существенные связи между различными элементами в предложении. Они действуют как мосты, показывая, как существительные или местоимения соотносятся с другими словами с точки зрения пространства, времени, направления и многого другого.
uk: Прийменники — це невеликі, але потужні слова, які створюють необхідні зв'язки між різними елементами в реченні. Вони діють як мости, показуючи, як іменники чи займенники співвідносяться з іншими словами з точки зору простору, часу, напрямку та іншого.

source: A preposition always has an object (a noun or pronoun) that it relates to another part of the sentence.
ru: У предлога всегда есть объект (существительное или местоимение), который он связывает с другой частью предложения.
uk: Прийменник завжди має доповнення (іменник або займенник), яке він пов'язує з іншою частиною речення.

source: Examples of Basic Prepositional Phrases
ru: Примеры базовых предложных фраз
uk: Приклади основних прийменникових фраз

source: Types of Prepositions
ru: Типы предлогов
uk: Типи прийменників

source: Simple Prepositions
ru: Простые предлоги
uk: Прості прийменники

source: Single-word prepositions that show basic relationships:
uk: Однослівні прийменники, які показують основні зв'язки:

source: Examples in Context
uk: Приклади в контексті

source: Formed by prefixing a preposition to another word:
uk: Утворені шляхом додавання префікса-прийменника до іншого слова:

source: Often indicate more specific spatial relationships
ru: Часто указывают более конкретные пространственные отношения
uk: Часто вказують на більш конкретні просторові зв'язки

source: Can sometimes be replaced by simple prepositions with slight meaning changes
ru: Иногда могут быть заменены простыми предлогами с небольшими изменениями в значении
uk: Іноді можуть бути замінені простими прийменниками з невеликою зміною значення

source: Phrasal Prepositions
ru: Фразовые предлоги
uk: Фразові прийменники

source: Multi-word phrases that function as single prepositions:
uk: Багатослівні фрази, які функціонують як єдині прийменники:

source: Fixed expressions that can't be altered
ru: Фиксированные выражения, которые нельзя изменить
uk: Фіксовані вирази, які не можна змінити

source: Often used to express more complex relationships
ru: Часто используются для выражения более сложных отношений
uk: Часто використовуються для вираження більш складних зв'язків

source: Function as a single grammatical unit
ru: Функционируют как единая грамматическая единица
uk: Функціонують як єдина граматична одиниця

source: Prepositional Relationships
ru: Предложные отношения
uk: Прийменникові зв'язки

source: Common Prepositions
uk: Поширені прийменники

source: Agent/Instrument
uk: Дійова особа/Інструмент

source: Special Usage Cases
ru: Особые случаи использования
uk: Особливі випадки вживання

source: Prepositions with Verbs
ru: Предлоги с глаголами
uk: Прийменники з дієсловами

source: Many English verbs require specific prepositions to complete their meaning:
ru: Многие английские глаголы требуют определенных предлогов для завершения своего значения:
uk: Багато англійських дієслів вимагають певних прийменників для завершення свого значення:

source: These combinations must be memorized
ru: Эти комбинации необходимо запомнить
uk: Ці комбінації потрібно запам'ятати

source: Changing the preposition often changes the meaning
ru: Изменение предлога часто меняет значение
uk: Зміна прийменника часто змінює значення

source: Some verbs can take different prepositions with meaning changes
ru: Некоторые глаголы могут принимать разные предлоги с изменением значения
uk: Деякі дієслова можуть приймати різні прийменники зі зміною значення

source: Ending Sentences with Prepositions
ru: Окончание предложений предлогами
uk: Закінчення речень прийменниками

source: While traditionally discouraged, ending sentences with prepositions is common and often necessary in natural English:
uk: Хоча традиційно це не заохочується, закінчення речень прийменниками є поширеним і часто необхідним у природній англійській мові:

source: When to Avoid Stranded Prepositions
ru: Когда следует избегать концевого расположения предлогов
uk: Коли слід уникати кінцевого розташування прийменників

source: In very formal writing
ru: В очень формальном письме
uk: У дуже формальному письмі

source: When it creates ambiguity
ru: Когда это создает двусмысленность
uk: Коли це створює двозначність

source: When the sentence sounds awkward
ru: Когда предложение звучит неловко
uk: Коли речення звучить незграбно

source: Common Preposition Mistakes
ru: Распространенные ошибки с предлогами
uk: Поширені помилки у вживанні прийменників

source: Confusing Similar Prepositions
uk: Плутанина схожих прийменників

source: suggests being inside boundaries
uk: натякає на перебування всередині меж

source: suggests a specific point
uk: натякає на конкретну точку

source: for specific days/dates
uk: для конкретних днів/дат

source: for clock times
uk: для часу на годиннику

source: English Prepositions
ru: Английские предлоги
uk: Англійські прийменники

source: Prepositions are one of the most challenging parts of English grammar due to their numerous uses and lack of direct translation. Master the key areas below to improve your fluency and accuracy.
ru: Предлоги являются одной из самых сложных частей английской грамматики из-за их многочисленных применений и отсутствия прямого перевода. Освойте ключевые области ниже, чтобы улучшить свою беглость и точность.
uk: Прийменники є однією з найскладніших частин англійської граматики через їх численне використання та відсутність прямого перекладу. Опануйте ключові сфери нижче, щоб покращити свою вільність та точність.

source: At, On, and In: The Time and Place Hierarchy
ru: At, On, и In: Иерархия времени и места
uk: At, On та In: Ієрархія часу та місця

source: Focuses on the most common prepositions of time and place, explaining the 'point, surface, enclosed space/period' framework.
ru: Сосредоточено на наиболее распространенных предлогах времени и места, объясняя рамки 'точки, поверхности, замкнутого пространства/периода'.
uk: Зосереджується на найпоширеніших прийменниках часу та місця, пояснюючи структуру 'точка, поверхня, закритий простір/період'.

source: By, For, and From: Agency, Purpose, and Origin
ru: By, For, и From: Действующее лицо, цель и происхождение
uk: By, For та From: Дійова особа, Мета та Походження

source: Covers prepositions used for agency (passive voice), duration/purpose, and source/starting point.
ru: Охватывает предлоги, используемые для действующего лица (пассивный залог), продолжительности/цели и источника/начальной точки.
uk: Охоплює прийменники, що використовуються для дійової особи (пасивний стан), тривалості/мети та джерела/початкової точки.

source: Preposition Stranding: Ending Sentences with Prepositions
ru: Концевое расположение предлога: Окончание предложений предлогами
uk: Кінцеве розташування прийменників: Закінчення речень прийменниками

source: Explores the natural and necessary use of stranded prepositions in questions, relative clauses, and passive voice.
ru: Исследует естественное и необходимое использование концевого расположения предлогов в вопросах, относительных придаточных предложениях и пассивном залоге.
uk: Досліджує природне та необхідне вживання прийменників у кінці речень у запитаннях, відносних реченнях та пасивному стані.

source: Definition, Types, and Usage
ru: Определение, типы и использование
uk: Визначення, Типи та Вживання

source: A foundational guide covering simple, compound, and phrasal prepositions, and their roles in creating relationships of time, place, and direction.
ru: Основополагающее руководство, охватывающее простые, составные и фразовые предлоги, а также их роли в создании отношений времени, места и направления.
uk: Основоположний посібник, що охоплює прості, складені та фразові прийменники, а також їхні ролі у створенні зв'язків часу, місця та напрямку.

source: Prepositions: Grammatical Role and Function
ru: Предлоги: Грамматическая роль и функция
uk: Прийменники: Граматична роль та функція

source: Grammatical Role
ru: Грамматическая роль
uk: Граматична роль

source: The Syntactic Functions of Prepositions
ru: Синтаксические функции предлогов
uk: Синтаксичні функції прийменників

source: Prepositions serve as crucial connectors in English grammar, establishing precise relationships between sentence elements and determining how we interpret spatial, temporal, and logical connections.
ru: Предлоги служат важнейшими соединителями в английской грамматике, устанавливая точные отношения между элементами предложения и определяя, как мы интерпретируем пространственные, временные и логические связи.
uk: Прийменники слугують вирішальними з'єднувачами в англійській граматиці, встановлюючи точні зв'язки між елементами речення та визначаючи, як ми інтерпретуємо просторові, часові та логічні зв'язки.

source: Core Grammatical Structure
ru: Основная грамматическая структура
uk: Основна граматична структура

source: The Head-Object Relationship
ru: Отношение Глава-Объект
uk: Зв'язок Головний елемент – Доповнення

source: Every prepositional phrase contains this fundamental relationship:
ru: Каждая предложная фраза содержит это фундаментальное отношение:
uk: Кожна прийменникова фраза містить цей фундаментальний зв'язок:

source: Head:
ru: Глава:
uk: Головний елемент:

source: The preposition that governs the phrase
ru: Предлог, который управляет фразой
uk: Прийменник, який керує фразою

source: Object:
ru: Объект:
uk: Доповнення:

source: The noun/pronoun that completes the preposition's meaning
ru: Существительное/местоимение, которое завершает значение предлога
uk: Іменник/займенник, який завершує значення прийменника

source: Modifiers:
ru: Модификаторы:
uk: Модифікатори:

source: Optional elements that describe the object
ru: Необязательные элементы, которые описывают объект
uk: Необов'язкові елементи, які описують доповнення

source: Structural Examples
uk: Структурні приклади

source: Syntactic Functions in Sentences
ru: Синтаксические функции в предложениях
uk: Синтаксичні функції в реченнях

source: Adjectival Function
ru: Функция прилагательного
uk: Функція прикметника
