Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Completed
ru: Прочитано
uk: Завершено

source: Mark as read
ru: Отметить как прочитанное
uk: Позначити як прочитане

source: Add to my cards
ru: Добавить в мои карточки
uk: Додати до моїх карток

source: English Word:
ru: Английское слово:
uk: Англійське Слово:

source: Translation:
ru: Перевод:
uk: Переклад:

source: Enter translation
ru: Введите перевод
uk: Введіть переклад

source: Save
ru: Сохранить
uk: Зберегти

source: Please enter translation
ru: Пожалуйста, введите перевод
uk: Будь ласка, введіть переклад

source: added to your cards!
ru: добавлено в ваши карточки!
uk: додано до ваших карток!

source: Something went wrong
ru: Что-то пошло не так
uk: Щось пішло не так

source: My texts
ru: Мои тексты
uk: Мої тексти

source: All Texts
ru: Все тексты
uk: Усі Тексти

source: Completed Texts
ru: Прочитанные тексты
uk: Завершені Тексти

source: ambiguous option: %(option)s could match %(matches)s
ru: неоднозначная опция: %(option)s может соответствовать %(matches)s
uk: неоднозначна опція: %(option)s може відповідати %(matches)s

source: Messages
ru: Сообщения
uk: Повідомлення

source: Site Maps
ru: Карты сайтов
uk: Карти Сайту

source: Static Files
ru: Статические файлы
uk: Статичні Файли

source: Syndication
ru: Синдикация
uk: Синдикація

source: That page number is not an integer
ru: Номер страницы не является целым числом
uk: Цей номер сторінки не є цілим числом

source: That page number is less than 1
ru: Номер страницы меньше 1
uk: Цей номер сторінки менше 1

source: That page contains no results
ru: На этой странице нет результатов
uk: Ця сторінка не містить результатів

source: Enter a valid value.
ru: Введите допустимое значение.
uk: Введіть дійсне значення.

source: Enter a valid domain name.
ru: Введите допустимое доменное имя.
uk: Введіть дійсне доменне ім'я.

source: Enter a valid URL.
ru: Введите допустимый URL.
uk: Введіть дійсну URL-адресу.

source: Enter a valid integer.
ru: Введите допустимое целое число.
uk: Введіть дійсне ціле число.

source: Enter a valid email address.
ru: Введите допустимый адрес электронной почты.
uk: Введіть дійсну адресу електронної пошти.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
ru: Введите допустимый «слаг», состоящий из букв, цифр, знаков подчеркивания или дефисов.
uk: Введіть дійсний «слаг», що складається з літер, цифр, символів підкреслення або дефісів.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
ru: Введите допустимый «слаг», состоящий из символов Unicode, цифр, знаков подчеркивания или дефисов.
uk: Введіть дійсний «слаг», що складається з символів Unicode (літер), цифр, символів підкреслення або дефісів.

source: Enter a valid %(protocol)s address.
ru: Введите допустимый %(protocol)s адрес.
uk: Введіть дійсну %(protocol)s адресу.

source: IPv4 or IPv6
ru: IPv4 или IPv6
uk: IPv4 або IPv6

source: Enter only digits separated by commas.
ru: Введите только цифры, разделенные запятыми.
uk: Введіть лише цифри, розділені комами.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
ru: Убедитесь, что это значение равно %(limit_value)s (сейчас %(show_value)s).
uk: Переконайтеся, що це значення дорівнює %(limit_value)s (воно дорівнює %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
ru: Убедитесь, что это значение меньше или равно %(limit_value)s.
uk: Переконайтеся, що це значення менше або дорівнює %(limit_value)s.

source: Ensure this value is greater than or equal to %(limit_value)s.
ru: Убедитесь, что это значение больше или равно %(limit_value)s.
uk: Переконайтеся, що це значення більше або дорівнює %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s.
ru: Убедитесь, что это значение кратно шагу %(limit_value)s.
uk: Переконайтеся, що це значення кратне розміру кроку %(limit_value)s.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
ru: Убедитесь, что это значение кратно шагу %(limit_value)s, начиная с %(offset)s, например %(offset)s, %(valid_value1)s, %(valid_value2)s и так далее.
uk: Переконайтеся, що це значення кратне розміру кроку %(limit_value)s, починаючи з %(offset)s, наприклад, %(offset)s, %(valid_value1)s, %(valid_value2)s тощо.

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
ru: Убедитесь, что это значение содержит не менее %(limit_value)d символа (сейчас %(show_value)d).
uk: Переконайтеся, що це значення містить принаймні %(limit_value)d символ (воно містить %(show_value)d).

source: Ensure this value has at most %(limit_value)d character (it has %(show_value)d).
ru: Убедитесь, что это значение содержит не более %(limit_value)d символа (сейчас %(show_value)d).
uk: Переконайтеся, що це значення містить щонайбільше %(limit_value)d символ (воно містить %(show_value)d).

source: Enter a number.
ru: Введите число.
uk: Введіть число.

source: Ensure that there are no more than %(max)s digit in total.
ru: Убедитесь, что всего не более %(max)s цифры.
uk: Переконайтеся, що загалом є не більше ніж %(max)s цифра.

source: Ensure that there are no more than %(max)s decimal place.
ru: Убедитесь, что не более %(max)s знака после запятой.
uk: Переконайтеся, що є не більше ніж %(max)s знак після коми.

source: Ensure that there are no more than %(max)s digit before the decimal point.
ru: Убедитесь, что перед десятичной запятой не более %(max)s цифры.
uk: Переконайтеся, що є не більше ніж %(max)s цифра перед десятковою комою.

source: File extension “%(extension)s” is not allowed. Allowed extensions are: %(allowed_extensions)s.
ru: Расширение файла «%(extension)s» не разрешено. Разрешенные расширения: %(allowed_extensions)s.
uk: Розширення файлу «%(extension)s» не дозволено. Дозволені розширення: %(allowed_extensions)s.

source: Null characters are not allowed.
ru: Нулевые символы не разрешены.
uk: Нульові символи не дозволені.

source: %(model_name)s with this %(field_labels)s already exists.
ru: %(model_name)s с этим %(field_labels)s уже существует.
uk: %(model_name)s з цим %(field_labels)s вже існує.

source: Constraint “%(name)s” is violated.
ru: Нарушено ограничение «%(name)s».
uk: Порушено обмеження «%(name)s».

source: Value %(value)r is not a valid choice.
ru: Значение %(value)r не является допустимым выбором.
uk: Значення %(value)r не є дійсним вибором.

source: This field cannot be null.
ru: Это поле не может быть пустым (null).
uk: Це поле не може бути нульовим.

source: This field cannot be blank.
ru: Это поле не может быть пустым.
uk: Це поле не може бути порожнім.

source: %(model_name)s with this %(field_label)s already exists.
ru: %(model_name)s с этим %(field_label)s уже существует.
uk: %(model_name)s з цим %(field_label)s вже існує.

source: %(field_label)s must be unique for %(date_field_label)s %(lookup_type)s.
ru: %(field_label)s должен быть уникальным для %(date_field_label)s %(lookup_type)s.
uk: %(field_label)s має бути унікальним для %(lookup_type)s %(date_field_label)s.

source: Field of type: %(field_type)s
ru: Поле типа: %(field_type)s
uk: Поле типу: %(field_type)s

source: “%(value)s” value must be either True or False.
ru: Значение «%(value)s» должно быть либо True, либо False.
uk: Значення «%(value)s» має бути або True, або False.

source: “%(value)s” value must be either True, False, or None.
ru: Значение «%(value)s» должно быть либо True, либо False, либо None.
uk: Значення «%(value)s» має бути або True, False, або None.

source: Boolean (Either True or False)
ru: Булево значение (либо True, либо False)
uk: Булеве значення (або True, або False)

source: String (up to %(max_length)s)
ru: Строка (до %(max_length)s)
uk: Рядок (до %(max_length)s)

source: String (unlimited)
ru: Строка (неограниченная)
uk: Рядок (необмежено)

source: Comma-separated integers
ru: Целые числа, разделенные запятыми
uk: Цілі числа, розділені комами

source: “%(value)s” value has an invalid date format. It must be in YYYY-MM-DD format.
ru: Значение «%(value)s» имеет недопустимый формат даты. Оно должно быть в формате ГГГГ-ММ-ДД.
uk: Значення «%(value)s» має недійсний формат дати. Воно має бути у форматі РРРР-ММ-ДД.

source: Date (without time)
ru: Дата (без времени)
uk: Дата (без часу)

source: “%(value)s” value has an invalid format. It must be in YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ] format.
ru: Значение «%(value)s» имеет недопустимый формат. Оно должно быть в формате ГГГГ-ММ-ДД ЧЧ:ММ[:сс[.уууууу]][ЧП].
uk: Значення «%(value)s» має недійсний формат. Воно має бути у форматі РРРР-ММ-ДД ГГ:ХХ[:сс[.уууууу]][ЧП].

source: “%(value)s” value has the correct format (YYYY-MM-DD) but it is an invalid date.
ru: Значение «%(value)s» имеет правильный формат (ГГГГ-ММ-ДД), но это недопустимая дата.
uk: Значення «%(value)s» має правильний формат (РРРР-ММ-ДД), але є недійсною датою.

source: “%(value)s” value has the correct format (YYYY-MM-DD HH:MM[:ss[.uuuuuu]][TZ]) but it is an invalid date/time.
ru: Значение «%(value)s» имеет правильный формат (ГГГГ-ММ-ДД ЧЧ:ММ[:сс[.уууууу]][ЧП]), но это недопустимая дата/время.
uk: Значення «%(value)s» має правильний формат (РРРР-ММ-ДД ГГ:ХХ[:сс[.уууууу]][ЧП]), але є недійсною датою/часом.

source: Date (with time)
ru: Дата (со временем)
uk: Дата (з часом)

source: “%(value)s” value must be a decimal number.
ru: Значение «%(value)s» должно быть десятичным числом.
uk: Значення «%(value)s» має бути десятковим числом.

source: Decimal number
ru: Десятичное число
uk: Десяткове число

source: “%(value)s” value has an invalid format. It must be in [DD] [[HH:]MM:]ss[.uuuuuu] format.
ru: Значение «%(value)s» имеет недопустимый формат. Оно должно быть в формате [ДД] [[ЧЧ:]ММ:]сс[.уууууу].
uk: Значення «%(value)s» має недійсний формат. Воно має бути у форматі [ДД] [[ГГ:]ХХ:]сс[.уууууу].

source: Email address
ru: Адрес электронной почты
uk: Адреса електронної пошти

source: File path
ru: Путь к файлу
uk: Шлях до файлу

source: “%(value)s” value must be a float.
ru: Значение «%(value)s» должно быть числом с плавающей запятой.
uk: Значення «%(value)s» має бути числом з плаваючою комою.

source: Floating point number
ru: Число с плавающей запятой
uk: Число з плаваючою комою

source: “%(value)s” value must be an integer.
ru: Значение «%(value)s» должно быть целым числом.
uk: Значення «%(value)s» має бути цілим числом.

source: Integer
ru: Целое число
uk: Ціле число

source: Big (8 byte) integer
ru: Большое (8-байтовое) целое число
uk: Велике (8-байтове) ціле число

source: Small integer
ru: Малое целое число
uk: Мале ціле число

source: IPv4 address
ru: Адрес IPv4
uk: Адреса IPv4

source: IP address
ru: IP-адрес
uk: IP-адреса

source: “%(value)s” value must be either None, True or False.
ru: Значение «%(value)s» должно быть либо None, либо True, либо False.
uk: Значення «%(value)s» має бути або None, True, або False.

source: Boolean (Either True, False or None)
ru: Булево значение (либо True, либо False, либо None)
uk: Булеве значення (або True, False, або None)

source: Positive big integer
ru: Положительное большое целое число
uk: Додатне велике ціле число

source: Positive integer
ru: Положительное целое число
uk: Додатне ціле число

source: Positive small integer
ru: Положительное малое целое число
uk: Додатне мале ціле число

source: Slug (up to %(max_length)s)
ru: Слаг (до %(max_length)s)
uk: Слаг (до %(max_length)s)

source: Text
ru: Текст
uk: Текст

source: “%(value)s” value has an invalid format. It must be in HH:MM[:ss[.uuuuuu]] format.
ru: Значение «%(value)s» имеет недопустимый формат. Оно должно быть в формате ЧЧ:ММ[:сс[.уууууу]].
uk: Значення «%(value)s» має недійсний формат. Воно має бути у форматі ГГ:ХХ[:сс[.уууууу]].

source: “%(value)s” value has the correct format (HH:MM[:ss[.uuuuuu]]) but it is an invalid time.
ru: Значение «%(value)s» имеет правильный формат (ЧЧ:ММ[:сс[.уууууу]]), но это недопустимое время.
uk: Значення «%(value)s» має правильний формат (ГГ:ХХ[:сс[.уууууу]]), але є недійсним часом.

source: URL
ru: URL-адрес
uk: URL-адреса

source: Raw binary data
ru: Сырые двоичные данные
uk: Необроблені бінарні дані

source: “%(value)s” is not a valid UUID.
ru: «%(value)s» не является допустимым UUID.
uk: «%(value)s» не є дійсним UUID.

source: Universally unique identifier
ru: Универсальный уникальный идентификатор
uk: Універсальний унікальний ідентифікатор

source: File
ru: Файл
uk: Файл

source: Image
ru: Изображение
uk: Зображення

source: A JSON object
ru: Объект JSON
uk: Об'єкт JSON

source: Value must be valid JSON.
ru: Значение должно быть действительным JSON.
uk: Значення має бути дійсним JSON.

source: %(model)s instance with %(field)s %(value)r is not a valid choice.
ru: Экземпляр %(model)s с %(field)s %(value)r не является допустимым выбором.
uk: Екземпляр %(model)s з %(field)s %(value)r не є дійсним вибором.

source: Foreign Key (type determined by related field)
ru: Внешний ключ (тип определяется связанным полем)
uk: Зовнішній Ключ (тип визначається пов'язаним полем)

source: One-to-one relationship
ru: Отношение «один-к-одному»
uk: Відношення один-до-одного

source: %(from)s-%(to)s relationship
ru: Отношение «%(from)s-к-%(to)s»
uk: Відношення %(from)s-до-%(to)s

source: %(from)s-%(to)s relationships
ru: Отношения «%(from)s-к-%(to)s»
uk: Відношення %(from)s-до-%(to)s

source: Many-to-many relationship
ru: Отношение «многие-ко-многим»
uk: Відношення багато-до-багатьох

source: This field is required.
ru: Это поле обязательно для заполнения.
uk: Це поле є обов'язковим.

source: Enter a whole number.
ru: Введите целое число.
uk: Введіть ціле число.

source: Enter a valid date.
ru: Введите допустимую дату.
uk: Введіть дійсну дату.

source: Enter a valid time.
ru: Введите допустимое время.
uk: Введіть дійсний час.

source: Enter a valid date/time.
ru: Введите допустимую дату/время.
uk: Введіть дійсну дату/час.

source: Enter a valid duration.
ru: Введите допустимую продолжительность.
uk: Введіть дійсну тривалість.

source: The number of days must be between {min_days} and {max_days}.
ru: Количество дней должно быть между {min_days} и {max_days}.
uk: Кількість днів має бути між {min_days} та {max_days}.

source: No file was submitted. Check the encoding type on the form.
ru: Файл не был отправлен. Проверьте тип кодировки формы.
uk: Файл не було надіслано. Перевірте тип кодування у формі.

source: No file was submitted.
ru: Файл не был отправлен.
uk: Файл не було надіслано.

source: The submitted file is empty.
ru: Отправленный файл пуст.
uk: Надісланий файл порожній.

source: Ensure this filename has at most %(max)d character (it has %(length)d).
ru: Убедитесь, что это имя файла содержит не более %(max)d символа (сейчас %(length)d).
uk: Переконайтеся, що ім'я файлу містить щонайбільше %(max)d символ (воно містить %(length)d).

source: Please either submit a file or check the clear checkbox, not both.
ru: Пожалуйста, либо отправьте файл, либо установите флажок «очистить», но не оба варианта.
uk: Будь ласка, або надішліть файл, або встановіть прапорець очищення, але не обидва.

source: Upload a valid image. The file you uploaded was either not an image or a corrupted image.
ru: Загрузите допустимое изображение. Загруженный вами файл либо не является изображением, либо является поврежденным изображением.
uk: Завантажте дійсне зображення. Файл, який ви завантажили, не є зображенням або є пошкодженим.

source: Select a valid choice. %(value)s is not one of the available choices.
ru: Выберите допустимый вариант. %(value)s не является одним из доступных вариантов.
uk: Виберіть дійсний варіант. %(value)s не є одним із доступних варіантів.

source: Enter a list of values.
ru: Введите список значений.
uk: Введіть список значень.

source: Enter a complete value.
ru: Введите полное значение.
uk: Введіть повне значення.

source: Enter a valid UUID.
ru: Введите допустимый UUID.
uk: Введіть дійсний UUID.

source: Enter a valid JSON.
ru: Введите допустимый JSON.
uk: Введіть дійсний JSON.

source: (Hidden field %(name)s) %(error)s
ru: (Скрытое поле %(name)s) %(error)s
uk: (Приховане поле %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with. Missing fields: %(field_names)s. You may need to file a bug report if the issue persists.
ru: Данные ManagementForm отсутствуют или были подделаны. Отсутствующие поля: %(field_names)s. Возможно, вам потребуется сообщить об ошибке, если проблема сохранится.
uk: Дані ManagementForm відсутні або були підроблені. Відсутні поля: %(field_names)s. Можливо, вам доведеться подати звіт про помилку, якщо проблема не зникне.

source: Please submit at most %(num)d form.
ru: Пожалуйста, отправьте не более %(num)d формы.
uk: Будь ласка, надішліть щонайбільше %(num)d форму.

source: Please submit at least %(num)d form.
ru: Пожалуйста, отправьте не менее %(num)d формы.
uk: Будь ласка, надішліть щонайменше %(num)d форму.

source: Please correct the duplicate data for %(field)s.
ru: Пожалуйста, исправьте повторяющиеся данные для %(field)s.
uk: Будь ласка, виправте повторювані дані для %(field)s.

source: Please correct the duplicate data for %(field)s, which must be unique.
ru: Пожалуйста, исправьте повторяющиеся данные для %(field)s, которые должны быть уникальными.
uk: Будь ласка, виправте повторювані дані для %(field)s, які мають бути унікальними.

source: Please correct the duplicate data for %(field_name)s which must be unique for the %(lookup)s in %(date_field)s.
ru: Пожалуйста, исправьте повторяющиеся данные для %(field_name)s, которые должны быть уникальными для %(lookup)s в %(date_field)s.
uk: Будь ласка, виправте повторювані дані для %(field_name)s, які мають бути унікальними для %(lookup)s у %(date_field)s.

source: Please correct the duplicate values below.
ru: Пожалуйста, исправьте повторяющиеся значения ниже.
uk: Будь ласка, виправте повторювані значення нижче.

source: The inline value did not match the parent instance.
ru: Встроенное значение не соответствует родительскому экземпляру.
uk: Вбудоване значення не відповідає батьківському екземпляру.

source: Select a valid choice. That choice is not one of the available choices.
ru: Выберите допустимый вариант. Этот вариант не является одним из доступных.
uk: Виберіть дійсний варіант. Цей варіант не є одним із доступних варіантів.

source: “%(pk)s” is not a valid value.
ru: «%(pk)s» не является допустимым значением.
uk: «%(pk)s» не є дійсним значенням.

source: %(datetime)s couldn’t be interpreted in time zone %(current_timezone)s; it may be ambiguous or it may not exist.
ru: Невозможно интерпретировать %(datetime)s в часовом поясе %(current_timezone)s; это может быть неоднозначно или такое время может не существовать.
uk: %(datetime)s не вдалося інтерпретувати в часовій зоні %(current_timezone)s; це може бути неоднозначно або не існувати.

source: Clear
ru: Очистить
uk: Очистити

source: Currently
ru: Текущее
uk: Наразі

source: Unknown
ru: Неизвестно
uk: Невідомо

source: yes,no,maybe
ru: да,нет,может быть
uk: так,ні,можливо

source: %(size)d byte
ru: %(size)d байт
uk: %(size)d байт

source: %s KB
ru: %s КБ
uk: %s КБ

source: %s MB
ru: %s МБ
uk: %s МБ

source: %s GB
ru: %s ГБ
uk: %s ГБ

source: %s TB
ru: %s ТБ
uk: %s ТБ

source: %s PB
ru: %s ПБ
uk: %s ПБ

source: p.m.
ru: пп
uk: п.п.

source: a.m.
ru: дп
uk: д.п.

source: PM
uk: ПМ

source: AM
uk: ДП

source: midnight
ru: полночь
uk: північ

source: noon
ru: полдень
uk: полудень

source: Monday
ru: Понедельник
uk: Понеділок

source: Tuesday
ru: Вторник
uk: Вівторок

source: Wednesday
ru: Среда
uk: Середа

source: Thursday
ru: Четверг
uk: Четвер

source: Friday
ru: Пятница
uk: П'ятниця

source: Saturday
ru: Суббота
uk: Субота

source: Sunday
ru: Воскресенье
uk: Неділя

source: Mon
ru: Пн
uk: Пон

source: Tue
ru: Вт
uk: Вто

source: Wed
ru: Ср
uk: Сер

source: Thu
ru: Чт
uk: Чет

source: Fri
ru: Пт
uk: Птн

source: Sat
ru: Сб
uk: Суб

source: Sun
ru: Вс
uk: Нед

source: January
ru: Январь
uk: Січень

source: February
ru: Февраль
uk: Лютий

source: March
ru: Март
uk: Березень

source: April
ru: Апрель
uk: Квітень

source: May
ru: Май
uk: Травень

source: June
ru: Июнь
uk: Червень

source: July
ru: Июль
uk: Липень

source: August
ru: Август
uk: Серпень

source: September
ru: Сентябрь
uk: Вересень

source: October
ru: Октябрь
uk: Жовтень

source: November
ru: Ноябрь
uk: Листопад

source: December
ru: Декабрь
uk: Грудень

source: jan
ru: янв
uk: січ

source: feb
ru: фев
uk: лют

source: mar
ru: мар
uk: бер

source: apr
ru: апр
uk: кві

source: may
ru: май
uk: тра

source: jun
ru: июн
uk: чер

source: jul
ru: июл
uk: лип

source: aug
ru: авг
uk: сер

source: sep
ru: сен
uk: вер

source: oct
ru: окт
uk: жов

source: nov
ru: ноя
uk: лис

source: dec
ru: дек
uk: гру

# abbrev. month
source: Jan.
ru: Янв.
uk: Січ.

# abbrev. month
source: Feb.
ru: Февр.
uk: Лют.

# abbrev. month
source: March
ru: Март
uk: Берез.

# abbrev. month
source: April
ru: Апр.
uk: Квіт.

# abbrev. month
source: May
ru: Май
uk: Трав.

# abbrev. month
source: June
ru: Июнь
uk: Черв.

# abbrev. month
source: July
ru: Июль
uk: Лип.

# abbrev. month
source: Aug.
ru: Авг.
uk: Серп.

# abbrev. month
source: Sept.
ru: Сент.
uk: Верес.

# abbrev. month
source: Oct.
ru: Окт.
uk: Жовт.

# abbrev. month
source: Nov.
ru: Нояб.
uk: Лист.

# abbrev. month
source: Dec.
ru: Дек.
uk: Груд.

# alt. month
source: January
ru: Января
uk: Січня

# alt. month
source: February
ru: Февраля
uk: Лютого

# alt. month
source: March
ru: Марта
uk: Березня

# alt. month
source: April
ru: Апреля
uk: Квітня

# alt. month
source: May
ru: Мая
uk: Травня

# alt. month
source: June
ru: Июня
uk: Червня

# alt. month
source: July
ru: Июля
uk: Липня

# alt. month
source: August
ru: Августа
uk: Серпня

# alt. month
source: September
ru: Сентября
uk: Вересня

# alt. month
source: October
ru: Октября
uk: Жовтня

# alt. month
source: November
ru: Ноября
uk: Листопада

# alt. month
source: December
ru: Декабря
uk: Грудня

source: This is not a valid IPv6 address.
ru: Это недопустимый адрес IPv6.
uk: Це не дійсна IPv6-адреса.

source: %(num)d year
ru: %(num)d год
uk: %(num)d рік

source: %(num)d month
ru: %(num)d месяц
uk: %(num)d місяць

source: %(num)d week
ru: %(num)d неделя
uk: %(num)d тиждень

source: %(num)d day
ru: %(num)d день
uk: %(num)d день

source: %(num)d hour
ru: %(num)d час
uk: %(num)d година

source: %(num)d minute
ru: %(num)d минута
uk: %(num)d хвилина

source: Forbidden
ru: Запрещено
uk: Заборонено

source: CSRF verification failed. Request aborted.
ru: Проверка CSRF не пройдена. Запрос отменен.
uk: Перевірка CSRF не вдалася. Запит перервано.

source: You are seeing this message because this HTTPS site requires a “Referer header” to be sent by your web browser, but none was sent. This header is required for security reasons, to ensure that your browser is not being hijacked by third parties.
ru: Вы видите это сообщение, потому что этот HTTPS-сайт требует, чтобы ваш веб-браузер отправлял заголовок “Referer”, но он не был отправлен. Этот заголовок требуется по соображениям безопасности, чтобы гарантировать, что ваш браузер не будет перехвачен третьими лицами.
uk: Ви бачите це повідомлення, оскільки цей HTTPS-сайт вимагає надсилання «Referer header» вашим веб-браузером, але жоден не був надісланий. Цей заголовок вимагається з міркувань безпеки, щоб гарантувати, що ваш браузер не захоплюється третіми сторонами.
