Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: The <span class='term-highlight'>full stop</span> (known as <span class='term-highlight'>period</span> in American English) is the most fundamental punctuation mark, primarily used to mark the end of declarative sentences that make statements or convey facts.
ru: <span class='term-highlight'>Точка</span> (известная как <span class='term-highlight'>period</span> в американском английском) является самым основным знаком препинания, который в первую очередь используется для обозначения конца повествовательных предложений, делающих утверждения или передающих факты.
uk: Крапка (відома як <span class='term-highlight'>period</span> в американській англійській) є найбільш фундаментальним знаком пунктуації, який переважно використовується для позначення кінця розповідних речень, що роблять заяви або передають факти.

source: Primary Usage in Declarative Sentences
ru: Основное использование в повествовательных предложениях
uk: Основне Використання в Розповідних Реченнях

source: Full stops are most commonly used to terminate declarative sentences that:
ru: Точки чаще всего используются для завершения повествовательных предложений, которые:
uk: Крапки найчастіше використовуються для завершення розповідних речень, які:

source: 1. Make Statements of Fact
ru: 1. Делают фактические утверждения
uk: 1. Роблять Твердження Фактів

source: 2. Express Opinions or Beliefs
ru: 2. Выражают мнения или убеждения
uk: 2. Виражають Думки або Переконання

source: 3. Provide Descriptions
ru: 3. Предоставляют описания
uk: 3. Надають Описи

source: Additional Uses of the Full Stop
ru: Дополнительные области применения точки
uk: Додаткове Використання Крапки

source: While primarily used for declarative sentences, full stops have other important functions:
ru: Хотя точки в основном используются для повествовательных предложений, у них есть и другие важные функции:
uk: Хоча крапки переважно використовуються для розповідних речень, вони мають інші важливі функції:

source: 1. In Imperative Sentences
ru: 1. В повелительных предложениях
uk: 1. У Наказових Реченнях

source: For commands or requests that don't require emphasis:
ru: Для приказов или просьб, которые не требуют выделения:
uk: Для команд або прохань, які не потребують наголосу:

source: 2. With Indirect Questions
ru: 2. С косвенными вопросами
uk: 2. З Непрямими Питаннями

source: When reporting a question rather than asking it directly:
ru: При сообщении о вопросе, а не при его непосредственном задании:
uk: Коли повідомляється про питання, а не ставиться безпосередньо:

source: 3. In Abbreviations
ru: 3. В сокращениях
uk: 3. У Скороченнях

source: Though increasingly optional in modern usage:
ru: Хотя в современном использовании это всё чаще становится необязательным:
uk: Хоча в сучасному використанні це все частіше стає необов'язковим:

source: There are specific situations where full stop usage requires special attention:
ru: Существуют специфические ситуации, когда использование точки требует особого внимания:
uk: Існують специфічні ситуації, коли використання крапки вимагає особливої уваги:

source: 1. After Titles and Headings
ru: 1. После заголовков и шапок
uk: 1. Після Заголовків та Рубрик

source: Full stops are generally omitted after titles, headings, or standalone phrases:
ru: Точки, как правило, опускаются после названий, заголовков или отдельных фраз:
uk: Крапки зазвичай опускаються після заголовків, рубрик або окремих фраз:

source: 2. In Vertical Lists
ru: 2. В вертикальных списках
uk: 2. У Вертикальних Списках

source: Full stops are typically omitted in bulleted or numbered lists unless items are complete sentences:
ru: Точки, как правило, опускаются в маркированных или нумерованных списках, если только элементы не являются законченными предложениями:
uk: Крапки зазвичай опускаються у маркованих або нумерованих списках, якщо елементи не є повними реченнями:

source: But required for complete sentences:
ru: Но обязательны для законченных предложений:
uk: Але потрібні для повних речень:

source: 3. With Other Punctuation
ru: 3. С другими знаками препинания
uk: 3. З Іншими Знаками Пунктуації

source: Full stops interact differently with other punctuation marks:
ru: Точки по-разному взаимодействуют с другими знаками препинания:
uk: Крапки по-різному взаємодіють з іншими знаками пунктуації:

source: After abbreviations at sentence end: <span class='code-highlight'>We arrived at 5 p.m<span class='punctuation-highlight'>.</span></span>
ru: После сокращений в конце предложения: <span class='code-highlight'>We arrived at 5 p.m<span class='punctuation-highlight'>.</span></span>
uk: Після скорочень в кінці речення: <span class='code-highlight'>We arrived at 5 p.m<span class='punctuation-highlight'>.</span></span> (Ми прибули о 5 вечора.)

source: With quotation marks: <span class='code-highlight'>She said, \
ru: С кавычками: <span class='code-highlight'>She said, \
uk: З лапками: <span class='code-highlight'>She said, \

source: Not used after question marks or exclamation points: <span class='code-highlight'>Did he say \
ru: Не используется после вопросительных или восклицательных знаков: <span class='code-highlight'>Did he say \
uk: Не використовуються після знаків питання або оклику: <span class='code-highlight'>Did he say \

source: Be mindful of these frequent mistakes with full stops:
ru: Помните об этих частых ошибках с точками:
uk: Зверніть увагу на ці поширені помилки з крапками:

source: Don't use commas between independent clauses (comma splice)
ru: Не используйте запятые между независимыми частями предложения (ошибка 'comma splice')
uk: Не використовуйте коми між незалежними реченнями (кома-з'єднання)

source: No space before full stop
ru: Нет пробела перед точкой
uk: Без пробілу перед крапкою

source: Question mark inside quotation marks for direct speech
ru: Вопросительный знак внутри кавычек для прямой речи
uk: Знак питання всередині лапок для прямої мови

source: Hyphen - Compound Words and More
ru: Дефис - Составные слова и прочее
uk: Дефіс - Складні Слова та Інше

source: Hyphen: Compound Words
ru: Дефис: Составные слова
uk: Дефіс: Складні Слова

source: The Hyphen: Usage and Rules
ru: Дефис: Использование и правила
uk: Дефіс: Використання та Правила

source: 1. Compound Words with Hyphens
ru: 1. Составные слова с дефисами
uk: 1. Складні Слова з Дефісами

source: A. Compound Adjectives Before Nouns
ru: A. Составные прилагательные перед существительными
uk: A. Складні Прикметники Перед Іменниками

source: Hyphens connect words that work together to modify a noun that follows them.
ru: Дефисы соединяют слова, которые работают вместе, чтобы определить следующее за ними существительное.
uk: Дефіси з'єднують слова, які працюють разом, щоб змінити іменник, що йде за ними.

source: B. Permanent Compound Words
ru: B. Постоянные составные слова
uk: B. Постійні Складні Слова

source: Some words are always hyphenated, regardless of their position in a sentence.
ru: Некоторые слова всегда пишутся через дефис, независимо от их позиции в предложении.
uk: Деякі слова завжди пишуться через дефіс, незалежно від їхнього положення в реченні.

source: 2. Numbers and Fractions
ru: 2. Числа и дроби
uk: 2. Числа та Дроби

source: A. Compound Numbers (21-99)
ru: A. Составные числительные (21-99)
uk: A. Складені Числа (21-99)

source: Hyphens are used in written-out numbers between twenty-one and ninety-nine.
ru: Дефисы используются в написанных прописью числах от двадцати одного до девяноста девяти.
uk: Дефіси використовуються в числах, написаних словами, від двадцяти одного до дев'яноста дев'яти.

source: B. Fractions
ru: B. Дроби
uk: B. Дроби

source: Hyphens connect the numerator and denominator in written fractions.
ru: Дефисы соединяют числитель и знаменатель в написанных прописью дробях.
uk: Дефіси з'єднують чисельник і знаменник у дробах, написаних словами.

source: Prefixes with proper nouns
ru: Приставки с именами собственными
uk: Префікси з власними назвами

source: Always use a hyphen
ru: Всегда используйте дефис
uk: Завжди використовуйте дефіс

source: Prefixes before capitalized words
ru: Приставки перед словами, начинающимися с заглавной буквы
uk: Префікси перед словами, написаними з великої літери

source: Prefixes with numbers
ru: Приставки с числами
uk: Префікси з числами

source: Avoiding ambiguity
ru: Избежание двусмысленности
uk: Уникнення двозначності

source: Use when meaning might be unclear
ru: Используйте, когда смысл может быть неясен
uk: Використовуйте, коли значення може бути незрозумілим

source: 3. Special Cases
ru: 3. Особые случаи
uk: 3. Особливі Випадки

source: A. Word Division
ru: A. Разделение слов
uk: A. Поділ Слів

source: Hyphens indicate where a word breaks at the end of a line.
ru: Дефисы указывают, где слово разрывается в конце строки.
uk: Дефіси вказують, де слово розривається в кінці рядка.

source: B. Avoiding Confusion
ru: B. Избежание путаницы
uk: B. Уникнення Плутанини

source: Hyphens can prevent misreading of words.
ru: Дефисы могут предотвратить неправильное прочтение слов.
uk: Дефіси можуть запобігти неправильному прочитанню слів.

source: C. Prefixes with the Same Letter
ru: C. Приставки с одинаковой буквой
uk: C. Префікси з Однією й Тією Ж Літерою

source: Hyphens are used when a prefix ends with the same letter the root word begins with.
ru: Дефисы используются, когда приставка заканчивается той же буквой, с которой начинается корневое слово.
uk: Дефіси використовуються, коли префікс закінчується на ту саму літеру, з якої починається кореневе слово.

source: Parentheses - Extra Information
ru: Скобки - Дополнительная информация
uk: Круглі Дужки - Додаткова Інформація

source: Parentheses: Extra Information
ru: Скобки: Дополнительная информация
uk: Круглі Дужки: Додаткова Інформація

source: Parentheses: Usage and Rules
ru: Скобки: Использование и правила
uk: Круглі Дужки: Використання та Правила

source: 1. Basic Usage
ru: 1. Основное использование
uk: 1. Основне Використання

source: Parentheses are used to insert explanatory or qualifying information that isn't crucial to the main point of the sentence.
ru: Скобки используются для вставки поясняющей или уточняющей информации, которая не является критически важной для основной мысли предложения.
uk: Круглі дужки використовуються для вставки пояснювальної або уточнюючої інформації, яка не є вирішальною для основної думки речення.

source: 2. Special Cases
ru: 2. Особые случаи
uk: 2. Особливі Випадки

source: A. Acronyms and Abbreviations
ru: A. Акронимы и сокращения
uk: A. Акроніми та Скорочення

source: Parentheses are used to provide the full form of an acronym when it first appears in a text.
ru: Скобки используются для предоставления полного вида акронима, когда он впервые появляется в тексте.
uk: Круглі дужки використовуються, щоб надати повну форму акроніма, коли він вперше з'являється в тексті.

source: B. In-text Citations
ru: B. Внутритекстовые цитаты
uk: B. Цитати в Тексті

source: In academic writing, parentheses are used for citations.
ru: В академическом письме скобки используются для цитирования.
uk: В академічному письмі круглі дужки використовуються для цитат.

source: C. Numbered or Lettered Lists
ru: C. Нумерованные или буквенные списки
uk: C. Нумеровані або Літеровані Списки

source: Parentheses can enclose numbers or letters in lists within sentences.
ru: Скобки могут заключать в себе числа или буквы в списках внутри предложений.
uk: Круглі дужки можуть охоплювати числа або літери у списках всередині речень.

source: Punctuation with Parentheses
ru: Пунктуация со скобками
uk: Пунктуація з Круглими Дужками

source: Complete sentence in parentheses
ru: Законченное предложение в скобках
uk: Повне речення у дужках

source: Partial sentence in parentheses
ru: Часть предложения в скобках
uk: Частина речення у дужках

source: No capitalization or period inside
ru: Нет заглавной буквы или точки внутри
uk: Без великої літери чи крапки всередині

source: Parentheses at end of sentence
ru: Скобки в конце предложения
uk: Дужки в кінці речення

source: Period goes outside the closing parenthesis
ru: Точка ставится после закрывающей скобки
uk: Крапка ставиться за межами закриваючої дужки

source: Parentheses within parentheses
ru: Скобки внутри скобок
uk: Дужки всередині дужок

source: Use square brackets for nested information
ru: Используйте квадратные скобки для вложенной информации
uk: Використовуйте квадратні дужки для вкладеної інформації

source: 3. Parentheses vs. Other Punctuation
ru: 3. Скобки против других знаков препинания
uk: 3. Круглі Дужки порівняно з Іншими Знаками Пунктуації

source: Comparison with Commas and Dashes
ru: Сравнение с запятыми и тире
uk: Порівняння з Комами та Тире

source: Parentheses, commas, and dashes can all set off non-essential information, but with different emphasis:
ru: Скобки, запятые и тире могут выделять несущественную информацию, но с разным акцентом:
uk: Круглі дужки, коми та тире можуть виділяти несуттєву інформацію, але з різним наголосом:

source: Commas:
ru: Запятые:
uk: Коми:

source: For closely related information
ru: Для тесно связанной информации
uk: Для тісно пов'язаної інформації

source: Dashes:
ru: Тире:
uk: Тире:

source: For dramatic or surprising information
ru: Для драматической или неожиданной информации
uk: Для драматичної або несподіваної інформації

source: Parentheses:
ru: Скобки:
uk: Круглі дужки:

source: For truly supplementary information
ru: Для действительно дополнительной информации
uk: Для справді додаткової інформації

source: Question Mark - Interrogative Sentences
ru: Вопросительный знак - Вопросительные предложения
uk: Знак Питання - Питальні Речення

source: Question Mark: Interrogative Sentences
ru: Вопросительный знак: Вопросительные предложения
uk: Знак Питання: Питальні Речення

source: The Question Mark in English
ru: Вопросительный знак в английском языке
uk: Знак Питання в Англійській Мові

source: Question marks are used to end direct questions that expect an answer.
ru: Вопросительные знаки используются для завершения прямых вопросов, которые ожидают ответа.
uk: Знаки питання використовуються для завершення прямих питань, які очікують на відповідь.

source: Types of Questions That Require Question Marks
ru: Типы вопросов, которые требуют вопросительных знаков
uk: Типи Питань, Які Вимагають Знака Питання

source: Yes/No Questions
ru: Вопросы типа 'да/нет'
uk: Питання з Відповіддю «Так/Ні»

source: Questions that can be answered with 'yes' or 'no'.
ru: Вопросы, на которые можно ответить 'да' или 'нет'.
uk: Питання, на які можна відповісти 'так' або 'ні'.

source: Wh- Questions
ru: Вопросы, начинающиеся с Wh-
uk: Wh- Питання

source: Questions beginning with question words (who, what, when, where, why, how).
ru: Вопросы, начинающиеся с вопросительных слов (who, what, when, where, why, how).
uk: Питання, що починаються з питальних слів (who, what, when, where, why, how).

source: Tag Questions
ru: Разделительные вопросы
uk: Розділові Питання (Tag Questions)

source: Statements turned into questions with question tags.
ru: Утверждения, превращенные в вопросы с помощью вопросительных 'хвостиков'.
uk: Твердження, перетворені на питання за допомогою розділових питальних конструкцій.

source: Indirect questions
ru: Косвенные вопросы
uk: Непрямі питання

source: No question mark - these are statements
ru: Вопросительный знак не нужен - это утверждения
uk: Без знака питання - це твердження

source: Polite requests
ru: Вежливые просьбы
uk: Ввічливі прохання

source: Period is acceptable for polite commands
ru: Точка допустима для вежливых приказов
uk: Крапка є прийнятною для ввічливих команд

source: Rhetorical questions
ru: Риторические вопросы
uk: Риторичні питання

source: Question mark required despite no answer expected
ru: Вопросительный знак требуется, несмотря на то, что ответ не ожидается
uk: Знак питання потрібен, незважаючи на те, що відповідь не очікується

source: Question within a sentence
ru: Вопрос внутри предложения
uk: Питання всередині речення

source: Question mark stays with the quoted question
ru: Вопросительный знак остается с цитируемым вопросом
uk: Знак питання залишається з цитованим питанням

source: Question Mark - Tag Questions
ru: Вопросительный знак - Разделительные вопросы
uk: Знак Питання - Розділові Питання

source: Question Mark: Tag Questions
ru: Вопросительный знак: Разделительные вопросы
uk: Знак Питання: Розділові Питання

source: Tag Questions in English
ru: Разделительные вопросы в английском языке
uk: Розділові Питання в Англійській Мові

source: Tag questions follow this pattern:
ru: Разделительные вопросы следуют этому шаблону:
uk: Розділові питання дотримуються такої схеми:

source: Statement
ru: Утверждение
uk: Твердження

source: auxiliary verb
ru: вспомогательный глагол
uk: допоміжне дієслово

source: pronoun
ru: местоимение
uk: займенник

source: Positive-Negative Pattern
ru: Схема 'Положительное-Отрицательное'
uk: Схема Позитив-Негатив

source: When the statement is positive, the tag is negative:
ru: Когда утверждение положительное, 'хвостик' отрицательный:
uk: Коли твердження позитивне, розділова частина - негативна:

source: Negative-Positive Pattern
ru: Схема 'Отрицательное-Положительное'
uk: Схема Негатив-Позитив

source: When the statement is negative, the tag is positive:
ru: Когда утверждение отрицательное, 'хвостик' положительный:
uk: Коли твердження негативне, розділова частина - позитивна:

source: Auxiliary Verb Matching
ru: Согласование вспомогательного глагола
uk: Узгодження Допоміжних Дієслів

source: The tag uses the same auxiliary verb as the main clause:
ru: В 'хвостике' используется тот же вспомогательный глагол, что и в основной части предложения:
uk: Розділова частина використовує те саме допоміжне дієслово, що й головне речення:

source: Imperatives
ru: Повелительное наклонение
uk: Наказові Речення

source: Use 'shall we' for suggestions
ru: Используйте 'shall we' для предложений
uk: Використовуйте 'shall we' для пропозицій

source: Exception to auxiliary matching
ru: Исключение из согласования вспомогательного глагола
uk: Виняток з узгодження допоміжних дієслів

source: No auxiliary
ru: Нет вспомогательного глагола
uk: Без допоміжного дієслова

source: Use 'do/does/did' when no auxiliary
ru: Используйте 'do/does/did', когда нет вспомогательного глагола
uk: Використовуйте 'do/does/did', коли немає допоміжного дієслова

source: Negative words
ru: Отрицательные слова
uk: Негативні слова

source: Words like 'never' count as negative
ru: Слова вроде 'never' считаются отрицательными
uk: Слова, як 'never', вважаються негативними

source: Intonation and Meaning
ru: Интонация и значение
uk: Інтонація та Значення

source: Quotation Marks - Direct Speech
ru: Кавычки - Прямая речь
uk: Лапки - Пряма Мова

source: Quotation Marks: Direct Speech
ru: Кавычки: Прямая речь
uk: Лапки: Пряма Мова

source: Quotation Marks for Direct Speech
ru: Кавычки для прямой речи
uk: Лапки для Прямої Мови

source: Quotation marks are used for:
ru: Кавычки используются для:
uk: Лапки використовуються для:

source: Direct speech (dialogues)
ru: Прямая речь (диалоги)
uk: Пряма мова (діалоги)

source: Quoting text verbatim
ru: Цитирование текста дословно
uk: Дослівне цитування тексту

source: Highlighting words as words
ru: Выделение слов как слов
uk: Виділення слів як слів

source: Titles of short works
ru: Названия коротких произведений
uk: Назви коротких творів

source: Basic Structure:
ru: Основная структура:
uk: Основна Структура:

source: Speaker
ru: Говорящий
uk: Мовець

source: reporting clause
ru: вводная часть
uk: слова автора

source: Direct speech
ru: Прямая речь
uk: Пряма мова

source: Detailed Rules
ru: Подробные правила
uk: Детальні Правила

source: Punctuation Placement
ru: Размещение знаков препинания
uk: Розміщення Пунктуації

source: In American English, punctuation goes inside quotes:
ru: В американском английском знаки препинания ставятся внутри кавычек:
uk: В американській англійській пунктуація ставиться всередині лапок:

source: Quotes Within Quotes
ru: Кавычки внутри кавычек
uk: Лапки Всередині Лапок

source: Alternate between double and single quotes:
ru: Чередуйте двойные и одинарные кавычки:
uk: Чергуйте подвійні та одинарні лапки:

source: Paragraph Breaks
ru: Разрывы абзацев
uk: Розриви Абзаців

source: For multi-paragraph quotes, start each paragraph with opening quotes but only close the final paragraph:
ru: Для цитат из нескольких абзацев начинайте каждый абзац с открывающих кавычек, но закрывайте только финальный абзац:
uk: Для цитат, що складаються з кількох абзаців, починайте кожен абзац відкриваючою лапкою, але закривайте лише останній абзац:

source: American vs British Usage
ru: Американское против Британского использования
uk: Американське проти Британського Використання

source: Primary Quotes
ru: Основные кавычки
uk: Основні Лапки

source: Nested Quotes
ru: Вложенные кавычки
uk: Вкладені Лапки

source: Inside quotes
ru: Внутри кавычек
uk: Всередині лапок

source: Outside unless part of quote
ru: Снаружи, если не является частью цитаты
uk: Зовні, якщо це не частина цитати

source: Add proper quotation marks and punctuation:
ru: Добавьте правильные кавычки и знаки препинания:
uk: Додайте відповідні лапки та пунктуацію:

source: Quotation Marks - Titles of Short Works
ru: Кавычки - Названия коротких произведений
uk: Лапки - Назви Коротких Творів

source: Quotation Marks: Titles
ru: Кавычки: Названия
uk: Лапки: Назви

source: Titles of Short Works in English
ru: Названия коротких произведений в английском языке
uk: Назви Коротких Творів в Англійській Мові

source: General Rule
ru: Общее правило
uk: Загальне Правило

source: Use quotation marks for titles of:
ru: Используйте кавычки для названий:
uk: Використовуйте лапки для назв:

source: Works that are part of larger wholes
ru: Произведений, которые являются частью более крупных целых
uk: Творів, які є частиною більших цілих

source: Short, self-contained creative works
ru: Коротких, самодостаточных творческих работ
uk: Коротких, самодостатніх творчих робіт

source: Works that would not typically be published alone
ru: Работ, которые обычно не публикуются отдельно
uk: Творів, які зазвичай не публікуються окремо

source: Title of Short Work
ru: Название короткого произведения
uk: Назва Короткого Твору

source: Types of Short Works
ru: Типы коротких произведений
uk: Типи Коротких Творів

source: Literary Works
ru: Литературные произведения
uk: Літературні Твори

source: Short stories, poems, essays, and articles:
ru: Короткие рассказы, стихи, эссе и статьи:
uk: Оповідання, поеми, есе та статті:

source: Musical Works
ru: Музыкальные произведения
uk: Музичні Твори

source: Songs, arias, and short musical compositions:
ru: Песни, арии и короткие музыкальные композиции:
uk: Пісні, арії та короткі музичні композиції:

source: Media Works
ru: Медиа-работы
uk: Медіа Твори

source: TV episodes, short films, and podcast episodes:
ru: Эпизоды сериалов, короткометражные фильмы и эпизоды подкастов:
uk: Епізоди телепередач, короткометражні фільми та епізоди подкастів:

source: Short Works vs Long Works
ru: Короткие произведения против длинных произведений
uk: Короткі Твори проти Довгих Творів

source: Short Works (Quotes)
ru: Короткие произведения (в кавычках)
uk: Короткі Твори (Лапки)

source: Long Works (Italics)
ru: Длинные произведения (курсив)
uk: Довгі Твори (Курсив)

source: Literature
ru: Литература
uk: Література

source: Music
ru: Музыка
uk: Музика

source: Periodicals
ru: Периодические издания
uk: Періодичні видання

source: Media
ru: Медиа
uk: ЗМІ

source: Add proper formatting to these titles:
ru: Добавьте правильное форматирование к этим названиям:
uk: Додайте правильне форматування до цих назв:

source: Semicolon - Connecting Independent Clauses
ru: Точка с запятой - Соединение независимых предложений
uk: Крапка з комою - З'єднання незалежних речень
