Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Louis the Fourteenth ruled France for 72 years
ru: Людовик Четырнадцатый правил Францией 72 года
uk: Людовик Чотирнадцятий правив Францією 72 роки

source: Special Royal Cases
ru: Особые королевские случаи
uk: Особливі королівські випадки

source: First of name:
uk: Перший з цим ім'ям:

source: Typically written without numeral but spoken as \
uk: Зазвичай пишеться без числівника, але вимовляється як \

source: Current monarchs:
uk: Поточні монархи:

source: Spoken without ordinal until their reign ends (e.g., \
uk: Вимовляється без порядкового числівника, доки їхнє правління не закінчиться (наприклад, \

source: Regnal numbers:
uk: Реєстраційні номери:

source: Reset for different countries (Elizabeth II was only first Elizabeth of UK, not Scotland)
uk: Скидаються для різних країн (Єлизавета II була лише першою Єлизаветою у Великобританії, а не в Шотландії)

source: 2. Sequential Numbering in Titles
ru: 2. Последовательная нумерация в заголовках
uk: 2. Послідовна нумерація у заголовках

source: The same ordinal convention applies to numbered items in series, though practice varies by context.
ru: Та же конвенция порядковых числительных применяется к пронумерованным элементам в серии, хотя практика варьируется в зависимости от контекста.
uk: Та сама порядкова конвенція застосовується до нумерованих елементів у серіях, хоча практика варіюється залежно від контексту.

source: Cultural and Historical References
uk: Культурні та історичні посилання

source: or
ru: или
uk: або

source: English king
uk: Англійський король

source: Modern Sequential Titles
ru: Современные последовательные названия
uk: Сучасні послідовні заголовки

source: common for movies
uk: поширено для фільмів

source: tech products
uk: технічні продукти

source: books/legal
uk: книги/юридичні

source: When Ordinals Aren't Used
ru: Когда порядковые числительные не используются
uk: Коли порядкові числівники не використовуються

source: With family names: <span class="
uk: З прізвищами: <span class="

source: For centuries: <span class="
uk: Для століть: <span class="

source: With 'Junior/Senior': No numerals used
ru: С 'Junior/Senior' (младший/старший): Числительные не используются
uk: З 'Junior/Senior': Числівники не використовуються

source: 3. Roman Numeral Conventions
ru: 3. Правила использования римских цифр
uk: 3. Умовності римських цифр

source: Understanding Roman numerals is essential for proper reading of royal and sequential titles.
ru: Понимание римских цифр необходимо для правильного чтения королевских и последовательных титулов.
uk: Розуміння римських цифр є важливим для правильного читання королівських та послідовних титулів.

source: Roman
ru: Римская цифра
uk: Римська

source: Arabic
ru: Арабская цифра
uk: Арабська

source: Ordinal
ru: Порядковое
uk: Порядковий

source: Common Errors to Avoid
ru: Распространенные ошибки, которых следует избегать
uk: Поширені помилки, яких слід уникати

source: Never read Roman numerals as cardinals: <strike>Elizabeth Two</strike> → <span class="
uk: Ніколи не читайте римські цифри як кількісні: <strike>Elizabeth Two</strike> → <span class="

source: Don't omit 'the' with ordinals in royal names
ru: Не опускайте 'the' с порядковыми числительными в королевских именах
uk: Не пропускайте 'the' з порядковими числівниками у королівських іменах

source: For popes, always use ordinal even if numeral isn't present: <span class="
uk: Для пап завжди використовуйте порядковий числівник, навіть якщо числівник відсутній: <span class="

source: In American usage, family generations often use suffixes (<span class="
uk: В американському вживанні, сімейні покоління часто використовують суфікси (<span class="

source: Royal Numeral Usage Across Languages
ru: Использование королевских числительных в разных языках
uk: Використання королівських числівників у різних мовах

source: Language
ru: Язык
uk: Мова

source: English
ru: Английский
uk: Англійська

source: Always ordinal with 'the'
uk: Завжди порядковий з 'the'

source: French
ru: Французский
uk: Французька

source: Cardinal number used
uk: Використовується кількісний числівник

source: German
ru: Немецкий
uk: Німецька

source: Ordinal with article
uk: Порядковий з артиклем

source: Numeral
ru: Числительное
uk: Числівник

source: Numerals are words that represent numbers or quantities. They can specify a definite quantity (cardinal numerals) or the order of something in a sequence (ordinal numerals).
ru: Числительные — это слова, которые обозначают числа или количества. Они могут указывать определенное количество (количественные числительные) или порядок чего-либо в последовательности (порядковые числительные).
uk: Числівники — це слова, які позначають числа або кількості. Вони можуть вказувати на певну кількість (кількісні числівники) або порядок чогось у послідовності (порядкові числівники).

source: Other Numerical Data (Phone Numbers, etc.)
ru: Другие числовые данные (номера телефонов и т. д.)
uk: Інші числові дані (номери телефонів тощо)

source: Usage with Royalty and Sequence
ru: Использование с королевскими титулами и в последовательностях
uk: Використання з королівськими особами та послідовністю

source: Common Phrases and Usage
ru: Общие фразы и использование
uk: Поширені фрази та вживання

source: As Discourse Markers
ru: Как маркеры дискурса
uk: Як дискурсивні маркери

source: Particle
ru: Частица
uk: Частка

source: Discourse Particles as Markers
ru: Дискурсивные частицы как маркеры
uk: Дискурсивні частки як маркери

source: Discourse markers are small words or phrases that organize conversation, express attitudes, and guide listeners through the flow of speech without adding substantial meaning to the content.
ru: Дискурсивные маркеры — это небольшие слова или фразы, которые организуют разговор, выражают отношение и направляют слушателей через поток речи, не добавляя существенного смысла к содержанию.
uk: Дискурсивні маркери — це невеликі слова або фрази, які організовують розмову, виражають ставлення та спрямовують слухачів через потік мовлення, не додаючи суттєвого значення до змісту.

source: Primarily used in spoken language
ru: В основном используются в устной речи
uk: Переважно використовуються в розмовній мові

source: Help structure conversation and manage turn-taking
ru: Помогают структурировать разговор и управлять сменой реплик
uk: Допомагають структурувати розмову та керувати чергою

source: Express speaker's attitude or emotional state
ru: Выражают отношение или эмоциональное состояние говорящего
uk: Виражають ставлення або емоційний стан мовця

source: Often considered informal but serve important functions
ru: Часто считаются неформальными, но выполняют важные функции
uk: Часто вважаються неформальними, але виконують важливі функції

source: Vary significantly across dialects and social groups
ru: Существенно различаются в зависимости от диалектов и социальных групп
uk: Значно відрізняються в різних діалектах і соціальних групах

source: Common Discourse Markers
ru: Распространенные дискурсивные маркеры
uk: Поширені дискурсивні маркери

source: 1. Filler Particles
ru: 1. Частицы-заполнители
uk: 1. Частки-заповнювачі

source: Maintain speech flow during pauses:
uk: Підтримують потік мовлення під час пауз:

source: 2. Attitude Markers
ru: 2. Маркеры отношения
uk: 2. Маркери ставлення

source: Express speaker's perspective:
uk: Виражають точку зору мовця:

source: 3. Response Signals
ru: 3. Сигналы ответа
uk: 3. Сигнали відповіді

source: Acknowledge or continue conversation:
uk: Визнають або продовжують розмову:

source: Functions in Conversation
ru: Функции в разговоре
uk: Функції в розмові

source: Markers
ru: Маркеры
uk: Маркери

source: Topic Shift
uk: Зміна теми

source: Agreement
uk: Згода

source: Register and Appropriateness
ru: Регистр и уместность
uk: Регістр та доречність

source: Formal contexts:
uk: Формальні контексти:

source: Limit discourse markers to more neutral ones
uk: Обмежте дискурсивні маркери більш нейтральними

source: Informal speech:
uk: Неформальне мовлення:

source: More markers and fillers are acceptable
uk: Більше маркерів та заповнювачів є прийнятними

source: Cultural variations:
uk: Культурні відмінності:

source: Some markers are region-specific
uk: Деякі маркери є регіонально специфічними

source: Overuse:
uk: Надмірне вживання:

source: Too many markers can make speech sound uncertain
uk: Забагато маркерів можуть зробити мовлення непевним

source: Inappropriate formality:
uk: Невідповідна формальність:

source: Using casual markers in formal writing
uk: Використання розмовних маркерів у формальному письмі

source: Non-native usage:
uk: Нерідне використання:

source: Misusing culturally specific markers
uk: Неправильне використання культурно специфічних маркерів

source: Back to Particles
ru: Вернуться к частицам
uk: Назад до Часток

source: Creating Infinitives
ru: Создание инфинитивов
uk: Створення інфінітивів

source: The particle <span class="
uk: Частка <span class="

source: Infinitive Structure
ru: Структура инфинитива
uk: Структура інфінітива

source: Unconjugated:
uk: Неспряжений:

source: Doesn't change for tense or subject
uk: Не змінюється за часом або суб'єктом

source: Non-finite:
uk: Неособова форма:

source: Doesn't indicate time by itself
uk: Сам по собі не вказує на час

source: Versatile:
uk: Універсальний:

source: Can function as noun, adjective, or adverb
uk: Може функціонувати як іменник, прикметник або прислівник

source: Primary Uses of Infinitives
ru: Основное использование инфинитивов
uk: Основні вживання інфінітивів

source: 1. After Certain Verbs
ru: 1. После определенных глаголов
uk: 1. Після певних дієслів

source: Many verbs require an infinitive complement:
uk: Багато дієслів вимагають інфінітивного доповнення:

source: 2. After Adjectives
ru: 2. После прилагательных
uk: 2. Після прикметників

source: Expressing purpose or reaction:
uk: Вираження мети або реакції:

source: 3. Expressing Purpose
ru: 3. Выражение цели
uk: 3. Вираження мети

source: Answering 'why' questions:
uk: Відповіді на питання 'чому':

source: Types of Infinitives
ru: Типы инфинитивов
uk: Типи інфінітивів

source: Full Infinitive
uk: Повний інфінітив

source: Bare Infinitive
uk: Голий інфінітив

source: Continuous Infinitive
uk: Тривалий інфінітив

source: Perfect Infinitive
uk: Перфектний інфінітив

source: Bare infinitives:
uk: Голі інфінітиви:

source: Used after modal verbs and some special verbs
uk: Використовуються після модальних дієслів та деяких особливих дієслів

source: Split infinitives:
uk: Розщеплені інфінітиви:

source: Adverbs between 'to' and the verb
uk: Прислівники між 'to' та дієсловом

source: 'To' as preposition:
uk: 'To' як прийменник:

source: Distinguishing from infinitive marker
uk: Відрізнення від маркера інфінітива

source: Adding 'to' after modal verbs:
uk: Додавання 'to' після модальних дієслів:

source: Confusing with gerunds:
uk: Плутанина з герундіями:

source: Omitting 'to' when required:
uk: Пропуск 'to', коли він необхідний:

source: Forming Negations
ru: Образование отрицаний
uk: Утворення заперечень

source: The negative particle <span class="
uk: Заперечна частка <span class="

source: Basic Negation Structure
ru: Базовая структура отрицания
uk: Базова структура заперечення

source: Key Rules:
ru: Ключевые правила:
uk: Основні правила:

source: Always follows an auxiliary/modal verb
ru: Всегда следует за вспомогательным/модальным глаголом
uk: Завжди стоїть після допоміжного/модального дієслова

source: Precedes the main verb in the construction
ru: Предшествует основному глаголу в конструкции
uk: Передує основному дієслову в конструкції

source: Can be contracted with the auxiliary verb in informal contexts
ru: Может быть сокращено со вспомогательным глаголом в неформальных контекстах
uk: Може скорочуватися з допоміжним дієсловом у неформальних контекстах

source: With simple present/past, requires the dummy auxiliary 'do'
ru: С простым настоящим/прошедшим временем требуется вспомогательный глагол-заменитель 'do'
uk: У простому теперішньому/минулому часі вимагає допоміжного дієслова-замінника 'do'

source: Common Negative Constructions
ru: Распространенные отрицательные конструкции
uk: Поширені заперечні конструкції

source: 1. With 'Be' Verbs
uk: 1. З дієсловами 'Be'

source: 2. With Other Auxiliaries
uk: 2. З іншими допоміжними дієсловами

source: 3. With Main Verbs (using 'do')
uk: 3. З основними дієсловами (використовуючи 'do')

source: Negative Contractions
ru: Отрицательные сокращения
uk: Заперечні скорочення

source: Auxiliary Verb
ru: Вспомогательный глагол
uk: Допоміжне дієслово

source: Full Form
ru: Полная форма
uk: Повна форма

source: Contracted Form
ru: Сокращенная форма
uk: Скорочена форма

source: Negative imperatives:
uk: Заперечні наказові форми:

source: Use 'do not' or 'don't'
uk: Використовуйте 'do not' або 'don't'

source: Non-auxiliary 'have':
uk: Недопоміжне 'have':

source: Requires 'do' support
uk: Вимагає підтримки 'do'

source: Negative infinitives:
uk: Заперечні інфінітиви:

source: 'not' comes before 'to'
uk: 'not' стоїть перед 'to'

source: Negative questions:
uk: Заперечні запитання:

source: Inversion with contraction
uk: Інверсія зі скороченням

source: Omitting auxiliary 'do':
uk: Пропуск допоміжного 'do':

source: Wrong contraction form:
uk: Неправильна форма скорочення:

source: Double negatives:
uk: Подвійні заперечення:

source: Forming Phrasal Verbs
ru: Образование фразовых глаголов
uk: Утворення фразових дієслів

source: Types of Phrasal Verbs
ru: Типы фразовых глаголов
uk: Типи фразових дієслів

source: 1. Intransitive Phrasal Verbs
ru: 1. Непереходные фразовые глаголы
uk: 1. Неперехідні фразові дієслова

source: Don't take a direct object:
uk: Не приймають прямого доповнення:

source: 2. Transitive Separable
ru: 2. Переходные разделяемые
uk: 2. Перехідні роздільні

source: Object can separate the verb and particle:
uk: Доповнення може розділяти дієслово та частку:

source: 3. Transitive Inseparable
ru: 3. Переходные неразделяемые
uk: 3. Перехідні нероздільні

source: Object must follow the entire phrasal verb:
uk: Доповнення має йти після всього фразового дієслова:

source: Common Particle Meanings
ru: Распространенные значения частиц
uk: Поширені значення часток

source: Common Meaning
ru: Общее значение
uk: Поширене значення

source: Completion or intensification
uk: Завершення або інтенсифікація

source: Revealing or distributing
uk: Розкриття або розподіл

source: Separation or departure
uk: Розділення або від'їзд

source: Continuation or attachment
uk: Продовження або приєднання

source: Usage Tips
ru: Советы по использованию
uk: Поради щодо використання

source: Word order matters:
uk: Порядок слів має значення:

source: With separable phrasal verbs, pronoun objects must go between the verb and particle
uk: З роздільними фразовими дієсловами, займенникові доповнення мають стояти між дієсловом та часткою

source: Formality:
uk: Формальність:

source: Many phrasal verbs have Latin-based equivalents that are more formal
uk: Багато фразових дієслів мають латинські еквіваленти, які є більш формальними

source: Multiple meanings:
uk: Кілька значень:

source: The same phrasal verb can have different meanings in different contexts
uk: Одне й те саме фразове дієслово може мати різні значення в різних контекстах

source: Incorrect separation:
uk: Неправильне розділення:

source: Trying to separate inseparable phrasal verbs
uk: Спроба розділити нероздільні фразові дієслова

source: Literal interpretation:
uk: Буквальна інтерпретація:

source: Taking the meaning too literally
uk: Сприйняття значення занадто буквально

source: Using phrasal verbs when a simpler verb would suffice
uk: Використання фразових дієслів, коли достатньо було б простішого дієслова

source: Key Differences and Functions
ru: Ключевые различия и функции
uk: Ключові відмінності та функції

source: Distinguishing Particles from Similar Words
ru: Отличие частиц от похожих слов
uk: Відрізнення часток від схожих слів

source: Particles often resemble adverbs and prepositions but serve distinct grammatical functions. Recognizing these differences is essential for proper sentence construction and meaning interpretation.
ru: Частицы часто напоминают наречия и предлоги, но выполняют различные грамматические функции. Распознавание этих различий необходимо для правильного построения предложений и интерпретации смысла.
uk: Частки часто нагадують прислівники та прийменники, але виконують окремі граматичні функції. Розпізнавання цих відмінностей є важливим для правильної побудови речень та тлумачення значення.

source: Core Functional Differences
ru: Основные функциональные различия
uk: Основні функціональні відмінності

source: These three word types may look identical but behave differently in sentences:
ru: Эти три типа слов могут выглядеть одинаково, но ведут себя по-разному в предложениях:
uk: Ці три типи слів можуть виглядати ідентично, але поводяться по-різному в реченнях:

source: Grammatical Unit
ru: Грамматическая единица
uk: Граматична одиниця

source: Primary Function
ru: Основная функция
uk: Основна функція

source: Forms phrasal verbs with new meanings
ru: Образует фразовые глаголы с новыми значениями
uk: Утворює фразові дієслова з новими значеннями

source: Combines with verbs to create idiomatic meanings
ru: Сочетается с глаголами для создания идиоматических значений
uk: Поєднується з дієсловами для створення ідіоматичних значень

source: Can often be separated from verb
ru: Часто может быть отделена от глагола
uk: Часто може бути відокремлена від дієслова

source: No independent meaning
ru: Не имеет независимого значения
uk: Не має самостійного значення

source: Modifies verbs, adjectives or other adverbs
ru: Модифицирует глаголы, прилагательные или другие наречия
uk: Модифікує дієслова, прикметники або інші прислівники

source: Answers how, when, where, or to what degree
ru: Отвечает на вопросы как, когда, где или в какой степени
uk: Відповідає на питання як, коли, де, або якою мірою

source: Can modify without combining
ru: Может модифицировать без объединения
uk: Може модифікувати без поєднання

source: Often movable in sentence
ru: Часто перемещается в предложении
uk: Часто є рухомою в реченні

source: Shows relationships between nouns and other words
ru: Показывает отношения между существительными и другими словами
uk: Показує зв'язки між іменниками та іншими словами

source: Always followed by its object (noun phrase)
ru: Всегда следует за своим объектом (именной фразой)
uk: Завжди супроводжується своїм доповненням (іменною фразою)

source: Forms prepositional phrases
ru: Образует предложные фразы
uk: Утворює прийменникові фрази

source: Indicates location, time, direction
ru: Указывает местоположение, время, направление
uk: Вказує місце, час, напрямок

source: Identification Strategies
ru: Стратегии идентификации
uk: Стратегії ідентифікації

source: Use these techniques to determine whether a word is functioning as a particle, adverb, or preposition:
ru: Используйте эти методы, чтобы определить, функционирует ли слово как частица, наречие или предлог:
uk: Використовуйте ці методи, щоб визначити, чи функціонує слово як частка, прислівник, чи прийменник:

source: 1. Movement Test
ru: 1. Тест на перемещение
uk: 1. Тест на рухливість

source: Particles
ru: Частицы
uk: Частки

source: can often move after the object:
uk: часто можуть переміщатися після доповнення:

source: can move to different positions:
uk: можуть переміщатися на різні позиції:

source: cannot be separated from their objects:
uk: не можуть бути відокремлені від своїх доповнень:

source: 2. Question Test
ru: 2. Тест на вопрос
uk: 2. Тест на запитання

source: Prepositional objects can become question subjects:
uk: Прийменникові доповнення можуть стати суб'єктами запитань:

source: Particle objects cannot:
uk: Доповнення часток не можуть:

source: 3. Replacement Test
ru: 3. Тест на замену
uk: 3. Тест на заміну

source: Particles can often be replaced with single-word verbs:
uk: Частки часто можуть бути замінені однослівними дієсловами:

source: Adverbs and prepositions cannot be replaced this way
ru: Наречия и предлоги не могут быть заменены таким образом
uk: Прислівники та прийменники не можуть бути замінені таким чином

source: Common Problem Words
ru: Распространенные проблемные слова
uk: Поширені проблемні слова

source: These words frequently cause confusion because they can function in multiple ways:
ru: Эти слова часто вызывают путаницу, потому что могут функционировать по-разному:
uk: Ці слова часто викликають плутанину, оскільки можуть функціонувати кількома способами:

source: Word
ru: Слово
uk: Слово

source: As Particle
ru: Как частица
uk: Як частка

source: As Adverb
ru: Как наречие
uk: Як прислівник

source: As Preposition
ru: Как предлог
uk: Як прийменник

source: as infinitive marker (particle) vs preposition:
uk: як маркер інфінітива (частка) проти прийменника:

source: Words that are only particles (e.g., <span class="
uk: Слова, які є лише частками (наприклад, <span class="

source: Practical Application Exercises
ru: Упражнения на практическое применение
uk: Вправи на практичне застосування

source: Test your understanding with these analysis challenges:
ru: Проверьте свое понимание с помощью этих задач на анализ:
uk: Перевірте своє розуміння за допомогою цих аналітичних завдань:

source: Identify the Function
uk: Визначте функцію

source: Transformation Practice
ru: Практика трансформации
uk: Практика трансформації

source: Convert these sentences by changing the word's function:
ru: Преобразуйте эти предложения, изменив функцию слова:
uk: Перетворіть ці речення, змінивши функцію слова:

source: Original (particle):
uk: Оригінал (частка):

source: Modified (preposition):
uk: Модифікований (прийменник):

source: Original (adverb):
uk: Оригінал (прислівник):

source: Modified (particle):
uk: Модифікований (частка):

source: Particles vs. Adverbs
ru: Частицы против наречий
uk: Частки проти прислівників

source: While particles and adverbs often share the same form (words like 'up', 'down', 'off'), they serve fundamentally different grammatical functions that affect sentence structure and meaning.
ru: Хотя частицы и наречия часто имеют одну и ту же форму (слова, такие как 'up', 'down', 'off'), они выполняют принципиально разные грамматические функции, которые влияют на структуру и значение предложения.
uk: Хоча частки та прислівники часто мають однакову форму (слова як 'up', 'down', 'off'), вони виконують принципово різні граматичні функції, які впливають на структуру речення та значення.

source: Changes verb meaning
ru: Изменяет значение глагола
uk: Змінює значення дієслова

source: Modifies verb/adjective/adverb
ru: Модифицирует глагол/прилагательное/наречие
uk: Модифікує дієслово/прикметник/прислівник

source: Attached to verb
ru: Присоединяется к глаголу
uk: Приєднаний до дієслова

source: Often movable
ru: Часто подвижно
uk: Часто рухомий

source: Separability
ru: Разделяемость
uk: Роздільність

source: Sometimes separable
ru: Иногда разделяемо
uk: Іноді роздільний

source: Always independent
ru: Всегда независимо
uk: Завжди незалежний

source: Creates new verb meaning
uk: Створює нове значення дієслова

source: Adds descriptive information
uk: Додає описову інформацію

source: Particle Characteristics
ru: Характеристики частицы
uk: Характеристики частки

source: Essential part of phrasal verbs
ru: Существенная часть фразовых глаголов
uk: Невід'ємна частина фразових дієслів

source: Cannot stand alone meaningfully
ru: Не может стоять отдельно со смыслом
uk: Не може стояти самостійно зі значенням

source: Position may change with objects
ru: Позиция может меняться с дополнениями
uk: Позиція може змінюватися з доповненнями

source: Adverb Characteristics
ru: Характеристики наречия
uk: Характеристики прислівника
