Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Indefinite pronouns refer to nonspecific people, places, or things. They do not refer to a particular person, place, or thing. They can be singular, plural, or both, which affects the verb they take.
ru: Неопределенные местоимения относятся к неспецифическим людям, местам или вещам. Они не указывают на конкретное лицо, место или вещь. Они могут быть в единственном, множественном или обоих числах, что влияет на глагол, который они принимают.
uk: Неозначені займенники посилаються на неспецифічних людей, місця чи речі. Вони не стосуються конкретної особи, місця чи речі. Вони можуть бути в однині, множині або обох, що впливає на дієслово, яке вони приймають.

source: 1. Common Indefinite Pronouns
ru: 1. Распространенные неопределенные местоимения
uk: 1. Поширені неозначені займенники

source: Indefinite pronouns can be grouped into several categories based on their meaning.
ru: Неопределенные местоимения можно сгруппировать в несколько категорий на основе их значения.
uk: Неозначені займенники можна згрупувати в кілька категорій на основі їхнього значення.

source: Pronouns
ru: Местоимения
uk: Займенники

source: Singular or Plural
ru: Единственное или множественное число
uk: Однина або множина

source: 2. Singular Indefinite Pronouns and Verb Agreement
ru: 2. Неопределенные местоимения в единственном числе и согласование глаголов
uk: 2. Неозначені займенники в однині та узгодження дієслів

source: Most indefinite pronouns that end in <span class="
uk: Більшість неозначених займенників, що закінчуються на <span class="

source: 3. Plural Indefinite Pronouns
ru: 3. Неопределенные местоимения во множественном числе
uk: 3. Неозначені займенники у множині

source: Pronouns like <span class="
uk: Займенники, як <span class="

source: 4. The 'Either'/'Or' Conundrum
ru: 4. Загадка 'Either'/'Or'
uk: 4. Дилема 'Either'/'Or'

source: When using pronouns that can be singular or plural, the verb's number depends on the noun or pronoun it refers to.
ru: При использовании местоимений, которые могут быть в единственном или множественном числе, число глагола зависит от существительного или местоимения, к которому оно относится.
uk: При використанні займенників, які можуть бути в однині чи множині, число дієслова залежить від іменника чи займенника, на який він посилається.

source: When the pronoun refers to a countable noun (cookies), it is plural. When it refers to an uncountable noun (cake), it is singular.
ru: Когда местоимение относится к исчисляемому существительному (cookies), оно во множественном числе. Когда оно относится к неисчисляемому существительному (cake), оно в единственном числе.
uk: Коли займенник посилається на обчислювальний іменник (cookies), він є у множині. Коли він посилається на необчислювальний іменник (cake), він є в однині.

source: Pronouns: Interrogative and Relative Pronouns
ru: Местоимения: Вопросительные и относительные местоимения
uk: Займенники: Питальні та відносні займенники

source: Interrogative and Relative Pronouns
ru: Вопросительные и относительные местоимения
uk: Питальні та відносні займенники

source: Interrogative and relative pronouns are two distinct types of pronouns that often use the same words (e.g., <span class="
uk: Питальні та відносні займенники — це два окремі типи займенників, які часто використовують одні й ті ж слова (наприклад, <span class="

source: 1. Interrogative Pronouns
ru: 1. Вопросительные местоимения
uk: 1. Питальні займенники

source: Interrogative pronouns are used to ask questions. They stand in for the noun about which the question is being asked. The most common interrogative pronouns are:
ru: Вопросительные местоимения используются для того, чтобы задавать вопросы. Они заменяют существительное, о котором задается вопрос. Наиболее распространенные вопросительные местоимения:
uk: Питальні займенники використовуються для постановки запитань. Вони замінюють іменник, про який ставиться запитання. Найпоширенішими питальними займенниками є:

source: Refers to a person (subject).
uk: Стосується особи (підмета).

source: Refers to a person (object).
uk: Стосується особи (доповнення).

source: Asks about possession.
uk: Запитує про володіння.

source: Refers to a choice between a limited number of things or people.
uk: Стосується вибору між обмеженою кількістю речей чи людей.

source: Refers to things or ideas in a general sense.
uk: Стосується речей чи ідей у загальному сенсі.

source: An interrogative pronoun always begins a question and is followed by a question mark.
ru: Вопросительное местоимение всегда начинает вопрос и сопровождается вопросительным знаком.
uk: Питальний займенник завжди починає запитання і супроводжується знаком питання.

source: 2. Relative Pronouns
ru: 2. Относительные местоимения
uk: 2. Відносні займенники

source: Relative pronouns connect a relative clause to the main clause of a sentence. They refer to a noun (the antecedent) mentioned earlier in the sentence. The most common relative pronouns are:
ru: Относительные местоимения связывают относительное придаточное предложение с главным предложением. Они относятся к существительному (антецеденту), упомянутому ранее в предложении. Наиболее распространенные относительные местоимения:
uk: Відносні займенники з'єднують відносне підрядне речення з головним реченням. Вони посилаються на іменник (антецедент), згаданий раніше в реченні. Найпоширенішими відносними займенниками є:

source: Refer to people.
uk: Стосуються людей.

source: Refers to things or animals.
uk: Стосується речей або тварин.

source: Can refer to people, things, or animals.
uk: Може стосуватися людей, речей або тварин.

source: Relative pronouns act as a bridge, linking two parts of a sentence together and making the sentence more detailed and complex.
ru: Относительные местоимения действуют как мост, связывая две части предложения вместе и делая предложение более детальным и сложным.
uk: Відносні займенники служать мостом, з'єднуючи дві частини речення та роблячи речення більш детальним і складним.

source: 3. Interrogative vs. Relative: A Simple Test
ru: 3. Вопросительные vs. Относительные: Простой тест
uk: 3. Питальні проти Відносних: Простий тест

source: The key difference is their function in a sentence. Here is a simple way to tell them apart:
ru: Ключевое различие — их функция в предложении. Вот простой способ отличить их друг от друга:
uk: Ключова відмінність полягає в їхній функції в реченні. Ось простий спосіб їх розрізнити:

source: If the pronoun is asking a question, it's <span class="
uk: Якщо займенник ставить запитання, він є <span class="

source: If the pronoun is connecting a clause and referring to a noun, it's <span class="
uk: Якщо займенник з'єднує підрядне речення і посилається на іменник, він є <span class="

source: Interrogative (asking a question)
ru: Вопросительное (задает вопрос)
uk: Питальний (ставить запитання)

source: Relative (connecting to 'person')
ru: Относительное (связывает с 'person')
uk: Відносний (з'єднує з 'person')

source: Pronouns: Personal and Possessive Pronouns
ru: Местоимения: Личные и притяжательные местоимения
uk: Займенники: Особові та присвійні займенники

source: Personal and Possessive Pronouns
ru: Личные и притяжательные местоимения
uk: Особові та присвійні займенники

source: Personal and possessive pronouns are among the most common types of pronouns. They are used to refer to people or things, and they change form based on their grammatical case, number, and gender.
ru: Личные и притяжательные местоимения являются одними из самых распространенных типов местоимений. Они используются для обозначения людей или вещей и меняют свою форму в зависимости от грамматического падежа, числа и рода.
uk: Особові та присвійні займенники є одними з найпоширеніших типів займенників. Вони використовуються для посилання на людей або речі та змінюють свою форму залежно від граматичного відмінка, числа та роду.

source: 1. Personal Pronouns
ru: 1. Личные местоимения
uk: 1. Особові займенники

source: Personal pronouns refer to the speaker, the person being spoken to, or the person/thing being spoken about. They have two cases: <span class="
uk: Особові займенники посилаються на мовця, особу, до якої говорять, або особу/річ, про яку говорять. Вони мають два відмінки: <span class="

source: First
uk: Перша

source: Second
uk: Друга

source: Third
uk: Третя

source: <strong>Examples:</strong>
ru: <strong>Примеры:</strong>
uk: <strong>Приклади:</strong>

source: 2. Possessive Pronouns
ru: 2. Притяжательные местоимения
uk: 2. Присвійні займенники

source: Possessive pronouns show ownership and stand alone as a noun. They are different from possessive adjectives (e.g., <span class="
uk: Присвійні займенники виражають володіння і стоять окремо як іменник. Вони відрізняються від присвійних прикметників (наприклад, <span class="

source: Note that <span class="
uk: Зверніть увагу, що <span class="

source: Pronouns: Pronoun-Antecedent Agreement
ru: Местоимения: Согласование местоимения с антецедентом
uk: Займенники: Узгодження займенника з антецедентом

source: Pronoun-Antecedent Agreement
ru: Согласование местоимения с антецедентом
uk: Узгодження займенника з антецедентом

source: Pronoun-antecedent agreement is a fundamental rule in English grammar. It means that a pronoun must agree with the noun or noun phrase it refers to (its <span class="
uk: Узгодження займенника з антецедентом — це фундаментальне правило в англійській граматиці. Це означає, що займенник має узгоджуватися з іменником або іменниковою фразою, на яку він посилається (його <span class="

source: 1. Agreement in Number
ru: 1. Согласование в числе
uk: 1. Узгодження в числі

source: This is the most common agreement issue. A singular antecedent requires a singular pronoun, and a plural antecedent requires a plural pronoun.
ru: Это наиболее распространенная проблема согласования. Антецедент в единственном числе требует местоимения в единственном числе, а антецедент во множественном числе требует местоимения во множественном числе.
uk: Це найпоширеніша проблема узгодження. Антецедент в однині вимагає займенника в однині, а антецедент у множині вимагає займенника у множині.

source: 2. Agreement with Indefinite Pronouns
ru: 2. Согласование с неопределенными местоимениями
uk: 2. Узгодження з неозначеними займенниками

source: This is a common source of confusion. Many indefinite pronouns (e.g., <span class="
uk: Це поширене джерело плутанини. Багато неозначених займенників (наприклад, <span class="

source: Using <span class="
uk: Використання <span class="

source: 3. Agreement with Collective Nouns
ru: 3. Согласование с собирательными существительными
uk: 3. Узгодження з збірними іменниками

source: Pronouns: Reflexive, Intensive, and Reciprocal Pronouns
ru: Местоимения: Возвратные, усилительные и взаимные местоимения
uk: Займенники: Зворотні, інтенсивні та взаємні займенники

source: Reflexive, Intensive, and Reciprocal Pronouns
ru: Возвратные, усилительные и взаимные местоимения
uk: Зворотні, інтенсивні та взаємні займенники

source: While some pronouns replace nouns, others serve more specialized functions, such as referring back to the subject or emphasizing a noun. This page covers reflexive, intensive, and reciprocal pronouns, which are often confused but serve distinct purposes.
ru: В то время как одни местоимения заменяют существительные, другие выполняют более специализированные функции, такие как отсылка к подлежащему или подчеркивание существительного. Эта страница охватывает возвратные, усилительные и взаимные местоимения, которые часто путают, но они служат разным целям.
uk: Хоча деякі займенники замінюють іменники, інші виконують більш спеціалізовані функції, наприклад, посилання назад на підмет або наголошення на іменнику. Ця сторінка охоплює зворотні, інтенсивні та взаємні займенники, які часто плутають, але вони служать різним цілям.

source: 1. Reflexive Pronouns
ru: 1. Возвратные местоимения
uk: 1. Зворотні займенники

source: A reflexive pronoun is used as a direct or indirect object when the object is the same person or thing as the subject of the verb. It 'reflects' the action back to the subject. They are formed by adding <span class="
uk: Зворотний займенник використовується як пряме або непряме доповнення, коли доповнення є тією ж особою або річчю, що й підмет дієслова. Він 'відбиває' дію назад до підмета. Вони утворюються шляхом додавання <span class="

source: <strong>Example:</strong> <span class="
uk: <strong>Приклад:</strong> <span class="

source: In this sentence, <span class="
uk: У цьому реченні <span class="

source: 2. Intensive Pronouns
ru: 2. Усилительные местоимения
uk: 2. Інтенсивні займенники

source: Intensive pronouns have the exact same form as reflexive pronouns but are used for a different purpose: to add emphasis to a noun or pronoun that is already stated. They are not essential to the meaning of the sentence and can be removed without changing the core meaning.
ru: Усилительные местоимения имеют точно такую же форму, как и возвратные местоимения, но используются для другой цели: для добавления акцента на уже упомянутое существительное или местоимение. Они не являются обязательными для смысла предложения и могут быть удалены без изменения основного значения.
uk: Інтенсивні займенники мають абсолютно ту ж форму, що й зворотні займенники, але використовуються з іншою метою: для додавання наголосу на іменник або займенник, який вже згаданий. Вони не є необхідними для значення речення і можуть бути вилучені без зміни основного значення.

source: A common error is using intensive pronouns in place of personal pronouns, for example, <strike>My friend and myself went to the store.</strike> The correct form is <span class="
uk: Поширеною помилкою є використання інтенсивних займенників замість особових займенників, наприклад, <strike>My friend and myself went to the store.</strike> Правильна форма — <span class="

source: 3. Reciprocal Pronouns
ru: 3. Взаимные местоимения
uk: 3. Взаємні займенники

source: Reciprocal pronouns are used to show that two or more people or things are performing the same action to or for each other. There are only two reciprocal pronouns in English:
ru: Взаимные местоимения используются для того, чтобы показать, что два или более человека или вещи выполняют одно и то же действие по отношению друг к другу. В английском языке есть только два взаимных местоимения:
uk: Взаємні займенники використовуються для відображення того, що дві або більше осіб чи речей виконують ту ж саму дію до або для одне одного. В англійській мові є лише два взаємні займенники:

source: Used for two people or things.
uk: Використовується для двох осіб або речей.

source: Used for more than two people or things.
uk: Використовується для більш ніж двох осіб або речей.

source: A pronoun is a word that replaces a noun or noun phrase in a sentence to avoid repetition and make the language more concise and fluid. Most pronouns change their form based on their grammatical case, number, gender, and person.
ru: Местоимение — это слово, которое заменяет существительное или именную фразу в предложении, чтобы избежать повторения и сделать язык более лаконичным и плавным. Большинство местоимений меняют свою форму в зависимости от их грамматического падежа, числа, рода и лица.
uk: Займенник — це слово, яке замінює іменник або іменникову фразу в реченні, щоб уникнути повторення і зробити мову більш лаконічною та плавною. Більшість займенників змінюють свою форму залежно від граматичного відмінка, числа, роду та особи.

source: Pronouns: Definition and Core Features
ru: Местоимения: Определение и основные особенности
uk: Займенники: Визначення та основні особливості

source: Grammatical Features (Case, Number, etc.)
ru: Грамматические особенности (падеж, число и т. д.)
uk: Граматичні особливості (відмінок, число тощо)

source: Apostrophe - Contractions
ru: Апостроф - Сокращения
uk: Апостроф - Скорочення

source: Apostrophe: Contractions
ru: Апостроф: Сокращения
uk: Апостроф: Скорочення

source: Contractions in English
ru: Сокращения в английском языке
uk: Скорочення в англійській мові

source: Basic Contractions
ru: Основные сокращения
uk: Основні скорочення

source: Common contractions combine pronouns with verbs or negate verbs:
ru: Распространенные сокращения объединяют местоимения с глаголами или отрицают глаголы:
uk: Поширені скорочення поєднують займенники з дієсловами або заперечують дієслова:

source: Word1 + Word2
ru: Слово1 + Слово2
uk: Слово1 + Слово2

source: Combined form
ru: Объединенная форма
uk: Об'єднана форма

source: contraction
uk: скорочення

source: Types of Contractions
ru: Типы сокращений
uk: Типи скорочень

source: Verb + Not
ru: Глагол + Not
uk: Дієслово + Not

source: Negating verbs with 'not':
ru: Отрицание глаголов с помощью 'not':
uk: Заперечення дієслів за допомогою 'not':

source: Pronoun + Verb
ru: Местоимение + Глагол
uk: Займенник + Дієслово

source: Combining pronouns with auxiliary verbs:
ru: Объединение местоимений со вспомогательными глаголами:
uk: Поєднання займенників із допоміжними дієсловами:

source: Question Words + Is/Has
ru: Вопросительные слова + Is/Has
uk: Питальні слова + Is/Has

source: Combining question words with verbs:
ru: Объединение вопросительных слов с глаголами:
uk: Поєднання питальних слів із дієсловами:

source: Contraction Usage Guidelines
ru: Рекомендации по использованию сокращений
uk: Рекомендації щодо використання скорочень

source: Appropriate
ru: Уместно
uk: Доречно

source: Inappropriate
ru: Неуместно
uk: Недоречно

source: Informal Writing
uk: Неформальне письмо

source: Formal Writing
uk: Формальне письмо

source: Dialogue
uk: Діалог

source: Academic Papers
ru: Академические работы
uk: Академічні роботи

source: Practice Examples
ru: Практические примеры
uk: Практичні приклади

source: Convert these to contractions where appropriate:
ru: Преобразуйте их в сокращения, где это уместно:
uk: Перетворіть це на скорочення, де це доречно:

source: informal context
ru: неформальный контекст
uk: неформальний контекст

source: Back to Punctuation
ru: Назад к пунктуации
uk: Повернутися до пунктуації

source: Apostrophe - Showing Possession
ru: Апостроф - Обозначение принадлежности
uk: Апостроф - Вираження володіння

source: Apostrophe: Possession
ru: Апостроф: Принадлежность
uk: Апостроф: Володіння

source: Possessive Apostrophes in English
ru: Притяжательный апостроф в английском языке
uk: Присвійні апострофи в англійській мові

source: The apostrophe placement changes based on whether the noun is singular or plural:
ru: Размещение апострофа меняется в зависимости от того, является ли существительное единственным или множественным числом:
uk: Розташування апострофа змінюється залежно від того, чи є іменник в однині, чи в множині:

source: Owner
ru: Владелец
uk: Власник

source: + possessed item
ru: + предмет владения
uk: + предмет володіння

source: Detailed Usage
ru: Подробное использование
uk: Детальне вживання

source: Singular Nouns
ru: Существительные в единственном числе
uk: Іменники в однині

source: Add 's to all singular nouns, including those ending in s:
ru: Добавьте 's ко всем существительным в единственном числе, включая те, которые заканчиваются на s:
uk: Додайте 's до всіх іменників в однині, включаючи ті, що закінчуються на s:

source: Regular Plural Nouns
ru: Правильные существительные во множественном числе
uk: Правильні іменники у множині

source: Add only an apostrophe after the existing s:
ru: Добавьте только апостроф после уже существующей s:
uk: Додайте лише апостроф після існуючої s:

source: Irregular Plural Nouns
ru: Неправильные существительные во множественном числе
uk: Неправильні іменники у множині

source: Add 's to plurals that don't end in s:
ru: Добавьте 's ко множественным числам, которые не заканчиваются на s:
uk: Додайте 's до множини, які не закінчуються на s:

source: Add 's only to last name
ru: Добавить 's только к последнему имени
uk: Додати 's лише до прізвища

source: Add 's to each name
ru: Добавить 's к каждому имени
uk: Додати 's до кожного імені

source: Names Ending in S
ru: Имена, заканчивающиеся на S
uk: Імена, що закінчуються на S

source: Time Expressions
ru: Выражения времени
uk: Вирази часу

source: Treat time periods as possessors
uk: Розглядати періоди часу як власників

source: <span class="term-highlight">Its vs. It\
uk: <span class="term-highlight">Its проти It\

source: <span class="term-highlight">Plural Nouns:</span> Don\
uk: <span class="term-highlight">Іменники у множині:</span> Не\

source: <span class="term-highlight">Pronouns:</span> Possessive pronouns (yours, hers, theirs) don\
uk: <span class="term-highlight">Займенники:</span> Присвійні займенники (yours, hers, theirs) не\

source: Add apostrophes where needed:
ru: Добавьте апострофы там, где это необходимо:
uk: Додайте апострофи, де це необхідно:

source: they share one car
ru: они делят одну машину
uk: вони ділять одну машину

source: Brackets - Editorial Clarification
ru: Квадратные скобки - Редакторское пояснение
uk: Квадратні дужки - Редакторське уточнення

source: Brackets: Editorial Clarification
ru: Квадратные скобки: Редакторское пояснение
uk: Квадратні дужки: Редакторське уточнення

source: Brackets: Usage and Rules
ru: Квадратные скобки: Использование и правила
uk: Квадратні дужки: Використання та правила

source: 1. Primary Uses of Brackets
ru: 1. Основное использование квадратных скобок
uk: 1. Основне використання квадратних дужок

source: A. Clarifying Quotations
ru: A. Пояснение цитат
uk: А. Уточнення цитат

source: Brackets are used to add explanatory words or phrases to quoted material when the original meaning might be unclear.
ru: Квадратные скобки используются для добавления пояснительных слов или фраз к цитируемому материалу, когда первоначальный смысл может быть неясен.
uk: Квадратні дужки використовуються для додавання пояснювальних слів або фраз до цитованого матеріалу, коли оригінальне значення може бути незрозумілим.

source: B. Indicating Errors with [sic]
ru: B. Указание на ошибки с помощью [sic]
uk: Б. Вказівка на помилки за допомогою [sic]

source: The Latin term 'sic' (meaning 'thus') is used in brackets to show that an error in a quotation appears in the original source.
ru: Латинский термин 'sic' (что означает 'так') используется в скобках, чтобы показать, что ошибка в цитате присутствует в оригинальном источнике.
uk: Латинський термін 'sic' (що означає 'так') використовується в квадратних дужках, щоб показати, що помилка в цитаті є в оригінальному джерелі.

source: 2. Specialized Uses
ru: 2. Специализированное использование
uk: 2. Спеціалізоване використання

source: A. Translations in Quotations
ru: A. Переводы в цитатах
uk: А. Переклади в цитатах

source: Brackets can provide translations of foreign words or phrases within quotes.
ru: Квадратные скобки могут содержать переводы иностранных слов или фраз внутри цитат.
uk: Квадратні дужки можуть надавати переклади іноземних слів або фраз у цитатах.

source: B. Editorial Comments
ru: B. Редакторские комментарии
uk: Б. Редакторські коментарі

source: Editors may use brackets to insert comments or notes within quoted text.
ru: Редакторы могут использовать квадратные скобки для вставки комментариев или примечаний внутри цитируемого текста.
uk: Редактори можуть використовувати квадратні дужки для вставки коментарів або приміток у цитований текст.

source: C. Nested Parentheses
ru: C. Вложенные круглые скобки
uk: В. Вкладені дужки

source: When additional information is needed within parentheses, brackets are used to avoid confusion.
ru: Когда дополнительная информация необходима внутри круглых скобок, используются квадратные скобки, чтобы избежать путаницы.
uk: Коли потрібна додаткова інформація в дужках, використовуються квадратні дужки, щоб уникнути плутанини.
