Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Standard Preposition Placement Rules
ru: Правила стандартного размещения предлогов
uk: Правила стандартного розташування прийменників

source: In standard English grammar, prepositions typically precede their objects, creating clear and unambiguous relationships between sentence elements. This placement is essential for formal writing and precise communication.
ru: В стандартной английской грамматике предлоги обычно предшествуют своим объектам, создавая четкие и однозначные отношения между элементами предложения. Такое размещение важно для формального письма и точной коммуникации.
uk: У стандартній англійській граматиці прийменники зазвичай передують своїм доповненням, створюючи чіткі та однозначні зв'язки між елементами речення. Це розташування є важливим для формального письма та точного спілкування.

source: The Fundamental Placement Rule
ru: Фундаментальное правило размещения
uk: Основне правило розташування

source: This structure creates a complete prepositional phrase that can function as an adjective or adverb in the sentence.
ru: Эта структура создает полную предложную фразу, которая может функционировать как прилагательное или наречие в предложении.
uk: Ця структура створює повну прийменникову фразу, яка може функціонувати як прикметник або прислівник у реченні.

source: Why This Matters
ru: Почему это важно
uk: Чому це важливо

source: Maintains clarity in complex sentences
ru: Поддерживает ясность в сложных предложениях
uk: Зберігає ясність у складних реченнях

source: Required in formal and academic writing
ru: Требуется в формальном и академическом письме
uk: Вимагається у формальному та академічному письмі

source: Prevents ambiguity in professional communication
ru: Предотвращает двусмысленность в профессиональном общении
uk: Запобігає двозначності у професійному спілкуванні

source: Formal vs. Informal Usage
ru: Формальное vs. Неформальное использование
uk: Формальне проти Неформального вживання

source: Standard (Formal) Placement
ru: Стандартное (формальное) размещение
uk: Стандартне (Формальне) розташування

source: In formal contexts, prepositions always precede their objects, especially in:
ru: В формальных контекстах предлоги всегда предшествуют своим объектам, особенно в:
uk: У формальних контекстах прийменники завжди передують своїм доповненням, особливо в:

source: Academic writing
ru: Академическое письмо
uk: Академічне письмо

source: Business communications
ru: Деловое общение
uk: Ділове спілкування

source: Legal documents
ru: Юридические документы
uk: Юридичні документи

source: Official reports
ru: Официальные отчеты
uk: Офіційні звіти

source: Formal Examples
uk: Формальні приклади

source: Informal Variations
ru: Неформальные вариации
uk: Неформальні варіації

source: In casual speech and writing, prepositions sometimes appear at the end of clauses:
uk: У неформальному мовленні та письмі прийменники іноді з'являються в кінці частин речення:

source: When Informal is Acceptable
ru: Когда неформальное использование приемлемо
uk: Коли неформальне є прийнятним

source: Conversational English
ru: Разговорный английский
uk: Розмовна англійська

source: Creative writing
ru: Художественная литература
uk: Творче письмо

source: Dialogue in fiction
ru: Диалоги в художественной литературе
uk: Діалог у художній літературі

source: Personal communications
ru: Личное общение
uk: Особисте спілкування

source: 1. Relative Clauses
ru: 1. Относительные придаточные предложения
uk: 1. Відносні речення

source: In relative clauses with prepositions, formal English requires the preposition to precede the relative pronoun:
ru: В относительных придаточных предложениях с предлогами формальный английский требует, чтобы предлог предшествовал относительному местоимению:
uk: У відносних реченнях з прийменниками формальна англійська вимагає, щоб прийменник передував відносному займеннику:

source: Formal
uk: Формально

source: Informal
uk: Неформально

source: 2. Questions with Prepositions
ru: 2. Вопросы с предлогами
uk: 2. Запитання з прийменниками

source: In formal questions, prepositions typically precede the question word:
ru: В формальных вопросах предлоги обычно предшествуют вопросительному слову:
uk: У формальних запитаннях прийменники зазвичай передують питальному слову:

source: In passive voice, prepositions remain with their original verbs:
uk: У пасивному стані прийменники залишаються зі своїми оригінальними дієсловами:

source: Prepositions are words that link nouns, pronouns, and phrases to other words in a sentence, establishing crucial relationships of place, time, direction, and more.
ru: Предлоги — это слова, которые связывают существительные, местоимения и фразы с другими словами в предложении, устанавливая важнейшие отношения места, времени, направления и многое другое.
uk: Прийменники — це слова, які пов'язують іменники, займенники та фрази з іншими словами в реченні, встановлюючи вирішальні зв'язки місця, часу, напрямку та іншого.

source: Definition and Forms
ru: Определение и формы
uk: Визначення та форми

source: Definition and Functions of Prepositions
ru: Определение и функции предлогов
uk: Визначення та функції прийменників

source: Understanding Prepositional Phrases
ru: Понимание предложных фраз
uk: Розуміння прийменникових фраз

source: Grammatical and Semantic Meaning
ru: Грамматическое и семантическое значение
uk: Граматичне та семантичне значення

source: The Grammatical Role of Prepositions
ru: Грамматическая роль предлогов
uk: Граматична роль прийменників

source: Semantic Relationships (Time, Place, Cause, etc.)
ru: Семантические отношения (время, место, причина и т. д.)
uk: Семантичні зв'язки (Час, Місце, Причина тощо)

source: Placement of Prepositions
ru: Размещение предлогов
uk: Розташування прийменників

source: Standard Placement (Preceding the Object)
ru: Стандартное размещение (предшествует объекту)
uk: Стандартне розташування (перед доповненням)

source: End Placement (Stranded Prepositions)
ru: Концевое размещение (Отделенные предлоги)
uk: Кінцеве розташування (кінцеві прийменники)

source: Common Scenarios for End Placement
ru: Общие сценарии для концевого размещения
uk: Поширені сценарії для кінцевого розташування

source: Usage of Common Prepositions
ru: Использование общих предлогов
uk: Вживання поширених прийменників

source: At, On, and In (Time and Place)
ru: At, On, и In (Время и Место)
uk: At, On, та In (Час і Місце)

source: Pronouns: Common Usage Pitfalls
ru: Местоимения: Распространенные ошибки использования
uk: Займенники: Поширені помилки у вживанні

source: Proper Usage of Pronouns
ru: Правильное использование местоимений
uk: Правильне вживання займенників

source: Common Usage Pitfalls
ru: Распространенные ошибки в использовании
uk: Поширені помилки у вживанні

source: Even native speakers sometimes make mistakes with pronouns. Understanding and avoiding these common pitfalls can significantly improve the clarity and correctness of your writing and speech.
ru: Даже носители языка иногда делают ошибки с местоимениями. Понимание и избегание этих распространенных ошибок может значительно улучшить ясность и правильность вашего письма и речи.
uk: Навіть носії мови іноді роблять помилки із займенниками. Розуміння та уникнення цих поширених помилок може значно покращити ясність та правильність вашого письма та мовлення.

source: 1. Mismatched Case (Subject vs. Object)
ru: 1. Несоответствие падежа (субъектный против объектного)
uk: 1. Невідповідність відмінка (Називний проти Знахідного)

source: A common error is using an objective pronoun where a subjective pronoun is required, especially in compound subjects and objects.
ru: Распространенная ошибка — использование объектного местоимения там, где требуется субъектное, особенно в составных подлежащих и дополнениях.
uk: Поширеною помилкою є використання займенника знахідного відмінка, де потрібен займенник називного відмінка, особливо в складених підметах та доповненнях.

source: The pronoun is part of the subject, so it needs to be in the subjective case (<span class="
uk: Займенник є частиною підмета, тому він повинен бути в називному відмінку (<span class="

source: The pronoun is part of the object of the preposition <span class="
uk: Займенник є частиною доповнення прийменника <span class="

source: <strong>Tip:</strong> Remove the other person's name to check if the pronoun sounds right on its own. (e.g., <span class="
uk: <strong>Порада:</strong> Приберіть ім'я іншої особи, щоб перевірити, чи правильно звучить займенник сам по собі. (наприклад, <span class="

source: 2. Ambiguous Antecedents
ru: 2. Двусмысленные антецеденты (предшествующие слова)
uk: 2. Двозначні антецеденти

source: This occurs when a pronoun could refer to more than one noun in a sentence, leading to confusion. Always make sure the antecedent is clear.
ru: Это происходит, когда местоимение может относиться к более чем одному существительному в предложении, что приводит к путанице. Всегда следите за тем, чтобы антецедент был ясен.
uk: Це трапляється, коли займенник може посилатися на більш ніж один іменник у реченні, що призводить до плутанини. Завжди переконайтеся, що антецедент є чітким.

source: 3. Using Reflexive Pronouns Incorrectly
ru: 3. Неправильное использование возвратных местоимений
uk: 3. Неправильне використання зворотних займенників

source: Reflexive pronouns should only be used to refer back to the subject or for emphasis, not as a replacement for personal pronouns.
ru: Возвратные местоимения следует использовать только для того, чтобы сослаться на подлежащее или для эмфазы (подчеркивания), а не в качестве замены личных местоимений.
uk: Зворотні займенники слід використовувати лише для посилання на підмет або для наголосу, а не як заміну особових займенників.

source: The pronoun is an object; it should be in the objective case (<span class="
uk: Займенник є доповненням; він має бути в знахідному відмінку (<span class="

source: The pronoun refers to a different person than the subject (<span class="
uk: Займенник посилається на іншу особу, ніж підмет (<span class="

source: Back to Pronouns
ru: Назад к Местоимениям
uk: Повернутися до займенників

source: Pronouns: Definition and Purpose
ru: Местоимения: Определение и назначение
uk: Займенники: Визначення та призначення

source: A pronoun is a word that replaces a noun or a noun phrase. The word that the pronoun replaces is called its <span class="
uk: Займенник — це слово, яке замінює іменник або іменникову фразу. Слово, яке замінює займенник, називається його <span class="

source: 1. The Core Purpose: Avoiding Repetition
ru: 1. Основное назначение: Избегание повторения
uk: 1. Основна мета: Уникнення повторень

source: Consider the following sentences:
ru: Рассмотрим следующие предложения:
uk: Розгляньте наступні речення:

source: In the second example, the pronoun <span class="
uk: У другому прикладі займенник <span class="

source: 2. Types of Pronouns
ru: 2. Типы местоимений
uk: 2. Типи займенників

source: There are several categories of pronouns, each with a specific function. The main types include:
ru: Существует несколько категорий местоимений, каждая из которых имеет определенную функцию. Основные типы включают:
uk: Існує кілька категорій займенників, кожна з яких має певну функцію. Основні типи включають:

source: Type of Pronoun
ru: Тип местоимения
uk: Тип займенника

source: Personal
ru: Личные
uk: Особовий

source: Refers to people or things (I, you, he, she, it, we, they).
ru: Относятся к людям или вещам (I, you, he, she, it, we, they).
uk: Стосується людей або речей (I, you, he, she, it, we, they).

source: Shows ownership (mine, yours, his, hers, its, ours, theirs).
ru: Показывают принадлежность (mine, yours, his, hers, its, ours, theirs).
uk: Показує володіння (mine, yours, his, hers, its, ours, theirs).

source: Demonstrative
ru: Указательные
uk: Вказівний

source: Points to specific things (this, that, these, those).
ru: Указывают на конкретные вещи (this, that, these, those).
uk: Вказує на конкретні речі (this, that, these, those).

source: Interrogative
ru: Вопросительные
uk: Питальний

source: Asks questions (who, whom, whose, which, what).
ru: Задают вопросы (who, whom, whose, which, what).
uk: Ставить запитання (who, whom, whose, which, what).

source: The rest of this section will cover these and other types of pronouns in more detail.
ru: Остальная часть этого раздела будет охватывать эти и другие типы местоимений более подробно.
uk: Решта цього розділу детальніше розгляне ці та інші типи займенників.

source: Pronouns: Demonstrative Pronouns
ru: Местоимения: Указательные местоимения
uk: Займенники: Вказівні займенники

source: Types of Pronouns
ru: Типы местоимений
uk: Типи займенників

source: Demonstrative Pronouns
ru: Указательные местоимения
uk: Вказівні займенники

source: Demonstrative pronouns are used to point to or identify a noun or a group of nouns. They indicate the distance of the item(s) from the speaker, in terms of both physical and temporal distance.
ru: Указательные местоимения используются для указания или идентификации существительного или группы существительных. Они указывают на расстояние предмета(ов) от говорящего, как в физическом, так и во временном отношении.
uk: Вказівні займенники використовуються, щоб вказати або ідентифікувати іменник чи групу іменників. Вони вказують на відстань предмета(ів) від мовця, як у фізичному, так і в часовому вимірі.

source: 1. The Four Demonstrative Pronouns
ru: 1. Четыре указательных местоимения
uk: 1. Чотири вказівні займенники

source: There are four main demonstrative pronouns, which are categorized by number (singular or plural) and distance (near or far).
ru: Существует четыре основных указательных местоимения, которые классифицируются по числу (единственное или множественное) и расстоянию (близко или далеко).
uk: Існує чотири основних вказівних займенники, які класифікуються за числом (однина чи множина) та відстанню (близько чи далеко).

source: Near to Speaker
ru: Близко к говорящему
uk: Близько до мовця

source: Far from Speaker
ru: Далеко от говорящего
uk: Далеко від мовця

source: These pronouns can refer to both tangible objects and abstract concepts.
ru: Эти местоимения могут относиться как к осязаемым объектам, так и к абстрактным понятиям.
uk: Ці займенники можуть стосуватися як матеріальних об'єктів, так і абстрактних понять.

source: 2. Examples of Usage
ru: 2. Примеры использования
uk: 2. Приклади вживання

source: Demonstrative pronouns stand alone in a sentence, replacing a noun. They do not modify a noun, which would make them demonstrative adjectives.
ru: Указательные местоимения стоят в предложении отдельно, заменяя существительное. Они не определяют существительное, что сделало бы их указательными прилагательными.
uk: Вказівні займенники стоять окремо в реченні, замінюючи іменник. Вони не модифікують іменник, що зробило б їх вказівними прикметниками.

source: used for a singular noun that is near.
uk: використовується для іменника в однині, який є близько.

source: used for a singular noun that is far.
uk: використовується для іменника в однині, який є далеко.

source: used for plural nouns that are near.
uk: використовується для іменників у множині, які є близько.

source: used for plural nouns that are far.
uk: використовується для іменників у множині, які є далеко.

source: 3. Demonstrative Pronouns vs. Adjectives
ru: 3. Указательные местоимения против прилагательных
uk: 3. Вказівні займенники проти прикметників

source: It's important to distinguish between demonstrative pronouns and demonstrative adjectives. The word is the same, but its function in the sentence is different.
ru: Важно различать указательные местоимения и указательные прилагательные. Слово одно и то же, но его функция в предложении отличается.
uk: Важливо розрізняти вказівні займенники та вказівні прикметники. Слово однакове, але його функція в реченні різна.

source: replaces a noun. The word stands alone.
ru: заменяет существительное. Слово стоит отдельно.
uk: замінює іменник. Слово стоїть окремо.

source: modifies a noun. The word is followed by a noun.
ru: определяет существительное. За словом следует существительное.
uk: модифікує іменник. Після слова йде іменник.

source: In the first example, <span class="
uk: У першому прикладі <span class="

source: Pronouns: Grammatical Features (Case, Number, etc.)
ru: Местоимения: Грамматические особенности (падеж, число и т. д.)
uk: Займенники: Граматичні особливості (відмінок, число тощо)

source: Grammatical Features
ru: Грамматические особенности
uk: Граматичні особливості

source: Pronouns in English are not static words; they change their form based on several grammatical features. The most important of these are person, number, gender, and case. Understanding these features is essential for using pronouns correctly.
ru: Местоимения в английском языке — не статичные слова; они меняют свою форму на основе нескольких грамматических особенностей. Наиболее важными из них являются лицо, число, род и падеж. Понимание этих особенностей необходимо для правильного использования местоимений.
uk: Займенники в англійській мові не є статичними словами; вони змінюють свою форму на основі кількох граматичних особливостей. Найважливіші з них — особа, число, рід та відмінок. Розуміння цих особливостей є важливим для правильного використання займенників.

source: 1. Case: Subject vs. Object
ru: 1. Падеж: Субъектный против объектного
uk: 1. Відмінок: Називний проти Знахідного

source: Case refers to the function of the pronoun in a sentence. There are two main cases for personal pronouns:
ru: Падеж относится к функции местоимения в предложении. Существует два основных падежа для личных местоимений:
uk: Відмінок стосується функції займенника в реченні. Існує два основних відмінки для особових займенників:

source: Subjective Case
uk: Називний відмінок

source: Used when the pronoun is the subject of the sentence (the one performing the action).
uk: Використовується, коли займенник є підметом речення (той, хто виконує дію).

source: Objective Case
uk: Знахідний відмінок

source: Used when the pronoun is the object of the sentence (the one receiving the action).
uk: Використовується, коли займенник є доповненням речення (той, хто приймає дію).

source: Subjective
ru: Субъектный
uk: Називний

source: Objective
ru: Объектный
uk: Знахідний

source: 2. Number: Singular vs. Plural
ru: 2. Число: Единственное против множественного
uk: 2. Число: Однина проти Множини

source: Pronouns can be either singular (referring to one) or plural (referring to more than one). It's crucial to match the pronoun's number to its antecedent.
ru: Местоимения могут быть как в единственном числе (относящиеся к одному), так и во множественном числе (относящиеся к более чем одному). Крайне важно согласовать число местоимения с его антецедентом.
uk: Займенники можуть бути або в однині (посилаючись на один), або в множині (посилаючись на більше одного). Важливо узгодити число займенника з його антецедентом.

source: 3. Person: First, Second, and Third
ru: 3. Лицо: Первое, второе и третье
uk: 3. Особа: Перша, Друга та Третя

source: Person indicates who is speaking, who is being spoken to, or who is being spoken about.
ru: Лицо указывает на то, кто говорит, к кому обращаются или о ком говорят.
uk: Особа вказує, хто говорить, до кого говорять, або про кого говорять.

source: First Person
ru: Первое лицо
uk: Перша особа

source: The speaker (I, we).
uk: Мовець (I, we).

source: Second Person
ru: Второе лицо
uk: Друга особа

source: The person or people being spoken to (you).
uk: Особа або люди, до яких говорять (you).

source: Third Person
ru: Третье лицо
uk: Третя особа

source: The person or thing being spoken about (he, she, it, they).
uk: Особа або річ, про яку говорять (he, she, it, they).

source: 4. Gender
ru: 4. Род
uk: 4. Рід

source: Gender-specific pronouns are used for the third person singular.
ru: Местоимения, указывающие на род, используются для третьего лица единственного числа.
uk: Гендерно-специфічні займенники використовуються для третьої особи однини.

source: Masculine gender.
uk: Чоловічий рід.

source: Feminine gender.
uk: Жіночий рід.

source: Neutral or inanimate objects.
uk: Нейтральні або неживі предмети.

source: Pronouns: Grammatical Functions in a Sentence
ru: Местоимения: Грамматические функции в предложении
uk: Займенники: Граматичні функції в реченні

source: Grammatical Functions in a Sentence
ru: Грамматические функции в предложении
uk: Граматичні функції в реченні

source: Grammatical Functions of Pronouns
ru: Грамматические функции местоимений
uk: Граматичні функції займенників

source: Pronouns replace nouns, but they do more than just stand in. They must also take on the same grammatical function as the noun they replace. This function, which is often tied to the pronoun's case, determines its role in the sentence.
ru: Местоимения заменяют существительные, но они делают больше, чем просто подменяют их. Они также должны принимать ту же грамматическую функцию, что и существительное, которое они заменяют. Эта функция, которая часто связана с падежом местоимения, определяет его роль в предложении.
uk: Займенники замінюють іменники, але вони роблять більше, ніж просто стоять на місці. Вони також повинні приймати ту ж саму граматичну функцію, що й іменник, який вони замінюють. Ця функція, яка часто пов'язана з відмінком займенника, визначає його роль у реченні.

source: 1. Subject of a Sentence
ru: 1. Подлежащее предложения
uk: 1. Підмет речення

source: The most common function is as the subject, the noun or pronoun that performs the action of the verb. In this role, a pronoun must be in the subjective case (e.g., <span class="
uk: Найпоширеніша функція — це підмет, іменник або займенник, який виконує дію дієслова. У цій ролі займенник повинен бути в називному відмінку (наприклад, <span class="

source: In these examples, <span class="
uk: У цих прикладах <span class="

source: 2. Direct Object of a Verb
ru: 2. Прямое дополнение глагола
uk: 2. Пряме доповнення дієслова

source: A pronoun can also be the direct object, receiving the action of the verb. In this case, it must be in the objective case (e.g., <span class="
uk: Займенник також може бути прямим доповненням, приймаючи дію дієслова. У цьому випадку він повинен бути в знахідному відмінку (наприклад, <span class="

source: Here, <span class="
uk: Тут <span class="

source: 3. Object of a Preposition
ru: 3. Дополнение предлога
uk: 3. Доповнення прийменника

source: Pronouns that follow prepositions (e.g., <span class="
uk: Займенники, які йдуть після прийменників (наприклад, <span class="

source: 4. Subject Complement
ru: 4. Именная часть составного сказуемого
uk: 4. Іменна частина присудка

source: A subject complement follows a linking verb (e.g., <span class="
uk: Іменна частина присудка йде за дієсловом-зв'язкою (наприклад, <span class="

source: For formal writing and speaking, it is best to use the subjective case in this context.
ru: Для формального письма и речи лучше всего использовать субъектный падеж в этом контексте.
uk: Для формального письма та мовлення найкраще використовувати називний відмінок у цьому контексті.

source: Pronouns: Indefinite Pronouns
ru: Местоимения: Неопределенные местоимения
uk: Займенники: Неозначені займенники

source: Indefinite Pronouns
ru: Неопределенные местоимения
uk: Неозначені займенники
