Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Fractions in Measurements
ru: Дроби в измерениях
uk: Дроби у вимірюваннях

source: With units of measurement:
ru: С единицами измерения:
uk: З одиницями вимірювання:

source: In time expressions:
ru: В выражениях времени:
uk: У виразах часу:

source: 3. Grammatical Usage
ru: 3. Грамматическое использование
uk: 3. Граматичне використання

source: Hyphenation Rules
ru: Правила использования дефиса
uk: Правила використання дефіса

source: Hyphenate when modifying a noun
ru: Ставьте дефис при определении существительного
uk: Використовуйте дефіс, коли модифікуєте іменник

source: No hyphen when standalone
ru: Без дефиса, когда используется самостоятельно
uk: Без дефіса, коли стоїть окремо

source: Mixed numbers
ru: Смешанные числа
uk: Мішані числа

source: No space between whole number and fraction
ru: Нет пробела между целым числом и дробью
uk: Без пробілу між цілим числом та дробом

source: Singular verb when referring to a single quantity:
ru: Единственное число глагола при ссылке на одно количество:
uk: Дієслово в однині, коли йдеться про єдину кількість:

source: Plural verb when referring to multiple items:
ru: Множественное число глагола при ссылке на несколько предметов:
uk: Дієслово в множині, коли йдеться про кілька предметів:

source: Incorrect denominator forms
ru: Неправильные формы знаменателя
uk: Неправильні форми знаменника

source: Misusing 'half'
ru: Неправильное использование 'half' (половина)
uk: Неправильне використання 'half'

source: Wrong hyphenation
ru: Неправильное использование дефиса
uk: Неправильне використання дефіса

source: Incorrect verb agreement
ru: Неправильное согласование глагола
uk: Неправильне узгодження дієслова

source: Cardinal Numerals: Spelling and Hyphenation
ru: Количественные числительные: Написание и использование дефиса
uk: Кількісні числівники: Написання та використання дефіса

source: Spelling and Hyphenation
ru: Написание и использование дефиса
uk: Написання та використання дефіса

source: Proper spelling and hyphenation of numbers are essential for clear communication in formal writing, academic papers, and professional documents. While digits are often acceptable, knowing when and how to spell out numbers is crucial.
ru: Правильное написание и использование дефисов в числительных необходимы для четкого общения в официальном письме, академических работах и профессиональных документах. Хотя цифры часто приемлемы, крайне важно знать, когда и как писать числа прописью.
uk: Правильне написання та використання дефіса в числах є важливим для чіткого спілкування у формальному письмі, академічних роботах та професійних документах. Хоча цифри часто прийнятні, знання того, коли і як писати числа словами, є вирішальним.

source: When to Spell Out Numbers
ru: Когда писать числа прописью
uk: Коли писати числа словами

source: In formal writing and literature
ru: В официальном письме и литературе
uk: У формальному письмі та літературі

source: At the beginning of sentences
ru: В начале предложений
uk: На початку речень

source: For round numbers (hundred, thousand)
ru: Для круглых чисел (сотни, тысячи)
uk: Для круглих чисел (hundred, thousand)

source: In dialogue and quoted speech
ru: В диалоге и цитируемой речи
uk: У діалогах та цитованій мові

source: When numbers are part of proper names
ru: Когда числа являются частью имен собственных
uk: Коли числа є частиною власних назв

source: 1. General Spelling Rules
ru: 1. Общие правила написания
uk: 1. Загальні правила написання

source: Style Guide
ru: Руководство по стилю
uk: Стилістичний довідник

source: General
ru: Общее
uk: Загальний

source: Spell out 0-9, use digits for 10+
ru: Пишите прописью 0-9, используйте цифры для 10+
uk: Пишіть словами 0-9, використовуйте цифри для 10+

source: Spell out 0-99, digits for 100+
ru: Пишите прописью 0-99, используйте цифры для 100+
uk: Пишіть словами 0-99, використовуйте цифри для 100+

source: Spell out 0-9, digits for 10+ (except at sentence start)
ru: Пишите прописью 0-9, используйте цифры для 10+ (кроме начала предложения)
uk: Пишіть словами 0-9, використовуйте цифри для 10+ (крім початку речення)

source: Scientific
ru: Научный стиль
uk: Науковий

source: Use digits for all exact measurements
ru: Используйте цифры для всех точных измерений
uk: Використовуйте цифри для всіх точних вимірювань

source: Special Cases for Spelling Out Numbers
ru: Особые случаи написания чисел прописью
uk: Особливі випадки написання чисел словами

source: Always spell out numbers at sentence beginnings
ru: Всегда пишите числа прописью в начале предложений
uk: Завжди пишіть числа словами на початку речень

source: Spell out indefinite numbers
ru: Пишите прописью неопределенные числа
uk: Пишіть словами невизначені числа

source: Spell out numbers in proper names
ru: Пишите прописью числа в именах собственных
uk: Пишіть числа словами у власних назвах

source: 2. Hyphenation Rules
ru: 2. Правила использования дефиса
uk: 2. Правила використання дефіса

source: When to Use Hyphens
ru: Когда использовать дефисы
uk: Коли використовувати дефіси

source: Compound numbers 21-99
ru: Составные числа 21-99
uk: Складені числа 21-99

source: Fractions (when written out)
ru: Дроби (когда написаны прописью)
uk: Дроби (коли пишуться словами)

source: Age descriptions
ru: Описания возраста
uk: Описи віку

source: Combined numbers with nouns
ru: Сочетания чисел с существительными
uk: Поєднання чисел з іменниками

source: Hyphenate 21-99
ru: Используйте дефис для 21-99
uk: Використовуйте дефіс для 21-99

source: No hyphens in hundreds
ru: Нет дефисов в сотнях
uk: Без дефісів у сотнях

source: Hyphenate number-noun combinations
ru: Используйте дефис для сочетаний число-существительное
uk: Використовуйте дефіс у комбінаціях число-іменник

source: 3. Punctuation with Numbers
ru: 3. Пунктуация с числами
uk: 3. Пунктуація з числами

source: Commas in Large Numbers
ru: Запятые в больших числах
uk: Коми у великих числах

source: Use commas to separate thousands:
ru: Используйте запятые для разделения тысяч:
uk: Використовуйте коми для відокремлення тисяч:

source: No commas in years:
ru: Нет запятых в годах:
uk: Без ком у роках:

source: No commas in page numbers or addresses:
ru: Нет запятых в номерах страниц или адресах:
uk: Без ком у номерах сторінок чи адресах:

source: International Variations
ru: Международные различия
uk: Міжнародні відмінності

source: Some European countries use spaces instead of commas:
ru: Некоторые европейские страны используют пробелы вместо запятых:
uk: Деякі європейські країни використовують пробіли замість ком:

source: Some use periods as thousand separators:
ru: Некоторые используют точки в качестве разделителей тысяч:
uk: Деякі використовують крапки як роздільники тисяч:

source: In English, always use commas for thousands and periods for decimals
ru: В английском языке всегда используйте запятые для тысяч и точки для десятичных знаков
uk: В англійській мові завжди використовуйте коми для тисяч та крапки для десяткових дробів

source: Don't use 'and' in American English
ru: Не используйте 'and' (и) в американском английском
uk: Не використовуйте 'and' в американській англійській

source: Correct spelling of 40
ru: Правильное написание 40
uk: Правильне написання 40

source: Ordinal number suffixes
ru: Суффиксы порядковых числительных
uk: Суфікси порядкових числівників

source: Decades formatting
ru: Форматирование десятилетий
uk: Форматування десятиліть

source: Ordinal Numerals: Spelling Rules and Exceptions
ru: Порядковые числительные: Правила написания и исключения
uk: Порядкові числівники: Правила написання та винятки

source: Spelling Rules and Exceptions
ru: Правила написания и исключения
uk: Правила написання та винятки

source: Mastering ordinal numeral spelling requires understanding both the regular patterns and important exceptions. These rules are essential for proper writing in academic, professional, and formal contexts.
ru: Освоение написания порядковых числительных требует понимания как регулярных правил, так и важных исключений. Эти правила необходимы для правильного письма в академических, профессиональных и официальных контекстах.
uk: Опанування написання порядкових числівників вимагає розуміння як регулярних закономірностей, так і важливих винятків. Ці правила є важливими для правильного письма в академічному, професійному та формальному контекстах.

source: 1. Standard Formation Rules
ru: 1. Стандартные правила образования
uk: 1. Стандартні правила утворення

source: Basic '-th' Suffix Rule
ru: Основное правило суффикса '-th'
uk: Базове правило суфікса '-th'

source: For most numbers, add <span class="
uk: Для більшості чисел додайте <span class="

source: Numbers ending in <span class="
uk: Числа, що закінчуються на <span class="

source: Pronunciation Patterns
ru: Модели произношения
uk: Моделі вимови

source: Stress typically remains on the same syllable as the cardinal number
ru: Ударение, как правило, остается на том же слоге, что и в количественном числительном
uk: Наголос зазвичай залишається на тому ж складі, що і в кількісному числівнику

source: Compound ordinals have secondary stress on both parts
ru: Составные порядковые числительные имеют второстепенное ударение на обеих частях
uk: Складені порядкові числівники мають вторинний наголос на обох частинах

source: 2. Key Exceptions and Irregular Forms
ru: 2. Ключевые исключения и нерегулярные формы
uk: 2. Ключові винятки та нерегулярні форми

source: Cardinal
ru: Количественное
uk: Кількісний

source: Spelling Change
ru: Изменение написания
uk: Зміна написання

source: Complete change
ru: Полное изменение
uk: Повна зміна

source: Not 'oneth'
ru: Не 'oneth'
uk: Не 'oneth'

source: Not 'twoth'
ru: Не 'twoth'
uk: Не 'twoth'

source: Drop -ee, add -ird
ru: Отбросьте -ee, добавьте -ird
uk: Відкидаємо -ee, додаємо -ird

source: Not 'threeth'
ru: Не 'threeth'
uk: Не 'threeth'

source: ve → f, add -th
ru: ve → f, добавьте -th
uk: ve → f, додаємо -th

source: Not 'fiveth'
ru: Не 'fiveth'
uk: Не 'fiveth'

source: Add -h only
ru: Добавьте только -h
uk: Додаємо лише -h

source: One 't' disappears
ru: Исчезает одна 't'
uk: Одна 't' зникає

source: Drop -e
ru: Отбросьте -e
uk: Відкидаємо -e

source: Not 'nineth'
ru: Не 'nineth'
uk: Не 'nineth'

source: Not 'twelveth'
ru: Не 'twelveth'
uk: Не 'twelveth'

source: Compound Number Exceptions
ru: Исключения для составных чисел
uk: Винятки для складених чисел

source: Only the last number becomes ordinal:
ru: Только последнее число становится порядковым:
uk: Лише останнє число стає порядковим:

source: Exception for 11-13 (use -th):
ru: Исключение для 11-13 (используйте -th):
uk: Виняток для 11-13 (використовуйте -th):

source: 3. Abbreviated Forms and Writing Conventions
ru: 3. Сокращенные формы и правила письма
uk: 3. Скорочені форми та правила написання

source: Abbreviation
ru: Сокращение
uk: Скорочення

source: Full Word
ru: Полное слово
uk: Повне слово

source: Usage Example
ru: Пример использования
uk: Приклад використання

source: Writing Style Guidelines
ru: Руководство по стилю письма
uk: Керівні принципи стилю письма

source: In formal writing, spell out ordinals under 10:
uk: У формальному письмі пишіть словами порядкові числівники до 10:

source: not 3rd chapter
ru: не 3rd chapter
uk: не 3rd chapter

source: Use numerals with suffixes for dates and rankings:
uk: Використовуйте цифри з суфіксами для дат та рейтингів:

source: Superscripts are acceptable in informal contexts:
uk: Надрядкові індекси прийнятні в неформальних контекстах:

source: Incorrect double ordinalization
uk: Неправильна подвійна порядковість

source: in compounds:
uk: у складених словах:

source: Misspelling irregular forms
ru: Неправильное написание нерегулярных форм
uk: Неправильне написання нерегулярних форм

source: Incorrect abbreviations
ru: Неправильные сокращения
uk: Неправильні скорочення

source: Wrong suffix after hundred/thousand
ru: Неправильный суффикс после hundred/thousand
uk: Неправильний суфікс після hundred/thousand

source: Cardinal Numerals: Usage and Pluralization
ru: Количественные числительные: Использование и образование множественного числа
uk: Кількісні числівники: Використання та утворення множини

source: Usage and Pluralization
ru: Использование и образование множественного числа
uk: Використання та утворення множини

source: Mastering the usage of cardinal numerals involves understanding their grammatical roles and proper pluralization. These rules are essential for precise communication in both spoken and written English.
ru: Освоение использования количественных числительных включает понимание их грамматических ролей и правильного образования множественного числа. Эти правила необходимы для точного общения как в устной, так и в письменной речи на английском языке.
uk: Опанування використання кількісних числівників включає розуміння їхніх граматичних ролей та правильного утворення множини. Ці правила є важливими для точного спілкування як усною, так і письмовою англійською мовою.

source: 1. Grammatical Roles of Cardinal Numerals
ru: 1. Грамматические роли количественных числительных
uk: 1. Граматичні ролі кількісних числівників

source: As Determiners (Most Common)
ru: Как определители (наиболее распространенный)
uk: Як визначники (найпоширеніше)

source: Modify nouns directly
ru: Непосредственно определяют существительные
uk: Безпосередньо модифікують іменники

source: Always precede the noun they modify
ru: Всегда предшествуют существительному, которое определяют
uk: Завжди передують іменнику, який вони модифікують

source: Never take plural form in this role
uk: Ніколи не набувають форми множини в цій ролі

source: not sevens days
ru: не sevens days
uk: не sevens days

source: As Pronouns
ru: Как местоимения
uk: Як займенники

source: Stand alone without modifying a noun
ru: Используются отдельно, не определяя существительное
uk: Стоять окремо, не модифікуючи іменник

source: How many do you need? I need <span class="
uk: Скільки тобі потрібно? Мені потрібно <span class="

source: Can refer to previously mentioned items
ru: Могут ссылаться на ранее упомянутые предметы
uk: Можуть посилатися на раніше згадані предмети

source: She bought twelve apples but only needed <span class="
uk: Вона купила дванадцять яблук, але їй потрібно було лише <span class="

source: 2. Pluralization Rules
ru: 2. Правила образования множественного числа
uk: 2. Правила утворення множини

source: When to Pluralize Numerals
ru: Когда числительные образуют множественное число
uk: Коли числівники вживаються у множині

source: Referring to the numbers themselves
uk: При посиланні на самі числа

source: All the <span class="
uk: Усі <span class="

source: Referring to decades
uk: При посиланні на десятиліття

source: Referring to age groups
uk: При посиланні на вікові групи

source: This game is popular with <span class="
uk: Ця гра популярна серед <span class="

source: Referring to playing cards or dice
uk: При посиланні на гральні карти або кубики

source: He rolled three <span class="
uk: Він викинув три <span class="

source: General counting
uk: Загальний підрахунок

source: Referring to digits
uk: При посиланні на цифри

source: Approximate quantities
uk: Приблизні кількості

source: 3. Special Usage Cases
ru: 3. Особые случаи использования
uk: 3. Особливі випадки використання

source: With Units of Measurement
ru: С единицами измерения
uk: З одиницями вимірювання

source: Hyphenated compound adjectives
uk: Складені прикметники з дефісом

source: Non-hyphenated when not modifying a noun
uk: Без дефіса, коли не модифікують іменник

source: Special cases with foot/feet
ru: Особые случаи с foot/feet
uk: Особливі випадки з foot/feet

source: adjective
uk: прикметник

source: noun
uk: іменник

source: With Money and Currency
ru: С деньгами и валютой
uk: З грошима та валютою

source: Singular form for exact amounts
uk: Форма однини для точних сум

source: not fifties dollars
ru: не fifties dollars
uk: не fifties dollars

source: Plural for approximate amounts
uk: Форма множини для приблизних сум

source: Special forms for some currencies
uk: Спеціальні форми для деяких валют

source: not pences
ru: не pences
uk: не pences

source: Common Mistakes and Exceptions
ru: Распространенные ошибки и исключения
uk: Поширені помилки та винятки

source: is never pluralized
uk: ніколи не вживається у множині

source: Correct: the number one
ru: Правильно: the number one (число один)
uk: Правильно: the number one

source: Incorrect: the number ones
ru: Неправильно: the number ones
uk: Неправильно: the number ones

source: has two plural forms
uk: має дві форми множини

source: mathematics
uk: математика

source: general usage
uk: загальне використання

source: Collective numbers have fixed forms
uk: Збірні числівники мають фіксовані форми

source: not dozens eggs
ru: не dozens eggs
uk: не dozens eggs

source: when approximate
uk: коли приблизно

source: Avoid double pluralization
ru: Избегайте двойного множественного числа
uk: Уникайте подвійної множини

source: Correct: five million people
ru: Правильно: five million people (пять миллионов человек)
uk: Правильно: five million people

source: Incorrect: five millions people
ru: Неправильно: five millions people
uk: Неправильно: five millions people

source: Correct Form
ru: Правильная форма
uk: Правильна форма

source: Incorrect Form
ru: Неправильная форма
uk: Неправильна форма

source: Age description
uk: Опис віку

source: Sports scores
uk: Спортивні рахунки

source: Mathematical operations
uk: Математичні операції

source: Ordinal Numerals: Usage with Articles and Prepositions
ru: Порядковые числительные: Использование с артиклями и предлогами
uk: Порядкові числівники: Використання з артиклями та прийменниками

source: Usage with Articles and Prepositions
ru: Использование с артиклями и предлогами
uk: Використання з артиклями та прийменниками

source: Proper use of articles and prepositions with ordinal numerals is essential for precise communication. These grammatical elements help establish clear relationships between items in a sequence.
ru: Правильное использование артиклей и предлогов с порядковыми числительными необходимо для точного общения. Эти грамматические элементы помогают установить четкие отношения между элементами в последовательности.
uk: Правильне використання артиклів та прийменників з порядковими числівниками є важливим для точного спілкування. Ці граматичні елементи допомагають встановити чіткі зв'язки між елементами в послідовності.

source: 1. Article Usage with Ordinals
ru: 1. Использование артиклей с порядковыми числительными
uk: 1. Використання артиклів з порядковими числівниками

source: Definite Article 'the'
ru: Определенный артикль 'the'
uk: Означений артикль 'the'

source: Used in <span class="
uk: Використовується в <span class="

source: Specifies exact position in a sequence
ru: Указывает точную позицию в последовательности
uk: Вказує точну позицію в послідовності

source: Required with superlatives
ru: Требуется с превосходной степенью сравнения
uk: Обов'язковий зі ступенями порівняння

source: Used in dates
ru: Используется в датах
uk: Використовується в датах

source: Indefinite Article 'a/an'
ru: Неопределенный артикль 'a/an'
uk: Неозначений артикль 'a/an'

source: Used when referring to <span class="
uk: Використовується при посиланні на <span class="

source: Indicates non-specific order
ru: Указывает на неопределенный порядок
uk: Вказує на невизначену послідовність

source: Used in expressions of approximation
ru: Используется в выражениях приближения
uk: Використовується у виразах наближення

source: Specific position
uk: Конкретна позиція

source: Another in sequence
uk: Інший у послідовності

source: Superlatives
uk: Найвищий ступінь

source: Approximation
uk: Наближення

source: 2. Preposition Usage with Ordinals
ru: 2. Использование предлогов с порядковыми числительными
uk: 2. Використання прийменників з порядковими числівниками

source: Common Preposition Patterns
ru: Общие модели использования предлогов
uk: Поширені моделі прийменників

source: Floors, dates, surfaces
uk: Поверхи, дати, поверхні

source: Physical location
uk: Фізичне місцезнаходження

source: Centuries, periods
uk: Століття, періоди

source: Time periods
uk: Часові періоди

source: Sequences, groups
uk: Послідовності, групи

source: Partitive meaning
uk: Партитивне значення

source: Specific points
uk: Конкретні моменти

source: Precise locations
uk: Точні місця

source: Deadlines
uk: Кінцеві терміни

source: Time limits
uk: Обмеження часу

source: Special Prepositional Phrases
ru: Специальные предложные фразы
uk: Спеціальні прийменникові фрази

source: For the first/second time
ru: For the first/second time (в первый/второй раз)
uk: Вперше/вдруге

source: In the first/second place
ru: In the first/second place (во-первых/во-вторых)
uk: По-перше/по-друге

source: On the one hand... on the other hand
ru: On the one hand... on the other hand (с одной стороны... с другой стороны)
uk: З одного боку... з іншого боку

source: 3. Common Mistakes and Special Cases
ru: 3. Распространенные ошибки и особые случаи
uk: 3. Поширені помилки та особливі випадки

source: Omitting 'the' with ordinals
uk: Пропуск 'the' з порядковими числівниками

source: Confusing 'in' and 'on' with dates
uk: Плутанина 'in' та 'on' з датами

source: Misusing articles with proper nouns
uk: Неправильне використання артиклів з власними назвами

source: Special cases without articles
uk: Особливі випадки без артиклів

source: position
uk: позиція

source: adverbial
uk: прислівниковий

source: Numerals: Usage with Royalty and Sequence
ru: Числительные: Использование с королевскими титулами и в последовательностях
uk: Числівники: Використання з королівськими особами та послідовністю

source: Royalty and Sequence
ru: Королевские титулы и последовательности
uk: Королівські особи та послідовність

source: Numerals in Royal and Sequential Contexts
ru: Числительные в контексте королевских титулов и последовательностей
uk: Числівники у королівських та послідовних контекстах

source: The use of numerals with royalty, popes, and sequential references follows specific conventions that differ from ordinary numerical usage. Mastering these forms is essential for formal communication and historical contexts.
ru: Использование числительных с королевскими особами, папами и последовательными ссылками следует определенным правилам, которые отличаются от обычного использования чисел. Освоение этих форм необходимо для официального общения и исторических контекстов.
uk: Використання числівників щодо королівських осіб, пап та послідовних посилань відповідає конкретним умовностям, які відрізняються від звичайного використання числівників. Опанування цих форм є важливим для формального спілкування та історичних контекстів.

source: 1. Royal and Papal Numerals
ru: 1. Королевские и папские числительные
uk: 1. Королівські та папські числівники

source: Monarchs and popes use Roman numerals in their official titles, which are always read as ordinal numbers in speech.
ru: Монархи и папы используют римские цифры в своих официальных титулах, которые в речи всегда читаются как порядковые числительные.
uk: Монархи та папи використовують римські цифри у своїх офіційних титулах, які завжди читаються як порядкові числівники у розмові.

source: Title Type
ru: Тип титула
uk: Тип титулу

source: British Monarch
uk: Британський монарх

source: Queen Elizabeth the Second's coronation was in 1953
ru: Коронация королевы Елизаветы Второй была в 1953 году
uk: Коронація Королеви Єлизавети Другої відбулася у 1953 році

source: Pope
uk: Папа

source: Pope John Paul the Second visited over 100 countries
ru: Папа Иоанн Павел Второй посетил более 100 стран
uk: Папа Іван Павло Другий відвідав понад 100 країн

source: European Monarch
uk: Європейський монарх
