Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Improve comprehension with leveled articles and instant translations.
ru: Улучшайте понимание с помощью статей разного уровня сложности и мгновенных переводов.
uk: Покращуйте розуміння за допомогою статей різних рівнів та миттєвих перекладів.

source: Progress Tracking
ru: Отслеживание прогресса
uk: Відстеження Прогресу

source: Visualize your improvement with detailed statistics and milestones.
ru: Визуализируйте свой прогресс с помощью подробной статистики и достижений.
uk: Візуалізуйте своє вдосконалення за допомогою детальної статистики та досягнень.

source: Interactive Quizzes
ru: Интерактивные тесты
uk: Інтерактивні Вікторини

source: Test your knowledge with fun, gamified exercises.
ru: Проверьте свои знания с помощью веселых игровых упражнений.
uk: Перевіряйте свої знання за допомогою веселих, гейміфікованих вправ.

source: What Our Learners Say
ru: Что говорят наши ученики
uk: Що Кажуть Наші Учні

source: - Ivan, 28
ru: - Иван, 28
uk: - Іван, 28

source: - Maria, 32
ru: - Мария, 32
uk: - Марія, 32

source: Share Your Experience
ru: Поделитесь своим опытом
uk: Поділіться Своїм Досвідом

source: Ready to Transform Your English?
ru: Готовы преобразить свой английский?
uk: Готові Змінити Свою Англійську?

source: Join thousands of learners who improved their English with ExdiEng
ru: Присоединяйтесь к тысячам учеников, которые улучшили свой английский с ExdiEng
uk: Приєднуйтесь до тисяч учнів, які покращили свою англійську з ExdiEng

source: Start Free Trial
ru: Начать бесплатную пробную версию
uk: Почати Безкоштовний Пробний Період

source: Username or Email
ru: Имя пользователя или Email
uk: Ім'я користувача або Електронна пошта

source: Remember me
ru: Запомнить меня
uk: Запам'ятати мене

source: Reset password
ru: Сбросить пароль
uk: Скинути пароль

source: Don't have an account?
ru: Нет аккаунта?
uk: Не маєте облікового запису?

source: Sign up
ru: Зарегистрироваться
uk: Зареєструватися

source: Test
ru: Тест
uk: Тест

source: Notifications
ru: Уведомления
uk: Сповіщення

source: Mark all as read
ru: Отметить все как прочитанное
uk: Позначити всі як прочитані

source: ago
ru: назад
uk: тому

source: Accept
ru: Принять
uk: Прийняти

source: Reject
ru: Отклонить
uk: Відхилити

source: Friend request details unavailable.
ru: Сведения о запросе в друзья недоступны.
uk: Деталі запиту на додавання у друзі недоступні.

source: No notifications yet
ru: Уведомлений пока нет
uk: Повідомлень ще немає

source: View all notifications
ru: Посмотреть все уведомления
uk: Переглянути всі сповіщення

source: My Profile
ru: Мой профиль
uk: Мій Профіль

source: Messenger
ru: Мессенджер
uk: Месенджер

source: Settings
ru: Настройки
uk: Налаштування

source: Log Out
ru: Выйти
uk: Вийти

source: Send Reset Link
ru: Отправить ссылку для сброса
uk: Надіслати Посилання Для Скидання

source: Password Reset Complete
ru: Сброс пароля завершен
uk: Скидання Пароля Завершено

source: Your password has been set. You may go ahead and log in now.
ru: Ваш пароль установлен. Теперь вы можете войти.
uk: Ваш пароль встановлено. Тепер ви можете увійти.

source: Log In
ru: Войти
uk: Увійти

source: Reset Password Confirm
ru: Подтверждение сброса пароля
uk: Підтвердження Скидання Пароля

source: Set New Password
ru: Установить новый пароль
uk: Встановити Новий Пароль

source: Reset Password
ru: Сброс пароля
uk: Скинути Пароль

source: Reset Password Sent
ru: Ссылка для сброса пароля отправлена
uk: Посилання для Скидання Пароля Надіслано

source: We've emailed you instructions for setting your password. If you don't receive an email, please make sure you've entered the address you registered with.
ru: Мы отправили вам по электронной почте инструкции по установке нового пароля. Если вы не получили письмо, убедитесь, что вы ввели адрес, с которым регистрировались.
uk: Ми надіслали вам електронний лист з інструкціями для встановлення нового пароля. Якщо ви не отримали листа, переконайтеся, що ви ввели адресу, з якою реєструвалися.

source: Sign Up
ru: Регистрация
uk: Зареєструватися

source: E-mail
uk: Електронна пошта

source: Send Code
ru: Отправить код
uk: Надіслати Код

source: Username
ru: Имя пользователя
uk: Ім'я користувача

source: Password
ru: Пароль
uk: Пароль

source: Confirm Password
ru: Подтвердите пароль
uk: Підтвердити Пароль

source: Verification Code
ru: Код подтверждения
uk: Код Підтвердження

source: Resend code in:
ru: Повторная отправка кода через:
uk: Надіслати код повторно через:

source: sec.
ru: сек.
uk: сек.

source: Already registered?
ru: Уже зарегистрированы?
uk: Вже зареєстровані?

source: %(username)s avatar
ru: Аватар пользователя %(username)s
uk: Аватар користувача %(username)s

source: Default avatar
ru: Аватар по умолчанию
uk: Аватар за замовчуванням

source: View profile
ru: Посмотреть профиль
uk: Переглянути профіль

source: Delete chat
ru: Удалить чат
uk: Видалити чат

source: Search in messages...
ru: Поиск в сообщениях...
uk: Пошук у повідомленнях...

source: Search messages
ru: Искать сообщения
uk: Шукати повідомлення

source: Found %(count)s result
ru: Найден %(count)s результат
uk: Знайдено %(count)s результат

source: Today
ru: Сегодня
uk: Сьогодні

source: Yesterday
ru: Вчера
uk: Вчора

source: Delete message
ru: Удалить сообщение
uk: Видалити повідомлення

source: No messages yet. Start the conversation!
ru: Сообщений пока нет. Начните разговор!
uk: Повідомлень ще немає. Розпочніть розмову!

source: Write a message...
ru: Напишите сообщение...
uk: Написати повідомлення...

source: Send
ru: Отправить
uk: Надіслати

source: Are you sure you want to delete this message?
ru: Вы уверены, что хотите удалить это сообщение?
uk: Ви впевнені, що хочете видалити це повідомлення?

source: Are you sure you want to delete this chat? All messages will be permanently deleted.
ru: Вы уверены, что хотите удалить этот чат? Все сообщения будут удалены без возможности восстановления.
uk: Ви впевнені, що хочете видалити цей чат? Усі повідомлення буде видалено назавжди.

source: Delete Chat
ru: Удалить чат
uk: Видалити Чат

source: Error deleting message
ru: Ошибка при удалении сообщения
uk: Помилка видалення повідомлення

source: Welcome to Messenger!
ru: Добро пожаловать в Мессенджер!
uk: Ласкаво просимо до Месенджера!

source: Select a dialogue on the left or start a new chat.
ru: Выберите диалог слева или начните новый чат.
uk: Виберіть діалог зліва або розпочніть новий чат.

source: It looks like you don't have any friends to start a new chat with right now.
ru: Похоже, у вас пока нет друзей, чтобы начать новый чат.
uk: Схоже, що зараз у вас немає друзів, з якими можна розпочати новий чат.

source: You can add new friends through your
ru: Вы можете добавить новых друзей через свой
uk: Ви можете додати нових друзів через свій

source: profile
ru: профиль
uk: профіль

source: Create New Chat
ru: Создать новый чат
uk: Створити Новий Чат

source: Select a friend to start a chat with:
ru: Выберите друга для начала чата:
uk: Виберіть друга, щоб розпочати чат:

source: You don't have any friends to start a new chat with (or you are already chatting with all of them).
ru: У вас нет друзей, с которыми можно начать новый чат (или вы уже общаетесь со всеми).
uk: У вас немає друзів, з якими можна розпочати новий чат (або ви вже спілкуєтеся з усіма).

source: My Chats
ru: Мои чаты
uk: Мої Чати

source: New Chat
ru: Новый чат
uk: Новий Чат

source: Achieved!
ru: Достигнуто!
uk: Досягнуто!

source: My Network
ru: Моя сеть
uk: Моя Мережа

source: Followers
ru: Подписчики
uk: Підписники

source: Friends
ru: Друзья
uk: Друзі

source: Followers (%(followers_count)s)
ru: Подписчики (%(followers_count)s)
uk: Підписники (%(followers_count)s)

source: Add Friend
ru: Добавить в друзья
uk: Додати друга

source: You don't have any followers yet.
ru: У вас пока нет подписчиков.
uk: У вас ще немає підписників.

source: Discover Users
ru: Найти пользователей
uk: Знайти Користувачів

source: Friends (%(page_obj.paginator.count)s)
ru: Друзья (%(page_obj.paginator.count)s)
uk: Друзі (%(page_obj.paginator.count)s)

source: Are you sure you want to remove %(friend.username)s from friends?
ru: Вы уверены, что хотите удалить %(friend.username)s из друзей?
uk: Ви впевнені, що хочете видалити %(friend.username)s з друзів?

source: Remove
ru: Удалить
uk: Видалити

source: You don't have any friends yet.
ru: У вас пока нет друзей.
uk: У вас ще немає друзів.

source: Find Friends
ru: Найти друзей
uk: Знайти Друзів

source: Profile of %(user_name)s
ru: Профиль пользователя %(user_name)s
uk: Профіль користувача %(user_name)s

source: %(user_name)s's profile
ru: Профиль %(user_name)s
uk: Профіль %(user_name)s

source: User Avatar
ru: Аватар пользователя
uk: Аватар Користувача

source: Edit profile
ru: Редактировать профиль
uk: Редагувати профіль

source: First Name:
ru: Имя:
uk: Ім'я:

source: Hidden
ru: Скрыто
uk: Приховано

source: Last Name:
ru: Фамилия:
uk: Прізвище:

source: Birth Date:
ru: Дата рождения:
uk: Дата народження:

source: English Level:
ru: Уровень английского:
uk: Рівень англійської:

source: Bio:
ru: О себе (Биография):
uk: Про себе:

source: Location:
ru: Местоположение:
uk: Місцезнаходження:

source: Your friend isn't here yet?
ru: Вашего друга еще нет здесь?
uk: Вашого друга ще немає тут?

source: Invite them
ru: Пригласите их
uk: Запросіть його

source: Your Achievements
ru: Ваши достижения
uk: Ваші Досягнення

source: Words Mastery
ru: Мастерство слов
uk: Опанування Слів

source: Texts Mastery
ru: Мастерство текстов
uk: Опанування Текстів

source: Tests Mastery
ru: Мастерство тестов
uk: Опанування Тестів

source: Share results
ru: Поделиться результатами
uk: Поділитися результатами

source: Study Start Date:
ru: Дата начала обучения:
uk: Дата початку навчання:

source: Website:
ru: Сайт:
uk: Вебсайт:

source: Add to friends
ru: Добавить в друзья
uk: Додати в друзі

source: Request rejected
ru: Запрос отклонен
uk: Запит відхилено

source: Send request again
ru: Отправить запрос снова
uk: Надіслати запит повторно

source: Request was sent
ru: Запрос был отправлен
uk: Запит надіслано

source: Accept Friend Request
ru: Принять запрос в друзья
uk: Прийняти Запит у Друзі

source: Reject Friend Request
ru: Отклонить запрос в друзья
uk: Відхилити Запит у Друзі

source: Are you sure you want to remove %(profile.user.username)s from friends?
ru: Вы уверены, что хотите удалить %(profile.user.username)s из друзей?
uk: Ви впевнені, що хочете видалити %(profile.user.username)s з друзів?

source: Remove from friends
ru: Удалить из друзей
uk: Видалити з друзів

source: Achievements
ru: Достижения
uk: Досягнення

source: Profile
ru: Профиль
uk: Профіль

source: Words Learned:
ru: Выучено слов:
uk: Вивчено Слів:

source: Texts Read:
ru: Прочитано текстов:
uk: Прочитано Текстів:

source: Tests Completed:
ru: Завершено тестов:
uk: Виконано Тестів:

source: Current Streak:
ru: Текущая серия дней:
uk: Поточна Серія:

source: Edit Profile
ru: Редактировать профиль
uk: Редагувати Профіль

source: Please correct the following errors:
ru: Пожалуйста, исправьте следующие ошибки:
uk: Будь ласка, виправте наступні помилки:

source: Change Photo
ru: Изменить фото
uk: Змінити Фото

source: Personal Information
ru: Личная информация
uk: Особиста Інформація

source: Username cannot be changed
ru: Имя пользователя не может быть изменено
uk: Ім'я користувача не можна змінити

source: First Name
ru: Имя
uk: Ім'я

source: Hide
ru: Скрыть
uk: Приховати

source: Last Name
ru: Фамилия
uk: Прізвище

source: Birth Date
ru: Дата рождения
uk: Дата народження

source: English Level
ru: Уровень английского
uk: Рівень англійської

source: Level is determined by tests
ru: Уровень определяется тестами
uk: Рівень визначається за результатами тестів

source: Additional Information
ru: Дополнительная информация
uk: Додаткова Інформація

source: Bio
ru: О себе
uk: Про себе

source: Location
ru: Местоположение
uk: Місцезнаходження

source: Study Start Date
ru: Дата начала обучения
uk: Дата початку навчання

source: Save Profile Changes
ru: Сохранить изменения профиля
uk: Зберегти Зміни Профілю

source: Change Password
ru: Изменить пароль
uk: Змінити Пароль

source: Current Password
ru: Текущий пароль
uk: Поточний Пароль

source: New Password
ru: Новый пароль
uk: Новий Пароль

source: Confirm New Password
ru: Подтвердите новый пароль
uk: Підтвердити Новий Пароль

source: About MyEngSite
ru: О сайте MyEngSite
uk: Про MyEngSite

source: Your personal English learning companion
ru: Ваш личный помощник в изучении английского языка
uk: Ваш особистий помічник у вивченні англійської мови

source: MyEngSite is a modern platform for self-learning English, designed to help you track your progress, work with texts, memorize vocabulary, and test your knowledge through interactive exercises.
ru: MyEngSite – это современная платформа для самостоятельного изучения английского языка, разработанная, чтобы помочь вам отслеживать свой прогресс, работать с текстами, запоминать лексику и проверять свои знания с помощью интерактивных упражнений.
uk: MyEngSite — це сучасна платформа для самостійного вивчення англійської мови, розроблена для того, щоб допомогти вам відстежувати свій прогрес, працювати з текстами, запам'ятовувати словниковий запас та перевіряти свої знання за допомогою інтерактивних вправ.

source: Personal account with progress tracking
ru: Личный кабинет с отслеживанием прогресса
uk: Особистий кабінет з відстеженням прогресу

source: Extensive library of texts filtered by difficulty level (A0-C2)
ru: Обширная библиотека текстов, отфильтрованных по уровню сложности (A0-C2)
uk: Обширна бібліотека текстів, відфільтрованих за рівнем складності (A0-C2)

source: Flashcard system for vocabulary memorization
ru: Система карточек для запоминания лексики
uk: Система карток для запам'ятовування словникового запасу

source: Interactive tests and exercises
ru: Интерактивные тесты и упражнения
uk: Інтерактивні тести та вправи

source: Responsive design for all devices
ru: Адаптивный дизайн для всех устройств
uk: Адаптивний дизайн для всіх пристроїв

source: Development
ru: Разработка
uk: Розробка

source: MyEngSite is continuously being improved with new features and enhancements based on user feedback.
ru: MyEngSite постоянно совершенствуется, добавляются новые функции и улучшения на основе отзывов пользователей.
uk: MyEngSite постійно вдосконалюється новими функціями та покращеннями на основі відгуків користувачів.

source: We're committed to providing the best English learning experience through technology.
ru: Мы стремимся предоставить лучший опыт изучения английского языка с помощью технологий.
uk: Ми прагнемо забезпечити найкращий досвід вивчення англійської мови за допомогою технологій.

source: Join Our Community
ru: Присоединяйтесь к нашему сообществу
uk: Приєднуйтесь до Нашої Спільноти

source: Connect with other learners and share your experience:
ru: Общайтесь с другими учащимися и делитесь своим опытом:
uk: Зв'яжіться з іншими учнями та поділіться своїм досвідом:

source: Appearance Settings
ru: Настройки внешнего вида
uk: Налаштування Вигляду

source: Theme
ru: Тема
uk: Тема

source: Choose between light and dark theme
ru: Выберите светлую или темную тему
uk: Виберіть між світлою та темною темою

source: Light
ru: Светлая
uk: Світла

source: Dark
ru: Темная
uk: Темна

source: System
ru: Системная
uk: Системна

source: Accent Color
ru: Акцентный цвет
uk: Колір Акценту

source: Choose your preferred accent color
ru: Выберите предпочитаемый акцентный цвет
uk: Виберіть бажаний колір акценту

source: Font Size
ru: Размер шрифта
uk: Розмір Шрифту

source: Adjust the text size to your preference
ru: Настройте размер текста по своему усмотрению
uk: Налаштуйте розмір тексту відповідно до ваших уподобань

source: Display Density
ru: Плотность отображения
uk: Щільність Відображення

source: Control the spacing and size of elements
ru: Управляйте интервалами и размером элементов
uk: Керуйте інтервалом та розміром елементів

source: Compact
ru: Компактный
uk: Компактна

source: Normal
ru: Обычный
uk: Нормальна

source: Comfortable
ru: Комфортный
uk: Комфортна

source: Animations
ru: Анимации
uk: Анімації

source: Enable or disable interface animations
ru: Включить или отключить анимации интерфейса
uk: Увімкнути або вимкнути анімацію інтерфейсу

source: Save Appearance Settings
ru: Сохранить настройки внешнего вида
uk: Зберегти Налаштування Вигляду

source: Reset to Defaults
ru: Сбросить до значений по умолчанию
uk: Скинути до Налаштувань за Замовчуванням

source: Are you sure you want to reset all appearance settings to default values?
ru: Вы уверены, что хотите сбросить все настройки внешнего вида до значений по умолчанию?
uk: Ви впевнені, що хочете скинути всі налаштування вигляду до значень за замовчуванням?

source: Data & Storage Settings
ru: Настройки данных и хранилища
uk: Налаштування Даних та Сховища

source: Storage Usage
ru: Использование хранилища
uk: Використання Сховища

source: of
ru: из
uk: з

source: used
ru: использовано
uk: використано

source: Media Files
ru: Медиафайлы
uk: Медіафайли

source: Documents
ru: Документы
uk: Документи

source: Application Data
ru: Данные приложения
uk: Дані Застосунку

source: Data Export
ru: Экспорт данных
uk: Експорт Даних

source: Export Your Data
ru: Экспортировать Ваши данные
uk: Експортувати Ваші Дані

source: Download a copy of all your data in JSON format
ru: Скачать копию всех ваших данных в формате JSON
uk: Завантажте копію всіх ваших даних у форматі JSON

source: Export Data
ru: Экспортировать данные
uk: Експортувати Дані

source: Previous Exports
ru: Предыдущие экспорты
uk: Попередні Експорти

source: Download
ru: Скачать
uk: Завантажити

source: No previous exports found
ru: Предыдущие экспорты не найдены
uk: Попередніх експортів не знайдено

source: Data Cleanup
ru: Очистка данных
uk: Очищення Даних

source: Clear Cache
ru: Очистить кэш
uk: Очистити Кеш

source: Remove temporary files to free up space
ru: Удалить временные файлы для освобождения места
uk: Видалити тимчасові файли, щоб звільнити місце

source: Clear Now
ru: Очистить сейчас
uk: Очистити Зараз

source: Auto-Cleanup
ru: Автоматическая очистка
uk: Автоматичне Очищення

source: Automatically clear temporary files older than
ru: Автоматически удалять временные файлы старше
uk: Автоматично видаляти тимчасові файли, старші ніж

source: Never
ru: Никогда
uk: Ніколи

source: 7 days
ru: 7 дней
uk: 7 днів

source: 30 days
ru: 30 дней
uk: 30 днів

source: 90 days
ru: 90 дней
uk: 90 днів

source: Danger Zone
ru: Опасная зона
uk: Небезпечна Зона

source: Delete All Data
ru: Удалить все данные
uk: Видалити Всі Дані

source: Permanently delete all your data including media, documents and account information
ru: Навсегда удалить все ваши данные, включая медиафайлы, документы и информацию об аккаунте
uk: Назавжди видалити всі ваші дані, включаючи медіа, документи та інформацію облікового запису

source: Confirm Data Deletion
ru: Подтвердить удаление данных
uk: Підтвердити Видалення Даних

source: This action will permanently delete ALL your data including:
ru: Это действие навсегда удалит ВСЕ ваши данные, включая:
uk: Ця дія назавжди видалить УСІ ваші дані, включаючи:

source: Account information
ru: Информация об аккаунте
uk: Інформацію облікового запису

source: Uploaded media files
ru: Загруженные медиафайлы
uk: Завантажені медіафайли

source: Documents and other content
ru: Документы и другой контент
uk: Документи та інший вміст

source: Activity history
ru: История активности
uk: Історію активності

source: This cannot be undone!
ru: Это невозможно отменить!
uk: Це неможливо скасувати!

source: Enter your password to confirm:
ru: Введите ваш пароль для подтверждения:
uk: Введіть свій пароль для підтвердження:

source: Permanently Delete All Data
ru: Навсегда удалить все данные
uk: Назавжди Видалити Всі Дані

source: Preparing export...
ru: Подготовка экспорта...
uk: Підготовка експорту...

source: Your data export has been started. You will receive a notification when it\'s ready to download.
ru: Экспорт ваших данных запущен. Вы получите уведомление, когда он будет готов к загрузке.
uk: Експорт ваших даних розпочато. Ви отримаєте сповіщення, коли їх можна буде завантажити.

source: Error exporting data:
ru: Ошибка экспорта данных:
uk: Помилка експорту даних:

source: An error occurred while exporting your data. Please try again later.
ru: Произошла ошибка при экспорте ваших данных. Пожалуйста, попробуйте позже.
uk: Під час експорту ваших даних сталася помилка. Будь ласка, спробуйте пізніше.

source: Are you sure you want to clear all cached data?
ru: Вы уверены, что хотите очистить все кэшированные данные?
uk: Ви впевнені, що хочете очистити всі кешовані дані?

source: Clearing...
ru: Очистка...
uk: Очищення...

source: Cache cleared successfully. Freed up space:
ru: Кэш успешно очищен. Освобождено места:
uk: Кеш успішно очищено. Звільнено місця:

source: Error clearing cache:
ru: Ошибка очистки кэша:
uk: Помилка очищення кешу:

source: An error occurred while clearing cache. Please try again later.
ru: Произошла ошибка при очистке кэша. Пожалуйста, попробуйте позже.
uk: Під час очищення кешу сталася помилка. Будь ласка, спробуйте пізніше.

source: Help & Support
ru: Помощь и поддержка
uk: Допомога та Підтримка

source: Help Resources
ru: Ресурсы помощи
uk: Ресурси Допомоги

source: FAQs
ru: Часто задаваемые вопросы (FAQ)
uk: Поширені Запитання

source: Find answers to common questions
ru: Найдите ответы на часто задаваемые вопросы
uk: Знайдіть відповіді на поширені запитання

source: User Guide
ru: Руководство пользователя
uk: Посібник Користувача

source: Complete guide to using our platform
ru: Полное руководство по использованию нашей платформы
uk: Повний посібник з використання нашої платформи

source: Video Tutorials
ru: Видеоуроки
uk: Відеоуроки

source: Watch step-by-step tutorials
ru: Смотрите пошаговые видеоуроки
uk: Дивіться покрокові відеоуроки

source: Contact Support
ru: Связаться со службой поддержки
uk: Звернутися до Підтримки

source: Support Email
ru: Email поддержки
uk: Електронна Пошта Підтримки

source: Reach our support team via email
ru: Свяжитесь с нашей командой поддержки по электронной почте
uk: Зв'яжіться з нашою командою підтримки електронною поштою

source: Email Us
ru: Написать нам
uk: Напишіть Нам

source: Live Chat
ru: Онлайн-чат
uk: Живий Чат

source: Chat with our support team in real-time
ru: Общайтесь с нашей службой поддержки в реальном времени
uk: Спілкуйтеся з нашою командою підтримки в режимі реального часу

source: Start Chat
ru: Начать чат
uk: Розпочати Чат

source: Phone Support
ru: Поддержка по телефону
uk: Телефонна Підтримка

source: Call us during business hours
ru: Позвоните нам в рабочее время
uk: Телефонуйте нам у робочий час

source: Call Support
ru: Позвонить в поддержку
uk: Подзвонити в Підтримку

source: Report Issues
ru: Сообщить о проблемах
uk: Повідомити про Проблеми

source: Issue Type
ru: Тип проблемы
uk: Тип Проблеми

source: Bug Report
ru: Сообщение об ошибке
uk: Повідомлення про Помилку

source: Feature Request
ru: Запрос функции
uk: Запит на Функцію

source: Account Issue
ru: Проблема с аккаунтом
uk: Проблема Облікового Запису

source: Other
ru: Прочее
uk: Інше

source: Please describe your issue in detail...
ru: Пожалуйста, опишите вашу проблему подробно...
uk: Будь ласка, детально опишіть вашу проблему...

source: Attachments (optional)
ru: Вложения (необязательно)
uk: Вкладення (необов'язково)

source: Choose Files
ru: Выбрать файлы
uk: Вибрати Файли

source: Screenshots help us understand your issue better
ru: Скриншоты помогают нам лучше понять вашу проблему
uk: Знімки екрана допомагають нам краще зрозуміти вашу проблему

source: Submit Report
ru: Отправить отчет
uk: Надіслати Звіт

source: System Information
ru: Системная информация
uk: Системна Інформація

source: App Version
ru: Версия приложения
uk: Версія Застосунку
