Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: ' follows the linking verb 'tastes' and describes the subject 'soup'.
ru: ' следует за глаголом-связкой 'tastes' (на вкус) и описывает подлежащее 'soup' (суп).
uk: ' стоїть після дієслова-зв'язки 'tastes' та описує підмет 'суп'.

source: This table summarizes the two main syntactic functions of adjectives.
ru: В этой таблице обобщены две основные синтаксические функции прилагательных.
uk: Ця таблиця узагальнює дві основні синтаксичні функції прикметників.

source: Position
ru: Позиция
uk: Позиція

source: Before the noun.
ru: Перед существительным.
uk: Перед іменником.

source: After a linking verb.
ru: После глагола-связки.
uk: Після дієслова-зв'язки.

source: Adjectives Used as Nouns: To Refer to a Group of People
ru: Прилагательные, используемые как существительные: Для обозначения группы людей
uk: Прикметники, що використовуються як іменники: Для позначення групи людей

source: To Refer to a Group of People
ru: Для обозначения группы людей
uk: Для позначення групи людей

source: In English, a specific group of people who share a common characteristic can be referred to by using the definite article
ru: В английском языке конкретную группу людей, имеющих общую характеристику, можно обозначить, используя определенный артикль
uk: В англійській мові конкретну групу людей, які мають спільну характеристику, можна позначити, використовуючи означений артикль

source: followed by an adjective. In this usage, the adjective functions as a plural noun.
ru: , за которым следует прилагательное. При таком использовании прилагательное функционирует как существительное во множественном числе.
uk: , за яким слідує прикметник. У цьому вживанні прикметник функціонує як іменник у множині.

source: The structure is simple:
ru: Структура проста:
uk: Структура проста:

source: . The resulting phrase acts as a plural noun, so it is always used with a plural verb.
ru: . Получившаяся фраза действует как существительное во множественном числе, поэтому она всегда используется с глаголом во множественном числе.
uk: . Отримана фраза діє як іменник у множині, тому вона завжди використовується з дієсловом у множині.

source: Phrase
ru: Фраза
uk: Фраза

source: 2. Specific vs. General Reference
ru: 2. Конкретное против общего обозначения
uk: 2. Конкретне проти загального посилання

source: This usage is for referring to people in a general sense, as a class or group. It is a concise way to describe people without having to say '
ru: Это использование предназначено для обозначения людей в общем смысле, как класса или группы. Это краткий способ описать людей без необходимости говорить '
uk: Це вживання призначене для позначення людей у загальному сенсі, як класу або групи. Це лаконічний спосіб описати людей, не кажучи '

source: ' or '
ru: ' или '
uk: ' або '

source: The first example uses '
ru: В первом примере используется '
uk: Перший приклад використовує '

source: ' as a plural noun, while the second uses the adjective '
ru: ' как существительное во множественном числе, в то время как во втором используется прилагательное '
uk: ' як іменник у множині, тоді як другий використовує прикметник '

source: ' to modify the noun '
ru: ' для определения существительного '
uk: ' для модифікації іменника '

source: 3. Adjectives for Nationalities
ru: 3. Прилагательные для национальностей
uk: 3. Прикметники для позначення національностей

source: Many adjectives referring to nationalities can also be used this way, especially those ending in
ru: Многие прилагательные, обозначающие национальности, также могут использоваться таким образом, особенно те, что оканчиваются на
uk: Багато прикметників, що позначають національності, також можуть використовуватися таким чином, особливо ті, що закінчуються на

source: <strong>Note:</strong> Not all nationality adjectives follow this rule. For example, you would not say
ru: <strong>Примечание:</strong> Не все прилагательные национальностей следуют этому правилу. Например, вы не скажете
uk: <strong>Примітка:</strong> Не всі прикметники-національності дотримуються цього правила. Наприклад, ви б не сказали

source: but rather '
ru: , а скорее '
uk: , а скоріше '

source: Similar to how adjectives can refer to a group of people, they can also be used with the definite article
ru: Подобно тому, как прилагательные могут обозначать группу людей, они также могут использоваться с определенным артиклем
uk: Подібно до того, як прикметники можуть позначати групу людей, вони також можуть використовуватися з означеним артиклем

source: to refer to abstract ideas, qualities, or conditions.
ru: для обозначения абстрактных идей, качеств или состояний.
uk: для позначення абстрактних ідей, якостей або станів.

source: The structure is
ru: Структура
uk: Структура така:

source: . The resulting phrase functions as a singular, abstract noun, often referring to a quality or a state of being.
ru: . Получившаяся фраза функционирует как существительное в единственном числе, абстрактное, часто обозначающее качество или состояние.
uk: . Отримана фраза функціонує як іменник в однині, абстрактний, часто позначаючи якість або стан буття.

source: here is a singular concept, not a group of people).
ru: здесь является понятием в единственном числе, а не группой людей).
uk: тут — це поняття в однині, а не група людей).

source: here is a plural noun referring to people).
ru: здесь является существительным во множественном числе, относящимся к людям).
uk: тут — іменник у множині, що позначає людей).

source: In a philosophical discussion: 'What is
ru: В философской дискуссии: 'Что такое
uk: У філософській дискусії: 'Що таке

source: ?' (referring to a concept).
ru: ?' (обозначение понятия).
uk: ?' (позначає поняття).

source: In a religious text: 'The prayers of
ru: В религиозном тексте: 'Молитвы
uk: У релігійному тексті: 'Молитви

source: .' (referring to people).
ru: .' (обозначение людей).
uk: .' (позначає людей).

source: An adjective is a word that describes or modifies a noun or pronoun. Adjectives provide additional information about the qualities, quantity, or state of the noun they modify, making sentences more descriptive and precise.
ru: Прилагательное — это слово, которое описывает или определяет существительное или местоимение. Прилагательные предоставляют дополнительную информацию о качествах, количестве или состоянии определяемого ими существительного, делая предложения более описательными и точными.
uk: Прикметник — це слово, яке описує або модифікує іменник чи займенник. Прикметники надають додаткову інформацію про якості, кількість або стан іменника, який вони модифікують, роблячи речення більш описовими та точними.

source: Adjectives
ru: Прилагательные
uk: Прикметники

source: Adjectives: Definition and Structure
ru: Прилагательные: Определение и структура
uk: Прикметники: Визначення та структура

source: As Singular and Plural Nouns
ru: Как существительные в единственном и множественном числе
uk: Як іменники в однині та множині

source: Functions of Adjectives in a Sentence
ru: Функции прилагательных в предложении
uk: Функції прикметників у реченні

source: Appositive and Introductory
ru: Приложение и вводное
uk: Прикладкова та вступна функції

source: Back to Grammar
ru: Назад к Грамматике
uk: Повернутися до Граматики

source: Adverb
ru: Наречие
uk: Прислівник

source: Adverbs are a crucial part of speech that modify verbs, adjectives, other adverbs, or even entire sentences. They provide important information about how, when, where, and to what extent an action occurs.
ru: Наречия — это важная часть речи, которая определяет глаголы, прилагательные, другие наречия или даже целые предложения. Они предоставляют важную информацию о том, как, когда, где и в какой степени происходит действие.
uk: Прислівники — це важлива частина мови, яка модифікує дієслова, прикметники, інші прислівники або навіть цілі речення. Вони надають важливу інформацію про те, як, коли, де і якою мірою відбувається дія.

source: Definition and Functions
ru: Определение и функции
uk: Визначення та функції

source: Modifying Verbs, Adjectives, and Other Adverbs
ru: Определение/Изменение глаголов, прилагательных и других наречий
uk: Модифікація дієслів, прикметників та інших прислівників

source: Modifying Entire Sentences
ru: Определение/Изменение целых предложений
uk: Модифікація цілих речень

source: Formation of Adverbs (Adjective + -ly, etc.)
ru: Образование наречий (Прилагательное + -ly и т. д.)
uk: Утворення прислівників (Прикметник + -ly, тощо)

source: Types of Adverbs
ru: Типы наречий
uk: Типи прислівників

source: Adverbs of Manner, Place, and Time
ru: Наречия образа действия, места и времени
uk: Прислівники способу дії, місця та часу

source: Adverbs of Frequency and Degree
ru: Наречия частоты и степени
uk: Прислівники частоти та міри/ступеня

source: Interrogative, Relative, and Conjunctive Adverbs
ru: Вопросительные, относительные и сочинительные наречия
uk: Питальні, відносні та сполучні прислівники

source: Positive, Comparative, and Superlative Forms
ru: Положительная, сравнительная и превосходная формы
uk: Позитивна, порівняльна та найвища форми

source: Formation Rules (-er/-est, more/most)
ru: Правила образования (-er/-est, more/most)
uk: Правила утворення (-er/-est, more/most)

source: Placement of Adverbs
ru: Размещение наречий
uk: Розташування прислівників

source: General Positions (Front, Mid, End)
ru: Общие позиции (Начало, Середина, Конец)
uk: Загальні позиції (Початок, Середина, Кінець)

source: Placement for Specific Adverb Types
ru: Размещение для конкретных типов наречий
uk: Розташування для конкретних типів прислівників

source: Order of Adverbs (MPT Rule)
ru: Порядок наречий (Правило ММВ – MPT Rule)
uk: Порядок прислівників (Правило MPT)

source: Adverbs
ru: Наречия
uk: Прислівники

source: Mastering Adverbs of Frequency and Degree
ru: Освоение наречий частоты и степени
uk: Освоєння прислівників частоти та міри/ступеня

source: These essential adverbs provide crucial information about how often actions occur and the intensity or extent of qualities and actions.
ru: Эти важные наречия предоставляют ключевую информацию о том, как часто происходят действия, а также об интенсивности или степени качеств и действий.
uk: Ці важливі прислівники надають ключову інформацію про те, як часто відбуваються дії, а також про інтенсивність або ступінь якостей та дій.

source: 1. Adverbs of Frequency
ru: 1. Наречия частоты
uk: 1. Прислівники частоти

source: Expressing How Often Actions Occur
ru: Выражение того, как часто происходят действия
uk: Вираження того, як часто відбуваються дії

source: Frequency Scale (Most to Least Frequent)
ru: Шкала частоты (от наиболее к наименее частому)
uk: Шкала частоти (Від найчастішого до найрідкіснішого)

source: Approximate Frequency
ru: Приблизительная частота
uk: Приблизна частота

source: Position Rules
ru: Правила расположения
uk: Правила розташування

source: Before main verbs:
ru: Перед основными глаголами:
uk: Перед основними дієсловами:

source: After the verb 'to be':
ru: После глагола 'to be':
uk: Після дієслова 'to be':

source: Between auxiliary and main verbs:
ru: Между вспомогательным и основным глаголами:
uk: Між допоміжним та основним дієсловами:

source: At beginning/end for emphasis:
ru: В начале/конце для выделения:
uk: На початку/в кінці для наголосу:

source: 2. Adverbs of Degree
ru: 2. Наречия степени
uk: 2. Прислівники міри/ступеня

source: Modifying Intensity and Extent
ru: Определение/Изменение интенсивности и степени
uk: Модифікація інтенсивності та обсягу/ступеня

source: Degree Adverbs by Intensity
ru: Наречия степени по интенсивности
uk: Прислівники міри/ступеня за інтенсивністю

source: Intensity
ru: Интенсивность
uk: Інтенсивність

source: Example Usage
ru: Пример использования
uk: Приклад вживання

source: Maximum
ru: Максимальная
uk: Максимальна

source: High
ru: Высокая
uk: Висока

source: Moderate
ru: Умеренная
uk: Помірна

source: Low
ru: Низкая
uk: Низька

source: Minimal
ru: Минимальная
uk: Мінімальна

source: Modification Patterns
ru: Схемы определения/Изменения
uk: Схеми модифікації

source: With adjectives:
ru: С прилагательными:
uk: З прикметниками:

source: With verbs:
ru: С глаголами:
uk: З дієсловами:

source: With other adverbs:
ru: С другими наречиями:
uk: З іншими прислівниками:

source: With nouns (some degree adverbs):
ru: С существительными (некоторые наречия степени):
uk: З іменниками (деякі прислівники міри/ступеня):

source: Common Errors and Special Cases
ru: Распространенные ошибки и особые случаи
uk: Поширені помилки та особливі випадки

source: Practice Exercises
ru: Практические упражнения
uk: Практичні вправи

source: Choose the correct adverb to complete each sentence:
ru: Выберите правильное наречие, чтобы завершить каждое предложение:
uk: Виберіть правильний прислівник, щоб доповнити кожне речення:

source: Correct these sentences:
ru: Исправьте эти предложения:
uk: Виправте ці речення:

source: Back to Adverbs
ru: Назад к Наречиям
uk: Повернутися до Прислівників

source: Mastering Adverbs of Manner, Place, and Time
ru: Освоение наречий образа действия, места и времени
uk: Освоєння прислівників способу дії, місця та часу

source: These fundamental adverb categories help create precise, detailed descriptions in English by answering key questions about actions and events.
ru: Эти фундаментальные категории наречий помогают создавать точные, подробные описания в английском языке, отвечая на ключевые вопросы о действиях и событиях.
uk: Ці фундаментальні категорії прислівників допомагають створювати точні, детальні описи в англійській мові, відповідаючи на ключові питання про дії та події.

source: 1. Adverbs of Manner
ru: 1. Наречия образа действия
uk: 1. Прислівники способу дії

source: Describing How Actions Occur
ru: Описание того, как происходят действия
uk: Опис того, як відбуваються дії

source: Formation
ru: Образование
uk: Утворення

source: Examples
ru: Примеры
uk: Приклади

source: Sample Sentences
ru: Примеры предложений
uk: Зразки речень

source: -ly ending
ru: Окончание -ly
uk: Закінчення -ly

source: Irregular forms
ru: Неправильные формы
uk: Нерегулярні форми

source: Prepositional phrases
ru: Предложные фразы
uk: Прийменникові фрази

source: Usually after the main verb:
ru: Обычно после основного глагола:
uk: Зазвичай після основного дієслова:

source: After the object if the verb has one:
ru: После дополнения, если глагол имеет его:
uk: Після додатка, якщо у дієслова він є:

source: Before the verb for emphasis:
ru: Перед глаголом для выделения:
uk: Перед дієсловом для наголосу:

source: 2. Adverbs of Place
ru: 2. Наречия места
uk: 2. Прислівники місця

source: Indicating Location and Direction
ru: Указание местоположения и направления
uk: Вказівка на місце розташування та напрямок

source: Type
ru: Тип
uk: Тип

source: General location
ru: Общее местоположение
uk: Загальне місце розташування

source: Direction
ru: Направление
uk: Напрямок

source: Relative position
ru: Относительное положение
uk: Відносне положення

source: Typically after the main verb or object:
ru: Обычно после основного глагола или дополнения:
uk: Зазвичай після основного дієслова або додатка:

source: Before adverbs of time when both are present:
ru: Перед наречиями времени, когда присутствуют оба:
uk: Перед прислівниками часу, коли присутні обидва:

source: Here/there at the beginning for emphasis:
ru: Here/there в начале для выделения:
uk: Here/there на початку для наголосу:

source: 3. Adverbs of Time
ru: 3. Наречия времени
uk: 3. Прислівники часу

source: Expressing When Actions Occur
ru: Выражение того, когда происходят действия
uk: Вираження того, коли відбуваються дії

source: Definite time
ru: Определенное время
uk: Визначений час

source: Frequency
ru: Частота
uk: Частота

source: Duration
ru: Продолжительность
uk: Тривалість

source: Usually at the end of the sentence:
ru: Обычно в конце предложения:
uk: Зазвичай у кінці речення:

source: Frequency adverbs before main verbs:
ru: Наречия частоты перед основными глаголами:
uk: Прислівники частоти перед основними дієсловами:

source: Initial position for emphasis:
ru: Начальная позиция для выделения:
uk: Початкова позиція для наголосу:

source: 4. Combining Adverb Types
ru: 4. Объединение типов наречий
uk: 4. Комбінування типів прислівників

source: Typical Word Order in Sentences
ru: Типичный порядок слов в предложениях
uk: Типовий порядок слів у реченнях

source: Standard Order:
ru: Стандартный порядок:
uk: Стандартний порядок:

source: Manner - Place - Time
ru: Образ действия - Место - Время
uk: Спосіб дії - Місце - Час

source: Alternative Orders:
ru: Альтернативные порядки:
uk: Альтернативні порядки:

source: Time can come first for emphasis:
ru: Время может стоять первым для выделения:
uk: Час може стояти першим для наголосу:

source: Place before manner with certain verbs:
ru: Место перед образом действия с определенными глаголами:
uk: Місце перед способом дії з певними дієсловами:

source: Common Mistakes to Avoid
ru: Распространенные ошибки, которых следует избегать
uk: Поширені помилки, яких слід уникати

source: Adverbs: Formation of Adverbs
ru: Наречия: Образование наречий
uk: Прислівники: Утворення прислівників

source: Formation of Adverbs
ru: Образование наречий
uk: Утворення прислівників

source: Comprehensive Guide to Adverb Formation
ru: Полное руководство по образованию наречий
uk: Повний посібник з утворення прислівників

source: Understanding how adverbs are formed from adjectives is crucial for accurate English usage. While the -ly suffix is most common, several patterns and exceptions exist.
ru: Понимание того, как наречия образуются от прилагательных, крайне важно для грамотного использования английского языка. Хотя суффикс -ly наиболее распространен, существует несколько моделей и исключений.
uk: Розуміння того, як утворюються прислівники від прикметників, є вирішальним для правильного вживання англійської мови. Хоча суфікс -ly є найпоширенішим, існує кілька схем та винятків.

source: 1. Standard -ly Formation
ru: 1. Стандартное образование с помощью -ly
uk: 1. Стандартне утворення за допомогою -ly

source: The Basic Rule
ru: Основное правило
uk: Основне правило

source: Pronunciation Note:
ru: Примечание по произношению:
uk: Примітка щодо вимови:

source: The -ly ending is typically pronounced /li/ after a consonant sound and /əli/ after an /l/ sound:
ru: Окончание -ly обычно произносится /li/ после согласного звука и /əli/ после звука /l/:
uk: Закінчення -ly зазвичай вимовляється як /li/ після приголосного звуку і /əli/ після звуку /l/:

source: 2. Special Spelling Rules
ru: 2. Особые правила правописания
uk: 2. Спеціальні правила правопису

source: Modified -ly Endings
ru: Измененные окончания -ly
uk: Модифіковані закінчення -ly

source: Adjective → Adverb
ru: Прилагательное → Наречие
uk: Прикметник → Прислівник

source: -y to -ily
ru: -y на -ily
uk: -y на -ily

source: -le to -ly
ru: -le на -ly
uk: -le на -ly

source: -ic to -ically
ru: -ic на -ically
uk: -ic на -ically

source: -ue to -uly
ru: -ue на -uly
uk: -ue на -uly

source: Important Exceptions:
ru: Важные исключения:
uk: Важливі винятки:

source: 3. Irregular Adverb Forms
ru: 3. Неправильные формы наречий
uk: 3. Нерегулярні форми прислівників

source: Adjectives That Don't Follow the -ly Pattern
ru: Прилагательные, которые не следуют шаблону -ly
uk: Прикметники, які не дотримуються схеми з -ly

source: Usage Notes
ru: Примечания по использованию
uk: Примітки щодо вживання

source: Same form
ru: Та же форма
uk: Однакова форма

source: Different meaning
ru: Разное значение
uk: Різне значення

source: No adverb form
ru: Нет формы наречия
uk: Немає форми прислівника

source: Common Confusion Points:
ru: Общие моменты путаницы:
uk: Поширені моменти плутанини:

source: 4. Comparative and Superlative Adverbs
ru: 4. Сравнительная и превосходная степени наречий
uk: 4. Порівняльна та найвища форми прислівників

source: Forming Degrees of Comparison
ru: Образование степеней сравнения
uk: Формування ступенів порівняння

source: Form
ru: Форма
uk: Форма

source: Regular Formation
ru: Правильное образование
uk: Регулярне утворення

source: Adverbs: Formation Rules of Comparison
ru: Наречия: Правила образования степеней сравнения
uk: Прислівники: Правила утворення ступенів порівняння

source: Formation Rules of Comparison
ru: Правила образования степеней сравнения
uk: Правила утворення ступенів порівняння

source: Comparative and Superlative Adverbs: Formation Rules
ru: Сравнительная и превосходная степени наречий: Правила образования
uk: Порівняльна та найвища форми прислівників: Правила утворення

source: Adverbs, like adjectives, can show different degrees of comparison. The formation rules depend on the adverb's structure and origin.
ru: Наречия, как и прилагательные, могут показывать разные степени сравнения. Правила образования зависят от структуры и происхождения наречия.
uk: Прислівники, як і прикметники, можуть показувати різні ступені порівняння. Правила утворення залежать від структури та походження прислівника.

source: 1. One-Syllable Adverbs
ru: 1. Односложные наречия
uk: 1. Односкладові прислівники

source: Most one-syllable adverbs form their comparative and superlative by adding <span class=\
uk: Більшість односкладових прислівників утворюють свою порівняльну та найвищу форми, додаючи <span class=\

source: Comparative (-er)
ru: Сравнительная (-er)
uk: Порівняльна форма (-er)

source: Superlative (-est)
ru: Превосходная (-est)
uk: Найвища форма (-est)

source: Usage Examples:
ru: Примеры использования:
uk: Приклади вживання:

source: 2. Adverbs Ending in -ly
ru: 2. Наречия, оканчивающиеся на -ly
uk: 2. Прислівники, що закінчуються на -ly

source: Most adverbs formed by adding <span class=\
uk: Більшість прислівників, утворених додаванням <span class=\

source: Comparative (more)
ru: Сравнительная (more)
uk: Порівняльна форма (more)

source: Superlative (most)
ru: Превосходная (most)
uk: Найвища форма (most)

source: Important Notes:
ru: Важные примечания:
uk: Важливі примітки:

source: Never add <span class=\
uk: Ніколи не додавайте <span class=\

source: Some -ly adverbs have irregular forms (see exceptions below)
ru: Некоторые наречия на -ly имеют неправильные формы (см. исключения ниже)
uk: Деякі прислівники на -ly мають нерегулярні форми (див. винятки нижче)

source: In informal speech, some speakers use adjective forms (e.g., 'quicker' instead of 'more quickly')
ru: В неформальной речи некоторые говорящие используют формы прилагательных (например, 'quicker' вместо 'more quickly')
uk: У неформальному мовленні деякі мовці використовують форми прикметників (наприклад, 'quicker' замість 'more quickly')

source: 3. Two-Syllable Adverbs
ru: 3. Двусложные наречия
uk: 3. Двоскладові прислівники

source: These can be tricky - some take <span class=\
uk: Вони можуть бути складними — деякі приймають <span class=\

source: Pattern
ru: Шаблон
uk: Схема

source: Usage Tips:
ru: Советы по использованию:
uk: Поради щодо вживання:

source: Adverbs identical to adjectives often take <span class=\
uk: Прислівники, ідентичні прикметникам, часто приймають <span class=\

source: Most others use <span class=\
uk: Більшість інших використовують <span class=\

source: When in doubt, use <span class=\
uk: Коли сумніваєтеся, використовуйте <span class=\

source: Irregular Adverbs
ru: Неправильные наречия
uk: Нерегулярні прислівники

source: Some common adverbs have completely irregular comparative and superlative forms.
ru: Некоторые распространенные наречия имеют полностью неправильные формы сравнительной и превосходной степеней.
uk: Деякі поширені прислівники мають повністю нерегулярні порівняльні та найвищі форми.

source: Special Cases:
ru: Особые случаи:
uk: Особливі випадки:

source: Sentence Position of Comparative Adverbs
ru: Позиция сравнительных наречий в предложении
uk: Позиція порівняльних прислівників у реченні
