Repository: Depthecho/MyEngSite
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uk

source: Continuous Infinitive: to be running
ru: Длительный инфинитив: to be running (бежать [в процессе])

source: Perfect Infinitive: to have run
ru: Перфектный инфинитив: to have run (убежать)

source: Bare infinitives: Used after modal verbs and some special verbs
ru: Голые инфинитивы: Используются после модальных глаголов и некоторых особых глаголов

source: Split infinitives: Adverbs between 'to' and the verb
ru: Расщепленные инфинитивы: Наречия между 'to' и глаголом

source: 'To' as preposition: Distinguishing from infinitive marker
ru: 'To' как предлог: Отличие от инфинитивного маркера

source: Adding 'to' after modal verbs: I can run, not I can to run
ru: Добавление 'to' после модальных глаголов: I can run (Я могу бежать), не I can to run

source: Confusing with gerunds: I enjoy running, not I enjoy to run
ru: Путаница с герундиями: I enjoy running (Мне нравится бегать), не I enjoy to run

source: Omitting 'to' when required: I want to leave, not I want leave
ru: Пропуск 'to', когда он требуется: I want to leave (Я хочу уйти), не I want leave

source: The negative particle 'not' is used to create negative sentences in English.
ru: Отрицательная частица 'not' используется для создания отрицательных предложений в английском языке.

source: 1. With 'Be' Verbs: She is not here.
ru: 1. С глаголами 'Be': She is not here (Ее здесь нет).

source: 2. With Other Auxiliaries: We have not seen it.
ru: 2. С другими вспомогательными глаголами: We have not seen it (Мы этого не видели).

source: 3. With Main Verbs (using 'do'): They do not know.
ru: 3. С основными глаголами (используя 'do'): They do not know (Они не знают).

source: Negative imperatives: Use 'do not' or 'don't'
ru: Отрицательные повелительные предложения: Используйте 'do not' или 'don't'

source: Non-auxiliary 'have': Requires 'do' support
ru: Не вспомогательный 'have': Требует поддержки 'do'

source: Negative infinitives: 'not' comes before 'to'
ru: Отрицательные инфинитивы: 'not' ставится перед 'to'

source: Negative questions: Inversion with contraction
ru: Отрицательные вопросы: Инверсия с сокращением

source: Omitting auxiliary 'do': I didn't go, not I not went
ru: Пропуск вспомогательного 'do': I didn't go (Я не пошел), не I not went

source: Wrong contraction form: isn't, not amn't
ru: Неправильная форма сокращения: isn't, не amn't

source: Double negatives: I didn't see anyone, not I didn't see no one
ru: Двойные отрицания: I didn't see anyone (Я никого не видел), не I didn't see no one

source: Don't take a direct object: The plane took off.
ru: Не принимают прямого дополнения: The plane took off (Самолет взлетел).

source: Object can separate the verb and particle: turn the music off
ru: Дополнение может разделять глагол и частицу: turn the music off (выключить музыку)

source: Object must follow the entire phrasal verb: look into the matter
ru: Дополнение должно следовать за всем фразовым глаголом: look into the matter (разобраться в деле)

source: Completion or intensification: fill up
ru: Завершение или усиление: fill up (заполнить до конца)

source: Revealing or distributing: give out
ru: Раскрытие или распределение: give out (раздавать)

source: Separation or departure: move away
ru: Разделение или отъезд: move away (отъехать)

source: Continuation or attachment: carry on
ru: Продолжение или привязанность: carry on (продолжать)

source: Word order matters: With separable phrasal verbs, pronoun objects must go between the verb and particle
ru: Порядок слов имеет значение: С разделяемыми фразовыми глаголами местоименные дополнения должны располагаться между глаголом и частицей

source: Formality: Many phrasal verbs have Latin-based equivalents that are more formal
ru: Формальность: Многие фразовые глаголы имеют латинские эквиваленты, которые более формальны

source: Multiple meanings: The same phrasal verb can have different meanings in different contexts
ru: Множественные значения: Один и тот же фразовый глагол может иметь разные значения в разных контекстах

source: Incorrect separation: Trying to separate inseparable phrasal verbs
ru: Неправильное разделение: Попытка разделить неразделяемые фразовые глаголы

source: Literal interpretation: Taking the meaning too literally
ru: Буквальная интерпретация: Слишком буквальное восприятие значения

source: Overuse: Using phrasal verbs when a simpler verb would suffice
ru: Чрезмерное использование: Использование фразовых глаголов, когда достаточно более простого глагола

source: Particles: can often move after the object: Turn the light off OR Turn off the light
ru: Частицы: часто могут перемещаться после дополнения: Turn the light off (Выключи свет) ИЛИ Turn off the light

source: Adverbs: can move to different positions: The plane landed safely OR Safely, the plane landed
ru: Наречия: могут перемещаться на разные позиции: The plane landed safely (Самолет безопасно приземлился) ИЛИ Safely, the plane landed

source: Prepositions: cannot be separated from their objects: Look at the image (NOT Look the image at)
ru: Предлоги: не могут быть отделены от своих объектов: Look at the image (Посмотри на изображение) (НЕ Look the image at)

source: Prepositional objects can become question subjects: The cat jumped over the fence. → What did the cat jump over?
ru: Предложные объекты могут стать объектами вопроса: The cat jumped over the fence. (Кот перепрыгнул через забор.) → What did the cat jump over? (Через что перепрыгнул кот?)

source: Particle objects cannot: We looked up the word. → *What did we look up?
ru: Объекты частиц не могут: We looked up the word. (Мы нашли слово.) → *What did we look up? (Что мы нашли?)

source: Particles can often be replaced with single-word verbs: look up → search; put off → postpone
ru: Частицы часто могут быть заменены глаголами из одного слова: look up → search (искать); put off → postpone (отложить)

source: Special Case: To as infinitive marker (particle) vs preposition: I want to read (particle) vs I went to the store (preposition)
ru: Особый случай: To как маркер инфинитива (частица) vs предлог: I want to read (Я хочу читать) (частица) vs I went to the store (Я пошел в магазин) (предлог)

source: Words that are only particles (e.g., about in look about)
ru: Слова, которые являются только частицами (например, about в look about)

source: Identify the Function: She looked over her shoulder (Preposition) vs. She looked the notes over (Particle)
ru: Определите функцию: She looked over her shoulder (Она посмотрела через плечо) (Предлог) vs. She looked the notes over (Она просмотрела заметки) (Частица)

source: Original (particle): They put the meeting off.
ru: Оригинал (частица): They put the meeting off (Они отложили встречу).

source: Modified (preposition): The meeting is off the calendar.
ru: Измененный (предлог): The meeting is off the calendar (Встреча вне календаря).

source: Original (adverb): We walked slowly down.
ru: Оригинал (наречие): We walked slowly down (Мы медленно шли вниз).

source: Modified (particle): We closed the store down.
ru: Измененный (частица): We closed the store down (Мы закрыли магазин).

source: Creates new verb meaning: look up (search)
ru: Создает новое значение глагола: look up (искать)

source: Adds descriptive information: looked up (raised eyes)
ru: Добавляет описательную информацию: looked up (поднял глаза)

source: 1. Movement Test: Adverbs can often move; particles cannot: I quickly picked up the box. OR I picked the box up quickly.
ru: 1. Тест на перемещение: Наречия часто могут двигаться; частицы не могут: I quickly picked up the box (Я быстро поднял коробку). ИЛИ I picked the box up quickly.

source: 2. Meaning Test: Does it create a new verb meaning? (Particle: give up → surrender, Adverb: gave up the stairs)
ru: 2. Тест на значение: Создает ли оно новое значение глагола? (Частица: give up → сдаться, Наречие: gave up the stairs (поднимался по лестнице))

source: 3. Separation Test: Can it separate from the verb with an object? (Particle: pick it up, Adverb: pick up the stairs)
ru: 3. Тест на разделение: Может ли оно отделяться от глагола с дополнением? (Частица: pick it up, Наречие: pick up the stairs)

source: Confusing separable particles with adverbs: The adverb can't go between verb and particle
ru: Путаница разделяемых частиц с наречиями: Наречие не может стоять между глаголом и частицей

source: Misplacing adverbs in phrasal verbs: The verb-particle unit must stay together
ru: Неправильное расположение наречий во фразовых глаголах: Глагольно-частичный блок должен оставаться вместе

source: Overlooking idiomatic meanings: look up (search) is a particle, look up (raise eyes) is an adverb
ru: Игнорирование идиоматических значений: look up (искать) — частица, look up (поднять глаза) — наречие

source: New meaning: Look up (search)
ru: Новое значение: Look up (искать)

source: Common Dual-Function Words: up, down, over, off, in, out
ru: Распространенные слова с двойной функцией: up, down, over, off, in, out

source: Particle: Bring up the topic.
ru: Частица: Bring up the topic (Поднимите тему).

source: Preposition: Walk up the stairs.
ru: Предлог: Walk up the stairs (Поднимитесь по лестнице).

source: Turn off the light → Turn it off
ru: Частица: Turn off the light (Выключи свет) → Turn it off

source: Walk up the hill → *Walk it up
ru: Предлог: Walk up the hill (Поднимитесь на холм) → *Walk it up

source: She sat on the chair → What did she sit on?
ru: Предлог: She sat on the chair (Она сидела на стуле) → What did she sit on?

source: She turned on the light → *What did she turn on?
ru: Частица: She turned on the light (Она включила свет) → *What did she turn on?

source: Please wrap up the package.
ru: Частица: Please wrap up the package (Пожалуйста, заверните посылку).

source: The cat jumped up the curtain.
ru: Предлог: The cat jumped up the curtain (Кот прыгнул на занавеску).

source: 1. Infinitive Particle (to)
ru: 1. Частица инфинитива (to)

source: Bare infinitives (without 'to') after modal verbs: I must leave.
ru: Голые инфинитивы (без 'to') после модальных глаголов: I must leave (Я должен уйти).

source: Split infinitives (adverbs between 'to' and verb): To boldly go.
ru: Расщепленные инфинитивы (наречия между 'to' и глаголом): To boldly go (Смело идти).

source: 2. Negative Particle (not)
ru: 2. Отрицательная частица (not)

source: After auxiliary verbs in standard negation: I have not finished.
ru: После вспомогательных глаголов в стандартном отрицании: I have not finished (Я не закончил).

source: With non-auxiliary verbs (requires 'do' support): I do not agree.
ru: С не-вспомогательными глаголами (требуется поддержка 'do'): I do not agree (Я не согласен).

source: Contracted forms common in speech: I haven't seen it.
ru: Сокращенные формы, распространенные в речи: I haven't seen it (Я это не видел).

source: Before main verbs with auxiliaries: He will not leave.
ru: Перед основными глаголами со вспомогательными: He will not leave (Он не уйдет).

source: After 'to be' when it's the main verb: She is not ready.
ru: После 'to be', когда это основной глагол: She is not ready (Она не готова).

source: Common Particles: up, down, off, out, in, over
ru: Распространенные частицы: up, down, off, out, in, over

source: Intransitive: They broke up.
ru: Непереходные: They broke up (Они расстались).

source: No direct object: They broke up (finished relationship).
ru: Нет прямого дополнения: They broke up (закончили отношения).

source: Transitive separable: Turn off the light. OR Turn the light off.
ru: Переходные разделяемые: Turn off the light (Выключи свет). ИЛИ Turn the light off.

source: Object can separate verb and particle: Put the book down.
ru: Дополнение может разделять глагол и частицу: Put the book down (Положи книгу).

source: Transitive inseparable: Look after the cat. (*Look the cat after is wrong)
ru: Переходные неразделяемые: Look after the cat (Присмотри за кошкой). (*Look the cat after — неправильно)

source: Particle must stay with verb: Look after (take care of).
ru: Частица должна оставаться с глаголом: Look after (заботиться).

source: Hesitation markers: like, well, you know
ru: Маркеры нерешительности: like, well, you know (типа, ну, знаешь)

source: Response signals: oh, ah, right
ru: Сигналы ответа: oh, ah, right (о, а, понятно)

source: Emphasis markers: just, only, really
ru: Маркеры акцента: just, only, really (просто, только, действительно)

source: Conversation managers: so, anyway, actually
ru: Менеджеры беседы: so, anyway, actually (итак, в любом случае, на самом деле)

source: Uninflected: Doesn't change form (no conjugation or declension)
ru: Неизменяемое: Не меняет форму (нет спряжения или склонения)

source: Grammatical function: Modifies or connects other words
ru: Грамматическая функция: Модифицирует или связывает другие слова

source: Small size: Typically one or two syllables
ru: Малый размер: Обычно один или два слога

source: Essential meaning: Often crucial to sentence structure
ru: Важное значение: Часто имеет решающее значение для структуры предложения

source: Multi-functional: Can serve different purposes in different contexts
ru: Многофункциональное: Может служить разным целям в разных контекстах

source: The word to: I want to leave.
ru: Слово to: I want to leave (Я хочу уйти).

source: Words that combine with verbs to create new meanings: give up, look after
ru: Слова, которые сочетаются с глаголами для создания новых значений: give up (сдаваться), look after (присматривать)

source: Words that organize conversation or add emphasis: well, like, just
ru: Слова, которые организуют беседу или добавляют акцент: well, like, just (ну, типа, просто)

source: Essential for phrasal verbs: Often change a verb's meaning completely (turn off)
ru: Необходимы для фразовых глаголов: Часто полностью меняют значение глагола (turn off - выключить)

source: Create infinitives: Necessary for many verb constructions (to go)
ru: Создают инфинитивы: Необходимы для многих глагольных конструкций (to go - идти)

source: Form negations: Fundamental for negative statements (do not)
ru: Формируют отрицания: Основополагающие для отрицательных утверждений (do not - не)

source: Add nuance: Convey subtle shades of meaning (just finished)
ru: Добавляют нюанс: Передают тонкие оттенки смысла (just finished - только что закончил)

source: Similar Words (Adverbs, Prepositions, Conjunctions)
ru: Похожие слова (Наречия, Предлоги, Союзы)

source: Modify verbs, no object required (look up)
ru: Модифицируют глаголы, дополнение не требуется (look up - искать)

source: Can't move freely in sentence (turn off the light / turn the light off)
ru: Не могут свободно перемещаться в предложении (turn off the light / turn the light off)

source: Be about to (imminent action): The plane is about to land.
ru: Be about to (неминуемое действие): The plane is about to land (Самолет вот-вот приземлится).

source: How about (suggestions): How about a cup of tea?
ru: How about (предложения): How about a cup of tea? (Как насчет чашки чая?)

source: Most importantly: Above all, be honest.
ru: Самое главное: Above all, be honest (Прежде всего, будь честен).

source: Honest and legal: Above board transactions.
ru: Честный и законный: Above board transactions (Честные сделки).

source: Too good to be suspected: Above suspicion.
ru: Слишком хорош, чтобы быть подозреваемым: Above suspicion (Вне подозрений).

source: After + -ing form: After finishing the task, she relaxed.
ru: After + -ing форма: After finishing the task, she relaxed (После завершения задания она расслабилась).

source: After + noun (time periods): After the meeting, we went home.
ru: After + существительное (периоды времени): After the meeting, we went home (После встречи мы пошли домой).

source: After + pronoun: He arrived after me.
ru: After + местоимение: He arrived after me (Он приехал после меня).

source: Despite what was thought: After all, he was right.
ru: Вопреки тому, что думали: After all, he was right (В конце концов, он был прав).

source: Repeatedly over time: Time after time, I forget the key.
ru: Неоднократно с течением времени: Time after time, I forget the key (Раз за разом я забываю ключ).

source: After something happened: She took after her mother.
ru: После того, как что-то случилось (походить на кого-то): She took after her mother (Она пошла в мать).

source: Before + -ing form: Look both ways before crossing the road.
ru: Before + -ing форма: Look both ways before crossing the road (Посмотри в обе стороны, прежде чем переходить дорогу).

source: Before + noun (time periods): Before sunrise, the air is cold.
ru: Before + существительное (периоды времени): Before sunrise, the air is cold (До восхода солнца воздух холодный).

source: Before + pronoun: I was there before him.
ru: Before + местоимение: I was there before him (Я был там до него).

source: Initial Position: Before you start, read the instructions.
ru: Начальная позиция: Before you start, read the instructions (Прежде чем начать, прочтите инструкции).

source: Mid Position: She left after dinner.
ru: Средняя позиция: She left after dinner (Она ушла после ужина).

source: Confusing with 'afterwards' and 'beforehand': After is a preposition; afterwards is an adverb.
ru: Путаница с 'afterwards' (потом) и 'beforehand' (заранее): After — предлог; afterwards — наречие.

source: Using with present perfect: Use 'before' with Present Perfect to mean 'at any time up to now': I haven't seen that movie before.
ru: Использование с Present Perfect: Используйте 'before' с Present Perfect, чтобы сказать 'в любое время до настоящего момента': I haven't seen that movie before (Я не видел этот фильм раньше).

source: Soon after: Soon after the rain stopped, the sun appeared.
ru: Вскоре после: Soon after the rain stopped, the sun appeared (Вскоре после того, как дождь прекратился, появилось солнце).

source: Long before: Long before the event, tickets were sold out.
ru: Задолго до: Long before the event, tickets were sold out (Задолго до события билеты были распроданы).

source: Immediately before: Immediately before the explosion, there was silence.
ru: Непосредственно перед: Immediately before the explosion, there was silence (Непосредственно перед взрывом наступила тишина).

source: Specific Points (At)
ru: Конкретные точки (At)

source: Exact locations and addresses: At the bus stop, At 12 Baker Street
ru: Точные местоположения и адреса: At the bus stop (На автобусной остановке), At 12 Baker Street (На Бейкер-стрит, 12)

source: General locations when the exact position isn't important: At home, At the university
ru: Общие местоположения, когда точное положение не важно: At home (Дома), At the university (В университете)

source: Surfaces and Lines (On)
ru: Поверхности и линии (On)

source: Horizontal and vertical surfaces: On the floor, On the wall
ru: Горизонтальные и вертикальные поверхности: On the floor (На полу), On the wall (На стене)

source: Transportation (except cars): On the train, On a bicycle
ru: Транспорт (кроме автомобилей): On the train (В поезде), On a bicycle (На велосипеде)

source: Streets and roads: On Fifth Avenue, On the M4
ru: Улицы и дороги: On Fifth Avenue (На Пятой авеню), On the M4 (На трассе M4)

source: Enclosed Spaces (In)
ru: Ограниченные пространства (In)

source: Geographical areas: In the city, In Russia
ru: Географические районы: In the city (В городе), In Russia (В России)

source: Enclosed containers: In the box, In the water
ru: Закрытые емкости: In the box (В коробке), In the water (В воде)

source: Transportation (cars): In the car, In a taxi
ru: Транспорт (автомобили): In the car (В машине), In a taxi (В такси)

source: Precise Times (At)
ru: Точное время (At)

source: Clock times: At 6 o'clock, At midnight
ru: Время по часам: At 6 o'clock (В 6 часов), At midnight (В полночь)

source: Specific points in daily routines: At lunchtime, At sunset
ru: Конкретные точки в ежедневном распорядке: At lunchtime (В обеденное время), At sunset (На закате)

source: Holiday periods (when referring to the time itself): At Christmas, At Easter
ru: Периоды праздников (при упоминании самого времени): At Christmas (На Рождество), At Easter (На Пасху)

source: Specific Days (On)
ru: Конкретные дни (On)

source: Days of the week: On Monday, On Friday
ru: Дни недели: On Monday (В понедельник), On Friday (В пятницу)

source: Special days: On my birthday, On New Year's Day
ru: Особые дни: On my birthday (В мой день рождения), On New Year's Day (В Новый год)

source: Day parts with modifiers: On a cold morning
ru: Части дня с модификаторами: On a cold morning (Холодным утром)

source: Longer Periods (In)
ru: Более длительные периоды (In)

source: Months: In July, In December
ru: Месяцы: In July (В июле), In December (В декабре)

source: Seasons: In the summer, In winter
ru: Времена года: In the summer (Летом), In winter (Зимой)

source: Years: In 1999, In the 21st century
ru: Годы: In 1999 (В 1999 году), In the 21st century (В 21 веке)

source: General day parts: In the morning, In the afternoon (but 'at night' or 'in the night')
ru: Общие части дня: In the morning (Утром), In the afternoon (Днем) (но 'at night' или 'in the night' - ночью)

source: Before time expressions starting with this, next, last, every: I'll see you next Tuesday (not 'on next Tuesday')
ru: Перед выражениями времени, начинающимися с this, next, last, every: I'll see you next Tuesday (Я увижу тебя в следующий вторник) (не 'on next Tuesday')

source: Agent in passive voice: The book was written by Jane.
ru: Действующее лицо в пассивном залоге: The book was written by Jane (Книга была написана Джейн).

source: Means/method: We travel by bus.
ru: Средство/способ: We travel by bus (Мы путешествуем на автобусе).

source: Time deadline: The report is due by Friday.
ru: Крайний срок: The report is due by Friday (Отчет должен быть сдан к пятнице).

source: Proximity: The house is by the river.
ru: Близость: The house is by the river (Дом находится у реки).

source: By + reflexive pronoun: He lives by himself.
ru: By + возвратное местоимение: He lives by himself (Он живет сам по себе).

source: By + time expressions: By day, it is busy.
ru: By + выражения времени: By day, it is busy (Днем здесь оживленно).

source: By + gerund: You succeed by working hard.
ru: By + герундий: You succeed by working hard (Ты добьешься успеха, усердно работая).

source: Purpose: This money is for the trip.
ru: Цель: This money is for the trip (Эти деньги предназначены для поездки).

source: Beneficiary: I baked a cake for her.
ru: Бенефициар: I baked a cake for her (Я испек для нее торт).

source: Duration: We waited for three hours.
ru: Продолжительность: We waited for three hours (Мы ждали три часа).

source: Exchange: I bought this for ten dollars.
ru: Обмен: I bought this for ten dollars (Я купил это за десять долларов).

source: For + noun: I went out for a walk.
ru: For + существительное: I went out for a walk (Я вышел на прогулку).

source: For + gerund: The machine is used for cutting wood.
ru: For + герундий: The machine is used for cutting wood (Станок используется для резки дерева).

source: For + period: I have lived here for five years.
ru: For + период: I have lived here for five years (Я живу здесь пять лет).

source: Origin: He is from Canada.
ru: Происхождение: He is from Canada (Он из Канады).

source: Source: I heard the news from a friend.
ru: Источник: I heard the news from a friend (Я услышал новость от друга).

source: Time starting point: The store is open from 9 am.
ru: Начальная точка времени: The store is open from 9 am (Магазин открыт с 9 утра).

source: Material change: The wine is made from grapes.
ru: Изменение материала: The wine is made from grapes (Вино делают из винограда).

source: From...to: The event runs from Monday to Friday.
ru: From...to: The event runs from Monday to Friday (Мероприятие проходит с понедельника по пятницу).
